//Формирует записи в регистре коды синхронизации
//в случае изменения реквизита КодСинхронизации
Процедура ОбновитьКодСинхронизации(Номенклатура, НовыйКод) Экспорт
	
	Отбор = Новый Структура("Номенклатура", Номенклатура); 
	СрезПоследних = РегистрыСведений.КодыСинхронизацииУНФ.ПолучитьПоследнее(ТекущаяДата(),Отбор);	
	
	Если НЕ СрезПоследних.НовыйКод = НовыйКод Тогда
		НоваяЗапись = РегистрыСведений.КодыСинхронизацииУНФ.СоздатьМенеджерЗаписи();
		НоваяЗапись.Номенклатура = Номенклатура;
		НоваяЗапись.Период = ТекущаяДата();
		НоваяЗапись.НовыйКод = НовыйКод;
		НоваяЗапись.Код = СрезПоследних.НовыйКод;
		НоваяЗапись.Записать();
	КонецЕсли;
	
КонецПроцедуры
