
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьОтборПроцессов();
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПроцессов()
	
	Процессы.Параметры.УстановитьЗначениеПараметра("Владелец", Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСоздатьПрограмму(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Сообщить("Элемент справочника не записан");
		Возврат
	КОнецЕсли;
	
	ОткрытьФорму("Справочник.ПроцессПрограммыТермообработки.Форма.ФормаЭлемента", Новый Структура("Владелец", Объект.Ссылка),ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры
	