Перем МассивДокументов;

Процедура СформироватьКомплекты()Экспорт
	
	МассивДокументов = Новый Массив;
	ПустаяХарактеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	
	
	ПустаяХарактеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	СтруктураУпаковки = Неопределено;
	
	Форма = ПолучитьФорму("Форма");
	
	Если Форма.Открыта() Тогда
		Прогресс = Форма.ЭлементыФормы.Индикатор;
		Прогресс.Значение = 0;
		Прогресс.МаксимальноеЗначение =  (ДатаОкончания - ДатаНачала) / 86400;
	КонецЕсли;
		
	 n = 0;
	 	 
	Дата = ДатаНачала;
	 
	Пока (ДатаНачала + n*86400) <= ДатаОкончания Цикл
		
		Дата = ДатаНачала + n*86400;
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслугТовары.Номенклатура,
		|	РеализацияТоваровУслугТовары.ХарактеристикаНоменклатуры,
		|	СУММА(РеализацияТоваровУслугТовары.Количество) КАК Количество,
		|	РеализацияТоваровУслугТовары.Ссылка.Склад,
		|	РеализацияТоваровУслугТовары.Коэффициент,
		|	РеализацияТоваровУслугТовары.ЕдиницаИзмерения,
		|	РеализацияТоваровУслугТовары.СчетУчетаБУ,
		|	РеализацияТоваровУслугТовары.СерияНоменклатуры,
		|	РеализацияТоваровУслугТовары.НалоговоеНазначение
		|ПОМЕСТИТЬ ВремТаб
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|ГДЕ
		|	РеализацияТоваровУслугТовары.Ссылка.Дата МЕЖДУ &ДатаН И &ДатаК
		|	И РеализацияТоваровУслугТовары.Ссылка.Проведен = ИСТИНА
		|	И НЕ РеализацияТоваровУслугТовары.ХарактеристикаНоменклатуры = &ПустаяХарактеристика
		|	И РеализацияТоваровУслугТовары.Ссылка.Склад = &Склад
		|	И РеализацияТоваровУслугТовары.Ссылка.Организация = &Организация
		|
		|СГРУППИРОВАТЬ ПО
		|	РеализацияТоваровУслугТовары.Номенклатура,
		|	РеализацияТоваровУслугТовары.ХарактеристикаНоменклатуры,
		|	РеализацияТоваровУслугТовары.Ссылка.Склад,
		|	РеализацияТоваровУслугТовары.Коэффициент,
		|	РеализацияТоваровУслугТовары.ЕдиницаИзмерения,
		|	РеализацияТоваровУслугТовары.СчетУчетаБУ,
		|	РеализацияТоваровУслугТовары.СерияНоменклатуры,
		|	РеализацияТоваровУслугТовары.НалоговоеНазначение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ХозрасчетныйОстатки.КоличествоОстаток,
		|	ВремТаб.Номенклатура,
		|	ВремТаб.ХарактеристикаНоменклатуры,
		|	ХозрасчетныйОстатки.КоличествоОстаток * -1 / ВремТаб.Коэффициент КАК Количество,
		|	ВремТаб.Коэффициент,
		|	ВремТаб.ЕдиницаИзмерения,
		|	ВремТаб.СчетУчетаБУ,
		|	ВремТаб.СерияНоменклатуры,
		|	ВремТаб.НалоговоеНазначение
		|ИЗ
		|	ВремТаб КАК ВремТаб
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Остатки(
		|				&Период,
		|				Счет = &Счет_26,
		|				,
		|				Субконто2 = &Склад
		|					И Организация = &Организация) КАК ХозрасчетныйОстатки
		|		ПО ВремТаб.Номенклатура = ХозрасчетныйОстатки.Субконто1
		|			И ВремТаб.Склад = ХозрасчетныйОстатки.Субконто2
		|			И ВремТаб.ХарактеристикаНоменклатуры = ХозрасчетныйОстатки.Субконто3.ХарактеристикаНоменклатуры
		|ГДЕ
		|	ХозрасчетныйОстатки.КоличествоОстаток < 0";
		
		Запрос.УстановитьПараметр("ДатаН", НачалоДня(Дата));
		Запрос.УстановитьПараметр("ДатаК", КонецДня(Дата));
		Запрос.УстановитьПараметр("Период",Новый Граница(КонецДня(Дата), ВидГраницы.Включая));
		Запрос.УстановитьПараметр("Склад", СкладПродукции);
		Запрос.УстановитьПараметр("Счет_26", ПланыСчетов.Хозрасчетный.ГотоваяПродукция);
		Запрос.УстановитьПараметр("ПустаяХарактеристика", ПустаяХарактеристика);
		Запрос.УстановитьПараметр("Организация",Организация);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ТаблицаПродукции = РезультатЗапроса.Выгрузить();
		
		 n = n + 1;
		 
		// Создаем документ комплект
		
		НомерДокументаВПорции = 0;
		
		Для Каждого СтрокаПродукции Из ТаблицаПродукции Цикл
			
			ОбработкаПрерыванияПользователя();
			
			
			Если НомерДокументаВПорции >= ДокументПорция
				Тогда
				umk_Доработки.Пауза(ПаузаМеждуПорциями);
				НомерДокументаВПорции = 0
			КонецЕсли;
			
			
		   ТаблицаКомплектующих = ПолучитьКомплектующие(СтрокаПродукции.ХарактеристикаНоменклатуры, НачалоМесяца(Дата));
		   
		   Если Не ТаблицаКомплектующих = Неопределено  Тогда
			   
			   ДокументСоздан = СоздатьДокументКомплектации(СтрокаПродукции, ТаблицаКомплектующих, Дата + 1);
			   
			   Если Не ДокументСоздан  Тогда
				   Сообщить(Строка(ТекущаяДата()) + ". Операция прервана в периоде: " + Строка(Дата), СтатусСообщения.ОченьВажное);
				   Возврат
			   КонецЕсли;
		   КонецЕсли;
		   
		НомерДокументаВПорции = НомерДокументаВПорции +1;
		
		КонецЦикла; // По документам комплектация за день
		
		
		Если Форма.Открыта() тогда
			
			Прогресс.Значение = Прогресс.Значение + 1;	
			
		КонецЕсли;
		
	КонецЦикла;
	
	
	#Если Клиент Тогда
		
	#КонецЕсли

	
Конецпроцедуры

Функция СоздатьДокументКомплектации(СтрокаПродукции, ТаблицаКомплектующих, Дата)
	 
	
	Документ = Документы.КомплектацияНоменклатуры.СоздатьДокумент();
	Документ.Дата = Дата;
	Документ.Комментарий = "##Создан обработкой";
	
	// Заполнить реквизиты значениями по умолчанию.
	ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(Документ, глЗначениеПеременной("глТекущийПользователь"));
	ОбщегоНазначения.ЗаполнитьОбязательныеРеквизитыШапкиНовогоДокумента(Документ, глЗначениеПеременной("глТекущийПользователь"));
	Документ.Склад = СкладПродукции;
	Документ.СкладМатериалов = СкладМатериалов;
	Документ.СпособСписанияОстаткаТоваров = Перечисления.СпособыСписанияОстаткаТоваров.СоСклада;
	
	ЗаполнитьЗначенияСвойств(Документ, СтрокаПродукции);
	Документ.Склад = СкладПродукции;
	Документ.Организация = Организация;
		
	// 1.Номенклатура 
	НоваяСтрока = Документ.Комплектующие.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПродукции,,"ХарактеристикаНоменклатуры");
	
	Для Каждого СтрокаКомпл Из ТаблицаКомплектующих Цикл 
		
		// 2.Упаковка
		НоваяСтрока = Документ.Комплектующие.Добавить();
		
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаКомпл);
		КоличествоНеобходимо = СтрокаКомпл.Количество * СтрокаПродукции.Количество * СтрокаПродукции.Коэффициент;
		НоваяСтрока.Количество = ?(КоличествоНеобходимо < 0.001, 0.001, КоличествоНеобходимо);

		
		// Выполнить общие действия для всех документов при изменении номенклатуры.
		ОбработкаТабличныхЧастей.ПриИзмененииНоменклатурыТабЧасти(НоваяСтрока, Документ);
		
		ОбработкаТабличныхЧастей.ЗаполнитьСпособСписанияОстаткаКомплектующихТабЧасти(НоваяСтрока, Документ);
		Документ.ЗаполнитьСчетаУчетаВСтрокеТабЧасти(НоваяСтрока, "Комплектующие", 
		Документ.ОтражатьВБухгалтерскомУчете, Документ.ОтражатьВБухгалтерскомУчете);
		
	КонецЦикла;
	
	
	//ДокументЗаписан = ЗаписатьДокумент(Документ, 0);
	
	ДокументЗаписан = Ложь;
	
	ЗаписатьДокумент(Документ, 0, ДокументЗаписан);
	
	Возврат ДокументЗаписан
	
КонецФункции

Процедура ЗаписатьДокумент(ДокументОбъект, НомерПопытки, ДокументЗаписан, ПерваяПопытка = Истина)
	
	ОбработкаПрерыванияПользователя();
	
	Если Не  ПерваяПопытка Тогда
		
		umk_Доработки.Пауза(ПаузаМеждуПопытками);
		
	КонецЕсли;
	
	Если НомерПопытки >= КоличествоПопыток И Не ПерваяПопытка
		
		Тогда
		
		ДокументЗаписан = Ложь;
		
		Возврат
		
	КонецЕсли;
	
	
	Попытка						
		
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		ДокументЗаписан = Истина;
		
		Возврат 
		
	Исключение
		
		НомерПопытки = НомерПопытки + 1;
		ПерваяПопытка = Ложь;
		
		ЗаписатьДокумент(ДокументОбъект, НомерПопытки, ДокументЗаписан, Ложь);
		
	КонецПопытки;

	
КонецПроцедуры

Функция ПолучитьКомплектующие(Характеристика, Период)
		
	// По ссылке;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	
	"ВЫБРАТЬ
	|	УстановкаНормРасходаУпаковкиМатериалы.Номенклатура,
	|	УстановкаНормРасходаУпаковкиМатериалы.Количество,
	|	УстановкаНормРасходаУпаковкиМатериалы.ЕдиницаИзмерения,
	|	УстановкаНормРасходаУпаковкиМатериалы.Коэффициент,
	|	УстановкаНормРасходаУпаковкиМатериалы.ХарактеристикаНоменклатуры,
	|	УстановкаНормРасходаУпаковкиМатериалы.СерияНоменклатуры
	|ИЗ
	|	РегистрСведений.umk_НормыРасходаУпаковки КАК НормыРасходаУпаковки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УстановкаНормРасходаУпаковки.Материалы КАК УстановкаНормРасходаУпаковкиМатериалы
	|		ПО НормыРасходаУпаковки.ДокументУстановкаНорм = УстановкаНормРасходаУпаковкиМатериалы.Ссылка
	|ГДЕ
	|	НормыРасходаУпаковки.Упаковка.Наименование = &НаименованиеХарактеристики
	|	И НормыРасходаУпаковки.Период = &Период";
	
	Запрос.УстановитьПараметр("НаименованиеХарактеристики", Характеристика.Наименование);
	Запрос.УстановитьПараметр("Период", Период);
	
	ТаблицаКомплектующих =  Запрос.Выполнить().Выгрузить();
	
	Если Не ТаблицаКомплектующих.Количество() = 0
		Тогда  Возврат ТаблицаКомплектующих
	КонецЕсли;
	
	// По наименование;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	
	"ВЫБРАТЬ
	|	umk_УстановкаНормРасходаУпаковкиМатериалы.Номенклатура,
	|	umk_УстановкаНормРасходаУпаковкиМатериалы.Количество,
	|	umk_УстановкаНормРасходаУпаковкиМатериалы.ЕдиницаИзмерения,
	|	umk_УстановкаНормРасходаУпаковкиМатериалы.Коэффициент,
	|	umk_УстановкаНормРасходаУпаковкиМатериалы.ХарактеристикаНоменклатуры,
	|	umk_УстановкаНормРасходаУпаковкиМатериалы.СерияНоменклатуры
	|ИЗ
	|	РегистрСведений.umk_НормыРасходаУпаковки КАК umk_НормыРасходаУпаковки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УстановкаНормРасходаУпаковки.Материалы КАК umk_УстановкаНормРасходаУпаковкиМатериалы
	|		ПО umk_НормыРасходаУпаковки.ДокументУстановкаНорм = umk_УстановкаНормРасходаУпаковкиМатериалы.Ссылка
	|ГДЕ
	|	umk_НормыРасходаУпаковки.Упаковка = &НаименованиеХарактеристики
	|	И umk_НормыРасходаУпаковки.Период = &Период";
	
	Запрос.УстановитьПараметр("НаименованиеХарактеристики", Характеристика.Наименование);
	Запрос.УстановитьПараметр("Период", Период);
	
	ТаблицаКомплектующих =  Запрос.Выполнить().Выгрузить();
	
	Если Не ТаблицаКомплектующих.Количество() = 0
		Тогда  Возврат ТаблицаКомплектующих
	КонецЕсли;
	

	
	
	// Иначе По группе упаковки
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УстановкаНормРасходаУпаковкиМатериалы.Номенклатура,
		|	УстановкаНормРасходаУпаковкиМатериалы.Количество,
		|	УстановкаНормРасходаУпаковкиМатериалы.ЕдиницаИзмерения,
		|	УстановкаНормРасходаУпаковкиМатериалы.Коэффициент,
		|	УстановкаНормРасходаУпаковкиМатериалы.ХарактеристикаНоменклатуры,
		|	УстановкаНормРасходаУпаковкиМатериалы.СерияНоменклатуры
		|ИЗ
		|	РегистрСведений.umk_НормыРасходаУпаковки КАК НормыРасходаУпаковки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УстановкаНормРасходаУпаковки.Материалы КАК УстановкаНормРасходаУпаковкиМатериалы
		|		ПО НормыРасходаУпаковки.ДокументУстановкаНорм = УстановкаНормРасходаУпаковкиМатериалы.Ссылка
		|ГДЕ
		|	НормыРасходаУпаковки.Упаковка.Ссылка = &ГруппаХарактеристики
		|	И НормыРасходаУпаковки.Период = &Период";
	
		
	Запрос.УстановитьПараметр("ГруппаХарактеристики", Характеристика.umk_ГруппаХарактеристики);
	Запрос.УстановитьПараметр("Период", Период);
	
	ТаблицаКомплектующих = Запрос.Выполнить().Выгрузить();
	
	Если Не ТаблицаКомплектующих.Количество() = 0
		Тогда  Возврат ТаблицаКомплектующих
	КонецЕсли;

	// Нет ничего
	
	Сообщить("Не установлена норма расхода комплектующих для номенклатуры: " + Строка(Характеристика.Владелец) + ", хар-ка: " + Строка(Характеристика));
	
	Возврат Неопределено

		
КонецФункции