
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	мВалютаРегламентированногоУчета   = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	мУказаниеСкладовВТЧ = Ложь;
	ЦенаВключаетНДС = Объект.СуммаВключаетНДС;
	
	
	//Шапка значений нового документа
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ДокументОбъект = РеквизитФормыВЗначение("Объект");
		
		ЗаполнениеДокументовСервер.ЗаполнитьШапкуДокумента(ДокументОбъект, глЗначениеПеременной("глТекущийПользователь"), мВалютаРегламентированногоУчета, "Продажа", , );	
		ОбщегоНазначения.ЗаполнитьОбязательныеРеквизитыШапкиНовогоДокумента(ДокументОбъект, глЗначениеПеременной("глТекущийПользователь"));
		
		ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
		
		Объект.Склад = Константы.umk_СкладПродукции.Получить();
		
		СчетаУчета = УправлениеВзаиморасчетами.ПолучитьСчетаРасчетовСКонтрагентом(Объект.Организация, Объект.Контрагент, Объект.ДоговорКонтрагента);
		
		Если Объект.ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером Тогда
			Объект.СчетУчетаРасчетовСКонтрагентом = СчетаУчета.СчетРасчетовПокупателя;
			Объект.СчетУчетаРасчетовПоАвансам     = СчетаУчета.СчетАвансовПокупателя;
		ИначеЕсли Объект.ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.Бартерный Тогда
			Объект.СчетУчетаРасчетовСКонтрагентом = СчетаУчета.СчетРасчетовПокупателяПриБартере;
			Объект.СчетУчетаРасчетовПоАвансам     = СчетаУчета.СчетАвансовПокупателяПриБартере;
		Иначе
			Объект.СчетУчетаРасчетовСКонтрагентом = СчетаУчета.СчетРасчетовПокупателя;
			Объект.СчетУчетаРасчетовПоАвансам     = СчетаУчета.СчетАвансовПокупателя;
		КонецЕсли;
		
		Объект.СчетУчетаРасчетовПоТаре          = СчетаУчета.СчетУчетаТарыПокупателя;
		Объект.СчетУчетаРасчетовПоТареПоАвансам = СчетаУчета.СчетАвансовПоТареПокупателя;
		
		Объект.СчетУчетаНДС 				= СчетаУчета.СчетУчетаНДСПродаж;
		Объект.СчетУчетаНДСПодтвержденный  = СчетаУчета.СчетУчетаНДСПродажПодтвержденный;
		
		
		Объект.АвторасчетНДС = Истина;
		
	КонецЕсли;
	
	ОбновитьИтогиСервер();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	КонтрагентПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
	Объект.ДоговорКонтрагента = ЗаполнениеДокументов.ПолучитьДоговорПоОрганизацииИКонтрагенту(Объект.Организация, Объект.Контрагент);
КонецПроцедуры

&НаКлиенте
Процедура СуммаВключаетНДСПриИзменении(Элемент)
	ПересчитатьЦенуСуммуПоНалогам();
	ОбновитьИтогиСервер();
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОрганизацияПриИзмененииНаСервере();
КонецПроцедуры


&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	Объект.Номер = "";
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ЗаполнениеДокументовСервер.ЗаполнитьОтветственоеЛицо(ДокументОбъект);
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
КонецПроцедуры

#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура КомандаПечатьТТН(Команда)
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Или ЭтаФорма.Модифицированность Тогда
		Сообщить("Документ необходимо записать.");
	Иначе
		ОткрытьФорму("Обработка.umk_ПечатьТТН.Форма.ФормаУФ", Новый Структура("Документ", Объект.Ссылка));
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗапасы

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	
	// Рассчитать реквизиты табличной части.
	СтруктрураСтрокиТЧ = Новый Структура("Номенклатура,Количество,КоличествоМест,Коэффициент,СтавкаНДС, СерияНоменклатуры,ХарактеристикаНоменклатуры,
	|Цена,Склад,ЕдиницаИзмерения,ЕдиницаИзмеренияМест,Качество,СпособСписанияОстаткаТоваров,СхемаРеализации,СчетУчетаБУ,НалоговоеНазначение");
	ЗаполнитьЗначенияСвойств(СтруктрураСтрокиТЧ, СтрокаТабличнойЧасти);
	ТоварыНоменклатураПриИзмененииНаСервере(СтруктрураСтрокиТЧ);
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти,СтруктрураСтрокиТЧ);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	
	// Рассчитать реквизиты табличной части.
	СтруктрураСтрокиТЧ = Новый Структура("Количество,КоличествоМест,Коэффициент,ПроцентСкидкиНаценки,СтавкаНДС,Сумма,СуммаНДС,Цена");
	ЗаполнитьЗначенияСвойств(СтруктрураСтрокиТЧ, СтрокаТабличнойЧасти);
	РассчитатьСуммуТабЧастиСервере(СтруктрураСтрокиТЧ);
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти,СтруктрураСтрокиТЧ);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	
	// Рассчитать реквизиты табличной части.
	СтруктрураСтрокиТЧ = Новый Структура("Количество,КоличествоМест,Коэффициент,ПроцентСкидкиНаценки,СтавкаНДС,Сумма,СуммаНДС,Цена");
	ЗаполнитьЗначенияСвойств(СтруктрураСтрокиТЧ, СтрокаТабличнойЧасти);
	ТоварыКоличествоНаСервере(СтруктрураСтрокиТЧ);
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти,СтруктрураСтрокиТЧ);
	

КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	
	 СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	
	// Рассчитать реквизиты табличной части.
	СтруктрураСтрокиТЧ = Новый Структура("Количество,КоличествоМест,Коэффициент,ПроцентСкидкиНаценки,ПроцентАвтоматическихСкидок,
	|СтавкаНДС,Сумма,СуммаНДС,Цена");
	ЗаполнитьЗначенияСвойств(СтруктрураСтрокиТЧ, СтрокаТабличнойЧасти);
	ТоварыСуммаПриИзмененииСервер(СтруктрураСтрокиТЧ);
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти,СтруктрураСтрокиТЧ);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСтавкаНДСПриИзменении(Элемент)
	
	 СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	
	// Рассчитать реквизиты табличной части.
	СтруктрураСтрокиТЧ = Новый Структура("Количество,КоличествоМест,Коэффициент,ПроцентСкидкиНаценки,ПроцентАвтоматическихСкидок,
	|СтавкаНДС,Сумма,СуммаНДС,Цена");
	ЗаполнитьЗначенияСвойств(СтруктрураСтрокиТЧ, СтрокаТабличнойЧасти);
	ТоварыСтавкаНДСПриИзмененииСервер(СтруктрураСтрокиТЧ);
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти,СтруктрураСтрокиТЧ);
	
	
КонецПроцедуры

&НаСервере
Процедура ТоварыНоменклатураПриИзмененииНаСервере(СтруктрураСтрокиТЧ)
	
	ДопПараметры = Новый Структура("ДоговорКонтрагента",Объект.ДоговорКонтрагента);
	ИмяТабЧасти = "Товары";
	
	ОбработкаТабличныхЧастейСервер.ПриИзмененииНоменклатурыТабЧасти(СтруктрураСтрокиТЧ,"Товары");
	
	// Заполняем реквизиты табличной части.
	ОбработкаТабличныхЧастейСервер.ЗаполнитьСтавкуНДСТабЧасти(СтруктрураСтрокиТЧ,"Товары", ДопПараметры, "Реализация");
	ОбработкаТабличныхЧастейСЕрвер.ЗаполнитьСпособСписанияОстаткаТоваровТабЧасти(СтруктрураСтрокиТЧ);

	// Заполнение цены зависит от розничности операции.
	ОбработкаТабличныхЧастейСервер.ЗаполнитьЕдиницуЦенуПродажиТабЧасти(СтруктрураСтрокиТЧ,"Товары", ДопПараметры, мВалютаРегламентированногоУчета); 
	
	
	СчетаУчета     = БухгалтерскийУчет.ПолучитьСчетаУчетаНоменклатуры(Объект.Организация, СтруктрураСтрокиТЧ.Номенклатура, ?(мУказаниеСкладовВТЧ, СтруктрураСтрокиТЧ.Склад, Объект.Склад));
	ЭтоКомиссия    = (Объект.ВидОперации = Перечисления.ВидыОперацийРеализацияТоваров.ПродажаКомиссия
			   		И Объект.ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером);
	
	ЗаполнитьСчетаБУ(СтруктрураСтрокиТЧ, ИмяТабЧасти, СчетаУчета, Истина, ЭтоКомиссия);
	ЗаполнитьСчетаНУ(СтруктрураСтрокиТЧ, ИмяТабЧасти, СчетаУчета, Истина, ЭтоКомиссия);
	
	//ОбновитьИтогиСервер();
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьСуммуТабЧастиСервере(СтруктрураСтрокиТЧ)
	
	ДопПараметры = Новый Структура("УчитыватьНДС,СуммаВключаетНДС",Объект.УчитыватьНДС, Объект.СуммаВключаетНДС);
	
	ОбработкаТабличныхЧастейСервер.РассчитатьСуммуТабЧасти(СтруктрураСтрокиТЧ,"Товары",ДопПараметры);
	ОбработкаТабличныхЧастейСервер.РассчитатьСуммуНДСТабЧасти(СтруктрураСтрокиТЧ,"Товары", ДопПараметры);
	
	//ОбновитьИтогиСервер();
	
КонецПроцедуры

&НаСервере
Процедура ТоварыКоличествоНаСервере(СтруктрураСтрокиТЧ)
	
	// Рассчитать реквизиты табличной части.  --позже сделать
	//ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект);
    РассчитатьСуммуТабЧастиСервере(СтруктрураСтрокиТЧ);
	
	//ОбновитьИтогиСервер();
	
КонецПроцедуры

&НаСервере
Процедура ТоварыСуммаПриИзмененииСервер(СтруктрураСтрокиТЧ)
	
	ДопПараметры = Новый Структура("УчитыватьНДС,СуммаВключаетНДС",Объект.УчитыватьНДС, Объект.СуммаВключаетНДС);
	
	// Выполнить общие действия для всех документов при изменении Суммы.
	ОбработкаТабличныхЧастейСервер.ПриИзмененииСуммыТабЧасти(СтруктрураСтрокиТЧ,"Товары", ДопПараметры, глЗначениеПеременной("глТекущийПользователь"), РассчитыватьАвтоматическиеСкидки(),истина, ,истина,"Товары");

	// Рассчитать реквизиты табличной части.
	ОбработкаТабличныхЧастейСервер.РассчитатьСуммуНДСТабЧасти(СтруктрураСтрокиТЧ,"Товары", ДопПараметры);
	
	//ОбновитьИтогиСервер();
	
КонецПроцедуры

&НаСервере
Процедура ТоварыСтавкаНДСПриИзмененииСервер(СтруктрураСтрокиТЧ);
	
	ДопПараметры = Новый Структура("УчитыватьНДС,СуммаВключаетНДС",Объект.УчитыватьНДС, Объект.СуммаВключаетНДС);
	
	// Рассчитать реквизиты табличной части.
	ОбработкаТабличныхЧастейСервер.РассчитатьСуммуНДСТабЧасти(СтруктрураСтрокиТЧ,"Товары", ДопПараметры);
	
	//ОбновитьИтогиСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПослеУдаления(Элемент)
	//ОбновитьИтогиСервер();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	 ОбновитьИтогиСервер();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Заполняет счета БУ в строке табличной части.
//
Процедура ЗаполнитьСчетаБУ(СтрокаТЧ, ИмяТабЧасти, СчетаУчета, ЗаполнятьБУ, ЭтоКомиссия) Экспорт

	Если ЗаполнятьБУ = Истина Тогда

		СтрокаТЧ.СчетУчетаБУ = СчетаУчета.СчетУчетаБУ;

		Если СтрокаТЧ.Свойство("ПереданныеСчетУчетаБУ") Тогда
			СтрокаТЧ.ПереданныеСчетУчетаБУ = СчетаУчета.СчетПередачиБУ;
		КонецЕсли;

		Если СтрокаТЧ.Свойство("СхемаРеализации") Тогда
			СтрокаТЧ.СхемаРеализации = СчетаУчета.СхемаРеализации;
		КонецЕсли;

	ИначеЕсли ЗаполнятьБУ = Ложь Тогда

		СтрокаТЧ.СчетУчетаБУ = ПланыСчетов.Хозрасчетный.ПустаяСсылка();

		Если СтрокаТЧ.Свойство("ПереданныеСчетУчетаБУ") Тогда
			СтрокаТЧ.ПереданныеСчетУчетаБУ = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
		КонецЕсли;

		Если СтрокаТЧ.Свойство("СхемаРеализации") Тогда
			СтрокаТЧ.СхемаРеализации = Справочники.СхемыРеализации.ПустаяСсылка();
		КонецЕсли;


	КонецЕсли;

КонецПроцедуры //ЗаполнитьСчетаБУ

&НаСервере
// Заполняет счета НУ в строке табличной части.
//
Процедура ЗаполнитьСчетаНУ(СтрокаТЧ, ИмяТабЧасти, СчетаУчета, ЗаполнятьНУ, ЭтоКомиссия)
	
	Если ЗаполнятьНУ  = Истина Тогда

		Если СтрокаТЧ.Свойство("НалоговоеНазначение") Тогда
			СтрокаТЧ.НалоговоеНазначение = СчетаУчета.НалоговоеНазначение;
		КонецЕсли;
		Если СтрокаТЧ.Свойство("НалоговоеНазначениеДоходовИЗатрат") Тогда
			СтрокаТЧ.НалоговоеНазначениеДоходовИЗатрат = СчетаУчета.НалоговоеНазначениеДоходовИЗатрат;
		КонецЕсли;
 
	ИначеЕсли ЗаполнятьНУ = Ложь Тогда
		
		Если СтрокаТЧ.Свойство("НалоговоеНазначение") Тогда
			СтрокаТЧ.НалоговоеНазначение = Справочники.НалоговыеНазначенияАктивовИЗатрат.ПустаяСсылка();
		КонецЕсли;
		Если СтрокаТЧ.Свойство("НалоговоеНазначениеДоходовИЗатрат") Тогда
			СтрокаТЧ.НалоговоеНазначениеДоходовИЗатрат = Справочники.НалоговыеНазначенияАктивовИЗатрат.ПустаяСсылка();
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры // ЗаполнитьСчетаНУ()

&НаСервере
Функция РассчитыватьАвтоматическиеСкидки() Экспорт
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	
	Возврат ДокументОбъект.РассчитыватьАвтоматическиеСкидки()
	
КонецФункции

&НаСервере
Процедура ОбновитьИтогиСервер()
	                        
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	
	// При изменении данных обновим суммы в подвале.
	ИтогоСНДС   = ОбщегоНазначения.ФорматСумм(УчетНДС.ПолучитьСуммуДокументаСНДС(ДокументОбъект, "Товары")+УчетНДС.ПолучитьСуммуДокументаСНДС(ДокументОбъект, "Услуги"));
	НДС = ОбщегоНазначения.ФорматСумм(Объект.Товары.Итог("СуммаНДС")+Объект.Услуги.Итог("СуммаНДС"));
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьЦенуСуммуПоНалогам()
	
	СуммаВключаетНДС = Объект.СуммаВключаетНДС;
	УчитыватьНДС = Объект.УчитыватьНДС;
	
	Для Каждого СтрокаТабличнойЧасти Из Объект.Товары Цикл
		
		// Инициализация переменных
		НадоВключитьНДС  = Ложь;
		НадоИсключитьНДС = Ложь;
		НоваяЦена		= СтрокаТабличнойЧасти.Цена;
		СтавкаНДС        = ПолучитьСтавкуНДСЧислом(СтрокаТабличнойЧасти.СтавкаНДС);
		
		Если УчитыватьНДС Тогда
			Если СуммаВключаетНДС
				И (НЕ ЦенаВключаетНДС) Тогда
				
				// Надо добавлять НДС       
				НадоВключитьНДС = Истина;
			ИначеЕсли (НЕ СуммаВключаетНДС)
				И ЦенаВключаетНДС  Тогда
				
				// Надо исключать НДС       
				НадоИсключитьНДС = Истина;
			КонецЕсли;
		Иначе
			Если ЦенаВключаетНДС Тогда
				// Надо исключать НДС
				НадоИсключитьНДС = Истина;
			КонецЕсли; 
		КонецЕсли;
				
		Если НадоИсключитьНДС Тогда
			НоваяЦена = (НоваяЦена * 100) / (100 + СтавкаНДС);
		КонецЕсли;
		
		Если НадоВключитьНДС Тогда
			НоваяЦена = (НоваяЦена * (100 + СтавкаНДС)) / 100;
		КонецЕсли;
		
		СтрокаТабличнойЧасти.Цена = НоваяЦена;
		
		// Рассчитать реквизиты табличной части.
		СтруктрураСтрокиТЧ = Новый Структура("Количество,КоличествоМест,Коэффициент,ПроцентСкидкиНаценки,ПроцентАвтоматическихСкидок,
		|СтавкаНДС,Сумма,СуммаНДС,Цена");
		ЗаполнитьЗначенияСвойств(СтруктрураСтрокиТЧ, СтрокаТабличнойЧасти);
		РассчитатьСуммуТабЧастиСервере(СтруктрураСтрокиТЧ);
		ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти,СтруктрураСтрокиТЧ);
			
	КонецЦикла;
	
	ЦенаВключаетНДС = СуммаВключаетНДС;
	
КонецПроцедуры
//Вернуть ставку налога числом
&НаСервере
Функция ПолучитьСтавкуНДСЧислом(СтавкаНДС)
	Возврат УчетНДС.ПолучитьСтавкуНДС(СтавкаНДС)
КонецФункции

#КонецОбласти

#Область ИмпортаФайлов

&НаКлиенте
Процедура ВыбратьФайлНакладной77(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Дата) Тогда
		Сообщить("Дата не заполнена!");
		Возврат;
	КонецЕсли; 
	
	АдресВХранилище = "";
	ВыбранноеИмяФайла = "";
	
	Если ПоместитьФайл(АдресВХранилище,,ВыбранноеИмяФайла,,УникальныйИдентификатор) Тогда
		Файл = Новый Файл(ВыбранноеИмяФайла);
		Если НЕ Файл.Расширение = ".mxl" Тогда
			Сообщить("Файл не соответствует расширению "".mxl""");
			Возврат
		КонецЕсли;
		ИмяФайла_накладной77_mxl = Файл.Имя;
		СсылкаНаФайла_накладной77_mxl = АдресВХранилище;
		Модифицированность = Истина;
	Иначе
		Возврат
	КонецЕсли;
	
	Импортирована = Ложь;
	
	ЗагрузитьФайлНакладной77_mxl(".mxl", Импортирована);
	
	Если Импортирована Тогда
		Попытка
			УдалитьФайлы(Файл.ПолноеИмя);
		Исключение
			Сообщить("Возникли проблемы с удалением файла на клиенте.", СтатусСообщения.Важное);   
			Возврат;
		КонецПопытки;
	КонецЕсли;
		
	Объект.umk_Импортирована = Импортирована;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьФайлНакладной77_mxl(Расширение, Импортирована)
	
	Если ЭтоАдресВременногоХранилища(СсылкаНаФайла_накладной77_mxl) Тогда
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(СсылкаНаФайла_накладной77_mxl);
		ИмяВременногоФайла	= ПолучитьИмяВременногоФайла(Расширение);
		ДвоичныеДанные.Записать(ИмяВременногоФайла);		
	КонецЕсли;
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.Прочитать(ИмяВременногоФайла, СпособЧтенияЗначенийТабличногоДокумента.Текст);
	
	//Прочитаем шапку таб. док.
	ТипДок = СокрЛП(ТабДок.Область(1, 9).Текст);
	
	Если ТипДок = "ВН" Тогда
		Сообщить("Вы пытаетесь импортировать возвратную накладную в расходную.");
		Возврат; 
	КонецЕсли;
	
	ЗагрузитьДанныеТоваров_mxl(ТабДок, ТипДок, Импортирована);
	
	Если Импортирована Тогда
		Попытка
			УдалитьФайлы(ИмяВременногоФайла);
		Исключение
			Сообщить("Возникли проблемы с удалением файла на сервере.", СтатусСообщения.Важное);
			Возврат;
		КонецПопытки;
	КонецЕсли;
	
	ОбновитьИтогиСервер();
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДанныеТоваров_mxl(ТабДок, ТипДок, Импортирована)
		
	Если Не Объект.Товары.Количество() = 0 Тогда
		Объект.Товары.Очистить();
	КонецЕсли;
	
	ПлательщикНДС = Истина;
	Объект.УчитыватьНДС     = Истина;
	Объект.СуммаВключаетНДС = Ложь;
	
	Объект.umk_КатЦенФ2 = ТабДок.Область(1, 3).Текст;
	Объект.umk_номерФ2 = "" + СокрЛП(ТабДок.Область(1, 4).Текст) + Сред(СокрЛП(ТабДок.Область(1, 5).Текст),4); 
	ТипЦены = Константы.umk_ТипЦеныПриИмпорте.Получить();
	НомерКолЦены = 5;//?(ТипЦены = 1, 5, 4);
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		Объект.Организация = Константы.umk_ГоловнаяОрганизация.Получить();
	КонецЕсли;
	
	СхемаНО = ОбщегоНазначения.ПолучитьСхемуНалогообложения(Объект.Дата, Объект.Организация);
	
	Если НЕ СхемаНО.Ссылка = Справочники.СхемыНалогообложения.ЕдиныйНалогИНДС
		И Не СхемаНО.Ссылка = Справочники.СхемыНалогообложения.НалогНаПрибыльИНДС ТОгда
		ПлательщикНДС = Ложь;	
	КонецЕсли;

	
	КодПоЕДРПОУ = СокрЛП(ТабДок.Область(1, 7).Текст);
	
	ДатаЗаказаФ2 = СокрЛП(ТабДок.Область(1, 15).Текст);
	ДатаДоставкиФ2 = СокрЛП(ТабДок.Область(1, 17).Текст);
	
	Объект.umk_НомерЗаказаФ2  = СокрЛП(ТабДок.Область(1, 13).Текст); 
	Объект.umk_ДатаЗаказаФ2   = umk_Доработки.ПреобразоватьДату77(ДатаЗаказаФ2);
	Объект.umk_ДатаДоставкиФ2 = umk_Доработки.ПреобразоватьДату77(ДатаДоставкиФ2);
	
	Если НЕ КодПоЕДРПОУ = "" Тогда
		КонтрагентСсылка = Справочники.Контрагенты.НайтиПоРеквизиту("КодПоЕДРПОУ", КодПоЕДРПОУ);
		Если Не КонтрагентСсылка.Пустая() Тогда
			Объект.Контрагент = КонтрагентСсылка;
			КонтрагентПриИзмененииНаСервере();
		КонецЕсли;
	КонецЕсли;
	
	//+EDIN
	Объект.ORDERNUMBER = Объект.Контрагент.ПрефиксЗаказаEDIN + Объект.umk_НомерЗаказаФ2;
	Объект.NUMBER_ = Объект.ORDERNUMBER;
	Объект.ORDERDATE = Объект.umk_ДатаЗаказаФ2;
	Объект.DELIVERYDATE = Объект.umk_ДатаДоставкиФ2;
	//-EDIN
	
	Инд = 2;
	
	Пока Не СокрЛП(ТабДок.Область(Инд, 1).Текст) = "" Цикл
		
		Код = СокрЛП(ТабДок.Область(Инд, 2).Текст);
		Если Код = "" Тогда
			Сообщить("Не задан код для ТМЦ в строке: " + Строка(Инд - 1));
			Инд = Инд + 1;
			Продолжить;
		КонецЕсли;	
		
		ТекЕдиница = СокрЛП(ТабДок.Область(Инд, 22).Текст); // Шамарин
		ТекКоэффициент = СокрЛП(ТабДок.Область(Инд, 23).Текст); // Шамарин
		
		ТекКодДляВесов = СокрЛП(ТабДок.Область(Инд, 24).Текст);
		ТекКодЭтикетки = СокрЛП(ТабДок.Область(Инд, 25).Текст);
		ТекСрокГодности = СокрЛП(ТабДок.Область(Инд, 26).Текст);
		ТекЕдСрокаГодности = СокрЛП(ТабДок.Область(Инд, 27).Текст);
		ТекКодКлиента = СокрЛП(ТабДок.Область(Инд, 17).Текст);
		
		СрокГодности = ?(ТекСрокГодности = "",0, Число(ТекСрокГодности));
		
		ПараметрыСрокаГодности = Новый Структура("ВидСрокаГодности,СрокГодности",ТекЕдСрокаГодности,СрокГодности);
		
		Если Не ЗначениеЗаполнено(ТекКодЭтикетки) Тогда
			Штрихкод = ""	
		Иначе
			Штрихкод = "0" + ?(Не ТекКодДляВесов = "" И Не ТекКодДляВесов = "0", Формат(Число(ТекКодДляВесов),"ЧЦ=1; ЧРГ="),"0") + 
			?(Не ТекКодДляВесов = "" И Не ТекКодДляВесов = "000", Формат(Число(ТекКодЭтикетки),"ЧЦ=3; ЧРГ=; ЧВН="),"000");
		КонецЕсли;
				
		Номенклатура = umk_Доработки.НоменклатураПоКодуСинхронизации(Код, Объект.Дата);
		Если Номенклатура.Пустая() Тогда
			Сообщить("В справочнике номенклатуры не обнаружен элемент: " + ТабДок.Область(Инд,1).Текст + " с кодом: " + Код);
			Инд = Инд + 1;
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекЕдиница) Тогда // Шамарин блок условия
			Если Прав(ТекЕдиница, 1) = "." Тогда
				ТекЕдиница = Лев(ТекЕдиница, СтрДлина(ТекЕдиница) - 1);
			КонецЕсли;
			ТекЕд = Справочники.ЕдиницыИзмерения.НайтиПоНаименованию(ТекЕдиница, Истина, , Номенклатура);
			Если ТекЕд.Пустая() Тогда
				Сообщить("В справочнике единиц для номенклатуры: " + Строка(Номенклатура) + " не обнаружена единица измерения: " + ТекЕдиница);
				Инд = Инд + 1;
				Продолжить;
			КонецЕсли;
			Если Число(ТекКоэффициент) <> ТекЕд.Коэффициент Тогда
				Сообщить("В справочнике единиц для номенклатуры: " + Строка(Номенклатура) + " не совпадает коэффициент единицы: " + ТекЕд);
				//Инд = Инд + 1;
				//Продолжить;				
			КонецЕсли;
		Иначе
			ТекЕд = Номенклатура.ЕдиницаХраненияОстатков;
		КонецЕсли;		
		
		СтрокаТабличнойЧасти = Объект.Товары.Добавить();
		СтрокаТабличнойЧасти.Номенклатура = Номенклатура;
		СтрокаТабличнойЧасти.umk_КодКлиента = ТекКодКлиента;
		
		СтрокаТабличнойЧасти.ЕдиницаИзмерения = ТекЕд;
		
		// Выполнить общие действия для всех документов при изменении номенклатуры.
		ТоварыНоменклатураПриИзмененииНаСервере(СтрокаТабличнойЧасти);
			
		//Упаковка
		ВидУпаковки      = СокрЛП(Строка(ТабДок.Область(Инд, 11).Текст));
		
		НаименованиеУпак = СокрЛП(Строка(ТабДок.Область(Инд, 13).Текст));
		КодУпаковки      = Число(Строка(ТабДок.Область(Инд, 12).Текст)); 
		
		НаименованиеГруппыУпаковок = СокрЛП(Строка(ТабДок.Область(Инд, 14).Текст));
		КодГруппыУпаковок = СокрЛП(Строка(ТабДок.Область(Инд, 15).Текст)); 
		
		НаименованиеДляПечатиУпак =  СокрЛП(ТабДок.Область(Инд, ?(ТипДок = "ВН", 12, 20)).Текст);
		
		umk_Доработки.СоздатьХарактеристику(ТипДок, Объект.Дата, СтрокаТабличнойЧасти, ВидУпаковки, КодУпаковки, НаименованиеУпак,
	    КодГруппыУпаковок,НаименованиеГруппыУпаковок, НаименованиеДляПечатиУпак);
		
		Цена = Число(ТабДок.Область(Инд, НомерКолЦены).Текст);
		СтрокаТабличнойЧасти.Цена =  ?(ПлательщикНДС = Истина, Цена/1.2, Цена);
		СтрокаТабличнойЧасти.Количество = Число(ТабДок.Область(Инд, 3).Текст);
		
		Если Не ПлательщикНДС Тогда //ТипЦены = 1 Тогда
			СтрокаТабличнойЧасти.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;	
		КонецЕсли;
		
		// Рассчитать реквизиты табличной части.
		РассчитатьСуммуТабЧастиСервере(СтрокаТабличнойЧасти);
		
		Если  ТекКодЭтикетки = "" Или ТекКодЭтикетки = "000" Или ТекКодЭтикетки = "0"  Тогда 
			
			Сообщить("Ошибка! Код этикетки в файле загрузки не заполнен для продукции " + Строка(СтрокаТабличнойЧасти.Номенклатура), СтатусСообщения.Важное);
			
		КонецЕсли;
		// + пока уберем 
		////Запись штрихкода
		//Если ЗначениеЗаполнено(Штрихкод) Тогда
		//	
		//	umk_Доработки.НовыйШтрихкод(СтрокаТабличнойЧасти, Штрихкод); 
		//	
		//КонецЕсли;
		//	
		//// запись в регистр сроки годности.
		//Если  ЗначениеЗаполнено(ТекСрокГодности) И ЗначениеЗаполнено(ТекЕдСрокаГодности) Тогда
		//	umk_Доработки.СоздатьЗаписьСрокГодности(СтрокаТабличнойЧасти ,ПараметрыСрокаГодности);
		//КонецЕсли;
        // - пока уберем
								
		Импортирована = Истина;
		
		Инд = Инд + 1;
		
	КонецЦикла;
	
	
КонецПроцедуры

#КонецОбласти
