Перем мВалютаРегламентированногоУчета Экспорт;

Перем мУдалятьДвижения;

// Производит заполнение документа по данным регистра ОжидаемыйИПодтвержденныйНДСПриобретений
//
Процедура ЗаполнитьПоОстаткам() Экспорт
    	
	Если ДоговорКонтрагента.СложныйНалоговыйУчет Тогда
		
		ЗаполнитьПоОстаткамСложныйНалоговыйУчет();
		
	Иначе
		
		ЗаполнитьПоОстаткамУпрощенныйНалоговыйУчет();
	
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьПоОстаткамУпрощенныйНалоговыйУчет()
	
	
	Запрос = Новый Запрос();
	
	Запрос.УстановитьПараметр("ДоговорКонтрагента", ДоговорКонтрагента);
	Запрос.УстановитьПараметр("Организация", 		Организация);
	Запрос.УстановитьПараметр("Сделка", 			ОпределитьСделкуЛокально());
	//Запрос.УстановитьПараметр("МоментВремени", 		?(ЭтоНовый(),'00010101',Новый Граница(МоментВремени(), ВидГраницы.Исключая)));
	Запрос.УстановитьПараметр("МоментВремени", 		Новый Граница(Дата, ВидГраницы.Включая));
	
	СобытияОжидаемыйИПодтвержденныйНДС 	= Новый СписокЗначений();
	
	Если ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РасчетКорректировкиВозврат Тогда
		
		СобытияОжидаемыйИПодтвержденныйНДС.Добавить(Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПриобретений.Возврат);
		Запрос.УстановитьПараметр("СобытияОжидаемыйИПодтвержденныйНДС", СобытияОжидаемыйИПодтвержденныйНДС);
		
	Иначе
		
		СобытияОжидаемыйИПодтвержденныйНДС.Добавить(Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПриобретений.Поступление);
		Запрос.УстановитьПараметр("СобытияОжидаемыйИПодтвержденныйНДС", СобытияОжидаемыйИПодтвержденныйНДС);
		
	КонецЕсли;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОжидаемыйИПодтвержденныйНДС.ВозвратнаяТара КАК ЗаТару,
	               |	ОжидаемыйИПодтвержденныйНДС.СтавкаНДС,
	               |	ОжидаемыйИПодтвержденныйНДС.ДляХозяйственнойДеятельности,
	               |	ОжидаемыйИПодтвержденныйНДС.ВидДеятельностиНДС,
				   |	ОжидаемыйИПодтвержденныйНДС.Амортизируется,
	               |	ОжидаемыйИПодтвержденныйНДС.БазаНДСОстаток,
				   |	ОжидаемыйИПодтвержденныйНДС.СуммаНДСПропорциональноОстаток,
				   |	ОжидаемыйИПодтвержденныйНДС.СуммаНДСОстаток
	               |ИЗ
	               |	РегистрНакопления.ОжидаемыйИПодтвержденныйНДСПриобретений.Остатки(
	               |		&МоментВремени,
	               |		Организация = &Организация
	               |		    И ДоговорКонтрагента = &ДоговорКонтрагента
	               |		    И Сделка = &Сделка
	               |		    И СобытиеНДС В (&СобытияОжидаемыйИПодтвержденныйНДС)) КАК ОжидаемыйИПодтвержденныйНДС";	
				   
	
	Знак = +1;
	Если ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РасчетКорректировкиВозврат Тогда
		Знак = -1;
	КонецЕсли;
				   
				   
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		
		Если  Выборка.БазаНДСОстаток <= 0 Тогда
		  Возврат
		КонецЕсли;
		
		Если Выборка.ЗаТару Тогда
				
			СуммаВозвратнойТары = СуммаВозвратнойТары + Знак*Выборка.БазаНДСОстаток;
				
		Иначе
				
			Строка = Товары.Добавить();
				
			Строка.СтавкаНДС 					= Выборка.СтавкаНДС;
			Строка.ДляХозяйственнойДеятельности = Выборка.ДляХозяйственнойДеятельности;
			Если НЕ Выборка.ВидДеятельностиНДС 	= Перечисления.ВидыДеятельностиНДС.Необлагаемая тогда
				Строка.ДляОперацийОблагаемыхНДС	= Истина;
			КонецЕсли;
			Строка.Амортизируется 				= Выборка.Амортизируется;
				
			Строка.Сумма 	= Знак*Выборка.БазаНДСОстаток; 
			
			Строка.СуммаНДС = Знак*Выборка.СуммаНДСОстаток;

			Если Выборка.ВидДеятельностиНДС = Перечисления.ВидыДеятельностиНДС.ПропорциональноОблагаемая Тогда
				
				Строка.ПропорциональныйНДС	= Истина;
				
				Если Выборка.СуммаНДСОстаток <> 0 
				   И Выборка.СуммаНДСПропорциональноОстаток <> 0 Тогда
					
					//	Здесь нужно разбить строку на две - одна по включаемому НДС в кредит, вторую на остаток (не вкл. в кредит)
					Строка2 = Товары.Добавить();
					ЗаполнитьЗначенияСвойств(Строка2, Строка);
					
					//Строка.ДляОперацийОблагаемыхНДС = Истина;
					Строка2.ДляОперацийОблагаемыхНДС  = Ложь;
					
					Строка.СуммаНДС  = Знак*Выборка.СуммаНДСПропорциональноОстаток;
					Строка2.СуммаНДС = Строка2.СуммаНДС - Строка.СуммаНДС;
					
					Если Строка.Сумма <> 0 Тогда
						Строка.Сумма  = Строка.Сумма *  (Выборка.СуммаНДСПропорциональноОстаток/Выборка.СуммаНДСОстаток);
					КонецЕсли;
					Строка2.Сумма = Строка2.Сумма - Строка.Сумма;
					
					Строка2.СуммаВзаиморасчетов = Строка2.Сумма + Строка2.СуммаНДС;

					Строка2.СтатьяДекларацииНДСНалоговыйКредит	= ОпределитьСтатьюНалоговойДекларации(Строка2);
					
				Иначе			
					
					Строка.ДляОперацийОблагаемыхНДС  = Ложь;
	
				КонецЕсли;
				
			КонецЕсли;
			
			Строка.СуммаВзаиморасчетов = Строка.Сумма + Строка.СуммаНДС;
			Строка.СтатьяДекларацииНДСНалоговыйКредит	= ОпределитьСтатьюНалоговойДекларации(Строка);
			
		КонецЕсли;					
		
	КонецЦикла;	
	
КонецПроцедуры

Процедура ЗаполнитьПоОстаткамСложныйНалоговыйУчет()
	
	
	Запрос = Новый Запрос();
	
	Запрос.УстановитьПараметр("ДоговорКонтрагента", ДоговорКонтрагента);
	Запрос.УстановитьПараметр("Организация", 		Организация);
	Запрос.УстановитьПараметр("Сделка", 			ОпределитьСделкуЛокально());
	//Запрос.УстановитьПараметр("МоментВремени", 		?(ЭтоНовый(),'00010101',Новый Граница(МоментВремени(), ВидГраницы.Исключая)));
	Запрос.УстановитьПараметр("МоментВремени", 		Новый Граница(Дата, ВидГраницы.Включая));

	СобытияПриобретенияНалоговыйУчет	= Новый СписокЗначений();
	СобытияОжидаемыйИПодтвержденныйНДС 	= Новый СписокЗначений();
	
	Если ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РасчетКорректировкиВозврат Тогда
		
		СобытияПриобретенияНалоговыйУчет = Новый СписокЗначений();
		СобытияПриобретенияНалоговыйУчет.Добавить(Перечисления.СобытияПриобретенияНалоговыйУчет.ВозвратПоставщику);
		СобытияПриобретенияНалоговыйУчет.Добавить(Перечисления.СобытияПриобретенияНалоговыйУчет.ВозвратОплатыПоставщиком);
		Запрос.УстановитьПараметр("СобытияПриобретенияНалоговыйУчет", СобытияПриобретенияНалоговыйУчет);
		Запрос.УстановитьПараметр("ПриобретенияНалоговыйУчетОплата", Перечисления.СобытияПриобретенияНалоговыйУчет.ВозвратОплатыПоставщиком);
		
		СобытияОжидаемыйИПодтвержденныйНДС.Добавить(Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПриобретений.Возврат);
		Запрос.УстановитьПараметр("СобытияОжидаемыйИПодтвержденныйНДС", СобытияОжидаемыйИПодтвержденныйНДС);
		
	Иначе
		
		СобытияПриобретенияНалоговыйУчет = Новый СписокЗначений();
		СобытияПриобретенияНалоговыйУчет.Добавить(Перечисления.СобытияПриобретенияНалоговыйУчет.ПоступлениеОтПоставщика);
		СобытияПриобретенияНалоговыйУчет.Добавить(Перечисления.СобытияПриобретенияНалоговыйУчет.ОплатаПоставщику);
		Запрос.УстановитьПараметр("СобытияПриобретенияНалоговыйУчет", СобытияПриобретенияНалоговыйУчет);
		Запрос.УстановитьПараметр("ПриобретенияНалоговыйУчетОплата", Перечисления.СобытияПриобретенияНалоговыйУчет.ОплатаПоставщику);
		
		СобытияОжидаемыйИПодтвержденныйНДС.Добавить(Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПриобретений.Поступление);
		Запрос.УстановитьПараметр("СобытияОжидаемыйИПодтвержденныйНДС", СобытияОжидаемыйИПодтвержденныйНДС);
		
	КонецЕсли;
	
	Запрос.Текст = "ВЫБРАТЬ
				   |	ВЫБОР КОГДА ОжидаемыйИПодтвержденныйНДС.ДоговорКонтрагента ЕСТЬ NULL ТОГДА 
				   |		ВЫБОР КОГДА ПриобретенияНалоговыйУчет.ВозвратнаяТара = Истина ТОГДА ПриобретенияНалоговыйУчет.ДоговорКонтрагента.СхемаНалоговогоУчетаПоТаре.МоментОпределенияБазыНДСПоПокупкам ИНАЧЕ ПриобретенияНалоговыйУчет.ДоговорКонтрагента.СхемаНалоговогоУчета.МоментОпределенияБазыНДСПоПокупкам КОНЕЦ 
			   	   |	  ИНАЧЕ
				   |		ВЫБОР КОГДА ОжидаемыйИПодтвержденныйНДС.ВозвратнаяТара = Истина ТОГДА ОжидаемыйИПодтвержденныйНДС.ДоговорКонтрагента.СхемаНалоговогоУчетаПоТаре.МоментОпределенияБазыНДСПоПокупкам ИНАЧЕ ОжидаемыйИПодтвержденныйНДС.ДоговорКонтрагента.СхемаНалоговогоУчета.МоментОпределенияБазыНДСПоПокупкам КОНЕЦ 
				   |	КОНЕЦ КАК Схема,
	               |	ВЫБОР КОГДА ОжидаемыйИПодтвержденныйНДС.ДоговорКонтрагента ЕСТЬ NULL ТОГДА 
				   |		ПриобретенияНалоговыйУчет.ВозвратнаяТара 
				   |	 ИНАЧЕ
				   |		ОжидаемыйИПодтвержденныйНДС.ВозвратнаяТара 
				   |	КОНЕЦ КАК ЗаТару,
				   |    ОжидаемыйИПодтвержденныйНДС.ДляХозяйственнойДеятельности 	КАК ДляХозяйственнойДеятельности,
				   |    ОжидаемыйИПодтвержденныйНДС.ВидДеятельностиНДС 				КАК ВидДеятельностиНДС,
				   |    ОжидаемыйИПодтвержденныйНДС.Амортизируется	 				КАК Амортизируется,
				   |	ОжидаемыйИПодтвержденныйНДС.СтавкаНДС 	  					КАК СтавкаНДС,
				   |	ВЫБОР КОГДА ОжидаемыйИПодтвержденныйНДС.БазаНДСОстаток ЕСТЬ NULL ТОГДА
				   |		0
				   |	 ИНАЧЕ
				   |		ВЫБОР КОГДА ОжидаемыйИПодтвержденныйНДС.БазаНДСОстаток < 0 ТОГДА
				   |			0
				   |		 ИНАЧЕ 
				   |			ОжидаемыйИПодтвержденныйНДС.БазаНДСОстаток
				   |		КОНЕЦ
				   |	КОНЕЦ КАК СуммаОтгрузки,
				   |	ВЫБОР КОГДА ОжидаемыйИПодтвержденныйНДС.СуммаНДСОстаток ЕСТЬ NULL ТОГДА
				   |		0
				   |	 ИНАЧЕ
				   |		ВЫБОР КОГДА ОжидаемыйИПодтвержденныйНДС.СуммаНДСОстаток < 0 ТОГДА
				   |			0
				   |		 ИНАЧЕ 
				   |			ОжидаемыйИПодтвержденныйНДС.СуммаНДСОстаток
				   |		КОНЕЦ
				   |	КОНЕЦ КАК СуммаНДСОтгрузки,
				   |	ВЫБОР КОГДА ОжидаемыйИПодтвержденныйНДС.СуммаНДСПропорциональноОстаток ЕСТЬ NULL ТОГДА
				   |		0
				   |	 ИНАЧЕ
				   |		ВЫБОР КОГДА ОжидаемыйИПодтвержденныйНДС.СуммаНДСПропорциональноОстаток < 0 ТОГДА
				   |			0
				   |		 ИНАЧЕ 
				   |			ОжидаемыйИПодтвержденныйНДС.СуммаНДСПропорциональноОстаток
				   |		КОНЕЦ
				   |	КОНЕЦ КАК СуммаНДСПропорциональноОстаток,
				   |	ПриобретенияНалоговыйУчет.Аванс КАК СуммаПревышенияОплатНадОтгрузкой
				   |ИЗ
	               |	РегистрНакопления.ОжидаемыйИПодтвержденныйНДСПриобретений.Остатки(&МоментВремени, Организация = &Организация И ДоговорКонтрагента = &ДоговорКонтрагента И Сделка = &Сделка И СобытиеНДС В (&СобытияОжидаемыйИПодтвержденныйНДС)) КАК ОжидаемыйИПодтвержденныйНДС
				   |    ПРАВОЕ СОЕДИНЕНИЕ
				   |        (ВЫБРАТЬ 
				   |            ПриобретенияНалоговыйУчет.ДоговорКонтрагента 	КАК ДоговорКонтрагента,
				   |            ПриобретенияНалоговыйУчет.ВозвратнаяТара		КАК ВозвратнаяТара,
				   |            СУММА(ВЫБОР КОГДА ПриобретенияНалоговыйУчет.Событие = &ПриобретенияНалоговыйУчетОплата ТОГДА ПриобретенияНалоговыйУчет.СуммаВзаиморасчетовОстаток ИНАЧЕ - ПриобретенияНалоговыйУчет.СуммаВзаиморасчетовОстаток КОНЕЦ) КАК Аванс
				   |
				   |         ИЗ РегистрНакопления.ПриобретенияНалоговыйУчет.Остатки(&МоментВремени, Организация = &Организация И ДоговорКонтрагента = &ДоговорКонтрагента И Сделка = &Сделка И Событие В (&СобытияПриобретенияНалоговыйУчет)) КАК ПриобретенияНалоговыйУчет
				   |
				   |		 СГРУППИРОВАТЬ ПО
				   |			ПриобретенияНалоговыйУчет.ДоговорКонтрагента,
				   |			ПриобретенияНалоговыйУчет.ВозвратнаяТара) КАК ПриобретенияНалоговыйУчет
				   |    ПО 
				   |       ОжидаемыйИПодтвержденныйНДС.ДоговорКонтрагента 	= ПриобретенияНалоговыйУчет.ДоговорКонтрагента
				   |     И ОжидаемыйИПодтвержденныйНДС.ВозвратнаяТара 		= ПриобретенияНалоговыйУчет.ВозвратнаяТара
				   |
				   |ИТОГИ
				   |	МАКСИМУМ(Схема),
				   |	МАКСИМУМ(СуммаПревышенияОплатНадОтгрузкой),
				   |	СУММА(СуммаОтгрузки),
				   |	СУММА(СуммаНДСПропорциональноОстаток),
				   |	СУММА(СуммаНДСОтгрузки)
				   |ПО
				   |	ЗаТару,
				   |    ДляХозяйственнойДеятельности,
				   |    ВидДеятельностиНДС,
				   |	Амортизируется
				   |";	
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл // ЗаТару
					
		СуммаНеПодтвержденнойОтгрузки    = ?(Выборка.СуммаОтгрузки = NULL, 0, Выборка.СуммаОтгрузки + Выборка.СуммаНДСОтгрузки);
		СуммаПревышенияОплатНадОтгрузкой = ?(Выборка.СуммаПревышенияОплатНадОтгрузкой = NULL, 0, Выборка.СуммаПревышенияОплатНадОтгрузкой);
					
		Если Выборка.Схема = Перечисления.МоментыОпределенияНалоговойБазы.НеОпределять Тогда
							
			// ничего не делаем
			Возврат;
							
		ИначеЕсли Выборка.Схема = Перечисления.МоментыОпределенияНалоговойБазы.ПоОплате Тогда
						
			Аванс = Макс(0, СуммаНеПодтвержденнойОтгрузки + СуммаПревышенияОплатНадОтгрузкой);
						
			Если Аванс > 0 Тогда
				ДобавитьСтрокуАванс(Выборка, Аванс);
			КонецЕсли;
							
		ИначеЕсли Выборка.Схема = Перечисления.МоментыОпределенияНалоговойБазы.ПоОтгрузке Тогда
							
			// Все неподтвержденные отгрузки 
			ДобавитьСтроку(Выборка);
							
		ИначеЕсли Выборка.Схема = Перечисления.МоментыОпределенияНалоговойБазы.ПоПервомуСобытию Тогда
						
			// Все неподтвержденные отгрузки
			ДобавитьСтроку(Выборка);	
						
			//Дополнительно добавим аванс
			Аванс = Макс(0, СуммаПревышенияОплатНадОтгрузкой);
						
			Если Аванс > 0 Тогда
				// дополнительно добавим аванс
				ДобавитьСтрокуАванс(Выборка, Аванс);
			КонецЕсли;
							
		Иначе
			
			Если Выборка.ЗаТару Тогда
				ТекстСообщения = НСтр("ru='Не указана схема налогового учета по таре, либо в схеме не указан Момент определения базы НДС по покупкам!';uk='Не зазначена схема податкового обліку по тарі, або в схемі не зазначений Момент визначення бази ПДВ по купівлях!'");
			Иначе	
				ТекстСообщения = НСтр("ru='Не указана схема налогового учета, либо в схеме не указан Момент определения базы НДС по покупкам!';uk='Не зазначена схема податкового обліку, або в схемі не зазначений Момент визначення бази ПДВ по купівлях!'");
			КонецЕсли;	
				
			Сообщить(ТекстСообщения, СтатусСообщения.Важное);

		КонецЕсли;					
		
	КонецЦикла;	
	
КонецПроцедуры

Процедура ДобавитьСтроку(Выборка)
	
	ВыборкаХозДеятельность = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаХозДеятельность.Следующий() Цикл
		
		ВыборкаВидДеятельностиНДС = ВыборкаХозДеятельность.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаВидДеятельностиНДС.Следующий() Цикл 
						
			ВыборкаАмортизируется = ВыборкаВидДеятельностиНДС.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаАмортизируется.Следующий() Цикл 
			
				ВыборкаСтавкаНДС = ВыборкаАмортизируется.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаСтавкаНДС.Следующий() Цикл 
					ДобавитьСтрокуОтгрузка(ВыборкаСтавкаНДС);	
				КонецЦикла;
				
			КонецЦикла;
				
		КонецЦикла;		
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьСтрокуОтгрузка(Выборка)		
	
	Если  Выборка.СуммаОтгрузки = NULL 
	  Или Выборка.СуммаОтгрузки + Выборка.СуммаНДСОтгрузки <= 0 Тогда
	  Возврат
	КонецЕсли;
	
	Знак = +1;
	Если ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РасчетКорректировкиВозврат Тогда
		Знак = -1;
	КонецЕсли;
	
	Если Выборка.ЗаТару Тогда
		
		СуммаВозвратнойТары = СуммаВозвратнойТары + Знак*Выборка.СуммаОтгрузки;
		
	Иначе
		
		Строка = Товары.Добавить();
		
		Строка.СтавкаНДС 					= Выборка.СтавкаНДС;
		Строка.ДляХозяйственнойДеятельности = Выборка.ДляХозяйственнойДеятельности;
		Если НЕ Выборка.ВидДеятельностиНДС 	= Перечисления.ВидыДеятельностиНДС.Необлагаемая тогда
			Строка.ДляОперацийОблагаемыхНДС	= Истина;
		КонецЕсли;
		
		Строка.Амортизируется 				= Выборка.Амортизируется;
		
		Строка.Сумма 	= Знак*Выборка.СуммаОтгрузки;
		Строка.СуммаНДС	= Знак*Выборка.СуммаНДСОтгрузки;

		Если Выборка.ВидДеятельностиНДС = Перечисления.ВидыДеятельностиНДС.ПропорциональноОблагаемая Тогда
			
			Строка.ПропорциональныйНДС	= Истина;
			
			Если  Выборка.СуммаНДСПропорциональноОстаток <> 0
				И Выборка.СуммаНДСОтгрузки <> 0 Тогда
				
				//	Здесь нужно разбить строку на две - одна по включаемому НДС в кредит, вторую на остаток (не вкл. в кредит)
				Строка2 = Товары.Добавить();
				ЗаполнитьЗначенияСвойств(Строка2, Строка);
				
				//Строка.ДляОперацийОблагаемыхНДС = Истина;
				Строка2.ДляОперацийОблагаемыхНДС  = Ложь;
				
				Строка.СуммаНДС  = Знак*Выборка.СуммаНДСПропорциональноОстаток;
				Строка2.СуммаНДС = Строка2.СуммаНДС - Строка.СуммаНДС;
				
				Если Строка.Сумма <> 0 Тогда
					Строка.Сумма  = Строка.Сумма *  (Выборка.СуммаНДСПропорциональноОстаток/Выборка.СуммаНДСОтгрузки);
				КонецЕсли;
				Строка2.Сумма = Строка2.Сумма - Строка.Сумма;
				
				Строка2.СуммаВзаиморасчетов = Строка2.Сумма + Строка2.СуммаНДС;

				Строка2.СтатьяДекларацииНДСНалоговыйКредит	= ОпределитьСтатьюНалоговойДекларации(Строка2);
				
			Иначе			
				
				Строка.ДляОперацийОблагаемыхНДС  = Ложь;

			КонецЕсли;
			
		КонецЕсли;
		
		Строка.СуммаВзаиморасчетов = Строка.Сумма + Строка.СуммаНДС;
		Строка.СтатьяДекларацииНДСНалоговыйКредит	= ОпределитьСтатьюНалоговойДекларации(Строка);
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьСтрокуАванс(Выборка, Аванс) 
	
	Знак = +1;
	Если ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РасчетКорректировкиВозврат Тогда
		Знак = -1;
	КонецЕсли;

	Если Выборка.ЗаТару Тогда
		
		СуммаВозвратнойТары = СуммаВозвратнойТары + Знак * Выборка.СуммаОтгрузки;
		
	Иначе
		
		Строка = Товары.Добавить();
		Строка.СуммаВзаиморасчетов = Знак * Аванс;

	КонецЕсли;
	
КонецПроцедуры

// Производит заполнение документа по движениям документа-основания по регистру ОжидаемыйИПодтвержденныйНДСПриобретений
//
Процедура ЗаполнитьПоДокументуОснованию() Экспорт
	
	// платежные документы
	ВалютаОснования = ДокументОснование.ВалютаДокумента; 
	Данные = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаОснования, ДокументОснование.Дата);
	
	Если    ДокументОснование = Неопределено 
		ИЛИ ДокументОснование.Пустая() Тогда
	
		// нет данных для заполнения
		Возврат;	
	
	КонецЕсли;
	
	ОснованиеАвансовыйОтчет    = (ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.АвансовыйОтчет"));
	ОснованиеСчет		       = (ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.СчетНаОплатуПоставщика"));
	ОснованиеПлатежныйДокумент = ОбщегоНазначения.ЕстьТабЧастьДокумента("РасшифровкаПлатежа", ДокументОснование.Метаданные());
	
	СложныйНалоговыйУчет = ДоговорКонтрагента.СложныйНалоговыйУчет;
	
	Если    (ОснованиеПлатежныйДокумент И СложныйНалоговыйУчет)
		ИЛИ ОснованиеАвансовыйОтчет Тогда
				
		ПогрешностиОкругления = Новый Соответствие();
		
		Если ОснованиеАвансовыйОтчет Тогда
		    ТабЧасть = ДокументОснование.ОплатаПоставщикам;
			ИмяРеквизитаСуммы = "Сумма";
		Иначе	
		 	ТабЧасть = ДокументОснование.РасшифровкаПлатежа;
			ИмяРеквизитаСуммы = "СуммаПлатежа";
		КонецЕсли;
		
		Для каждого СтрокаОснования Из ТабЧасть Цикл
			
			Если НЕ СтрокаОснования.ДоговорКонтрагента = ДоговорКонтрагента Тогда
			
				Продолжить;	
			
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Сделка) И НЕ (СтрокаОснования.Сделка = Сделка или Сделка = ДокументОснование) Тогда
			
				Продолжить;	
			
			КонецЕсли;
			
			Если СтрокаОснования.ЗаТару Тогда
				
				СуммаВозвратнойТары = СуммаВозвратнойТары + 
									  МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаОснования[ИмяРеквизитаСуммы],
									  							 ВалютаОснования, мВалютаРегламентированногоУчета,
																 Данные.Курс, 1,
																 Данные.Кратность, 1,
																 ,ПогрешностиОкругления, "СуммаТара");
				
			Иначе	
				
				СтрокаТЧ = Товары.Добавить();
				СтрокаТЧ.СтавкаНДС 	= СтрокаОснования.СтавкаНДС;
				СтрокаТЧ.СуммаНДС  	= МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаОснования.СуммаНДС,
									  							 ВалютаОснования, мВалютаРегламентированногоУчета,
																 Данные.Курс, 1,
																 Данные.Кратность, 1,
																 ,ПогрешностиОкругления, "СуммаНДС");
																 
																 
				СтрокаТЧ.СуммаВзаиморасчетов = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаОснования[ИмяРеквизитаСуммы],
									  							 ВалютаОснования, мВалютаРегламентированногоУчета,
																 Данные.Курс, 1,
																 Данные.Кратность, 1,
																 ,ПогрешностиОкругления, "Сумма");

				СтрокаТЧ.Сумма 		= СтрокаТЧ.СуммаВзаиморасчетов - СтрокаТЧ.СуммаНДС;
									 
				Если ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РасчетКорректировкиВозврат Тогда
				
					СтрокаТЧ.Сумма 	  = - СтрокаТЧ.Сумма;
					СтрокаТЧ.СуммаНДС = - СтрокаТЧ.СуммаНДС;
					СтрокаТЧ.СуммаВзаиморасчетов = -СтрокаТЧ.СуммаВзаиморасчетов;
					
				КонецЕсли;
				
				СтрокаТЧ.СтатьяДекларацииНДСНалоговыйКредит = ОпределитьСтатьюНалоговойДекларации(СтрокаТЧ);
			
			КонецЕсли; 
			
		КонецЦикла; 	
		
	КонецЕсли;
	
	Если ОснованиеСчет Тогда
		
		Запрос = Новый Запрос;
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	СчетНаОплатуПоставщикаТовары.СтавкаНДС КАК СтавкаНДС,
		               |	СчетНаОплатуПоставщикаТовары.СуммаНДС КАК СуммаНДС,
		               |	СчетНаОплатуПоставщикаТовары.Сумма КАК Сумма,
		               |	0 КАК СуммаТара
		               |ИЗ
		               |	Документ.СчетНаОплатуПоставщика.Товары КАК СчетНаОплатуПоставщикаТовары
		               |ГДЕ
		               |	СчетНаОплатуПоставщикаТовары.Ссылка = &Счет
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	СчетНаОплатуПоставщикаУслуги.СтавкаНДС,
		               |	СчетНаОплатуПоставщикаУслуги.СуммаНДС,
		               |	СчетНаОплатуПоставщикаУслуги.Сумма,
		               |	0
		               |ИЗ
		               |	Документ.СчетНаОплатуПоставщика.Услуги КАК СчетНаОплатуПоставщикаУслуги
		               |ГДЕ
		               |	СчетНаОплатуПоставщикаУслуги.Ссылка = &Счет
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	СчетНаОплатуПоставщикаОборудование.СтавкаНДС,
		               |	СчетНаОплатуПоставщикаОборудование.СуммаНДС,
		               |	СчетНаОплатуПоставщикаОборудование.Сумма,
		               |	0
		               |ИЗ
		               |	Документ.СчетНаОплатуПоставщика.Оборудование КАК СчетНаОплатуПоставщикаОборудование
		               |ГДЕ
		               |	СчетНаОплатуПоставщикаОборудование.Ссылка = &Счет
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	СчетНаОплатуПоставщикаОбъектыСтроительства.СтавкаНДС,
		               |	СчетНаОплатуПоставщикаОбъектыСтроительства.СуммаНДС,
		               |	СчетНаОплатуПоставщикаОбъектыСтроительства.Сумма,
		               |	0
		               |ИЗ
		               |	Документ.СчетНаОплатуПоставщика.ОбъектыСтроительства КАК СчетНаОплатуПоставщикаОбъектыСтроительства
		               |ГДЕ
		               |	СчетНаОплатуПоставщикаОбъектыСтроительства.Ссылка = &Счет
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	0,
		               |	0,
		               |	0,
		               |	СчетНаОплатуПоставщикаВозвратнаяТара.Сумма
		               |ИЗ
		               |	Документ.СчетНаОплатуПоставщика.ВозвратнаяТара КАК СчетНаОплатуПоставщикаВозвратнаяТара
		               |ГДЕ
		               |	СчетНаОплатуПоставщикаВозвратнаяТара.Ссылка = &Счет
		               |ИТОГИ
		               |	СУММА(СуммаНДС),
		               |	СУММА(Сумма),
		               |	СУММА(СуммаТара)
		               |ПО
		               |	СтавкаНДС";
					   
		Запрос.УстановитьПараметр("Счет", ДокументОснование);
		
		Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		ВалютаОснования = ДокументОснование.ВалютаДокумента; 
		Данные = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаОснования, ДокументОснование.Дата);
		
		ОснованиеУчитыватьНДС 		= ДокументОснование.УчитыватьНДС;
		ОснованиеСуммаВключаетНДС 	= ДокументОснование.СуммаВключаетНДС;
		
		ПогрешностиОкругления = Новый Соответствие();
		
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.СуммаТара > 0 Тогда
				
				СуммаВозвратнойТары = СуммаВозвратнойТары + 
									  МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Выборка.СуммаТара,
									  							 ВалютаОснования, мВалютаРегламентированногоУчета,
																 Данные.Курс, 1,
																 Данные.Кратность, 1,
																 ,ПогрешностиОкругления, "СуммаТара");
				
			Иначе	
				
				СтрокаТЧ = Товары.Добавить();
				СтрокаТЧ.СтавкаНДС 	= Выборка.СтавкаНДС;
				СтрокаТЧ.СуммаНДС  	= МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Выборка.СуммаНДС,
									  							 ВалютаОснования, мВалютаРегламентированногоУчета,
																 Данные.Курс, 1,
																 Данные.Кратность, 1,
																 ,ПогрешностиОкругления, "СуммаНДС");
																 
																 
				ВремСумма = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Выборка.Сумма,
									  							 ВалютаОснования, мВалютаРегламентированногоУчета,
																 Данные.Курс, 1,
																 Данные.Кратность, 1,
																 ,ПогрешностиОкругления, "Сумма");
																 
				Если ОснованиеУчитыватьНДС И НЕ ОснованиеСуммаВключаетНДС Тогда
					СтрокаТЧ.СуммаВзаиморасчетов = ВремСумма + СтрокаТЧ.СуммаНДС;
				Иначе													 
					СтрокаТЧ.СуммаВзаиморасчетов = ВремСумма;
				КонецЕсли;
				
				СтрокаТЧ.Сумма 		= СтрокаТЧ.СуммаВзаиморасчетов - СтрокаТЧ.СуммаНДС;
									 
				Если ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РасчетКорректировкиВозврат Тогда
				
					СтрокаТЧ.Сумма 	  = - СтрокаТЧ.Сумма;
					СтрокаТЧ.СуммаНДС = - СтрокаТЧ.СуммаНДС;
					СтрокаТЧ.СуммаВзаиморасчетов = -СтрокаТЧ.СуммаВзаиморасчетов;
					
				КонецЕсли;
				
				СтрокаТЧ.СтатьяДекларацииНДСНалоговыйКредит = ОпределитьСтатьюНалоговойДекларации(СтрокаТЧ);
			
			КонецЕсли; 
			
		КонецЦикла;		
					   
	ИначеЕсли НЕ ОснованиеПлатежныйДокумент
          ИЛИ НЕ СложныйНалоговыйУчет Тогда
		
		Запрос = Новый Запрос;
		
		Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
		Запрос.УстановитьПараметр("ДоговорКонтрагента", ДоговорКонтрагента);
		Запрос.УстановитьПараметр("Сделка", 			ОпределитьСделкуЛокально());
		Запрос.УстановитьПараметр("Курс", 				Данные.Курс/Данные.Кратность);
		
		Если ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РасчетКорректировкиВозврат Тогда
			Запрос.УстановитьПараметр("ЗнакСуммы", -1);
		Иначе
			Запрос.УстановитьПараметр("ЗнакСуммы",  1);
		КонецЕсли;
		
		Запрос.УстановитьПараметр("ОблагаемыйВидДеятельностиНДС", Перечисления.ВидыДеятельностиНДС.Облагаемая);
		
		Запрос.Текст =
		"ВЫБРАТЬ Разрешенные
		|	ОжидаемыйИПодтвержденныйНДСПриобретений.СтавкаНДС,
		|	ОжидаемыйИПодтвержденныйНДСПриобретений.ДляХозяйственнойДеятельности,
		|	ВЫБОР
		|		КОГДА ОжидаемыйИПодтвержденныйНДСПриобретений.ВидДеятельностиНДС = &ОблагаемыйВидДеятельностиНДС
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ДляОперацийОблагаемыхНДС,
		|  ОжидаемыйИПодтвержденныйНДСПриобретений.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
		|	Амортизируется КАК Амортизируется,
		|	ОжидаемыйИПодтвержденныйНДСПриобретений.ВозвратнаяТара,
		|	&ЗнакСуммы * &Курс * ОжидаемыйИПодтвержденныйНДСПриобретений.СуммаНДС КАК СуммаНДС,
		|	&ЗнакСуммы * &Курс * ОжидаемыйИПодтвержденныйНДСПриобретений.СуммаНДСПропорционально КАК СуммаНДСПропорционально,
		|	&ЗнакСуммы * &Курс * ОжидаемыйИПодтвержденныйНДСПриобретений.БазаНДС КАК Сумма
		|ИЗ
		|	РегистрНакопления.ОжидаемыйИПодтвержденныйНДСПриобретений КАК ОжидаемыйИПодтвержденныйНДСПриобретений
		|ГДЕ
		|	  ОжидаемыйИПодтвержденныйНДСПриобретений.Регистратор 		 = &ДокументОснование
		|	И ОжидаемыйИПодтвержденныйНДСПриобретений.ДоговорКонтрагента = &ДоговорКонтрагента
		|	И ОжидаемыйИПодтвержденныйНДСПриобретений.Сделка 			 = &Сделка
		|";
		
		// сохраним имеющиеся строки в табличной части
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
		
			Если Выборка.ВозвратнаяТара = Истина Тогда
				
				СуммаВозвратнойТары = СуммаВозвратнойТары + Выборка.Сумма;
				
			Иначе
				
				СтрокаТоваров = Товары.Добавить();
				СтрокаТоваров.СтавкаНДС 					= Выборка.СтавкаНДС;
				СтрокаТоваров.ДляХозяйственнойДеятельности 	= Выборка.ДляХозяйственнойДеятельности;
				СтрокаТоваров.ДляОперацийОблагаемыхНДС 		= Выборка.ДляОперацийОблагаемыхНДС;
				СтрокаТоваров.Амортизируется 				= Выборка.Амортизируется;
				СтрокаТоваров.СуммаНДС 						= Выборка.СуммаНДС;
				СтрокаТоваров.Сумма 						= Выборка.Сумма;
				
				Если Выборка.ВидДеятельностиНДС = Перечисления.ВидыДеятельностиНДС.ПропорциональноОблагаемая Тогда
					
					СтрокаТоваров.ПропорциональныйНДС	= Истина;
					
					Если  Выборка.СуммаНДСПропорционально <> 0
						И Выборка.СуммаНДС <> 0 Тогда
						
						//	Здесь нужно разбить строку на две - одна по включаемому НДС в кредит, вторую на остаток (не вкл. в кредит)
						Строка2 = Товары.Добавить();
						ЗаполнитьЗначенияСвойств(Строка2, СтрокаТоваров);
						
						СтрокаТоваров.ДляОперацийОблагаемыхНДС = Истина;
						Строка2.ДляОперацийОблагаемыхНДС       = Ложь;
						
						СтрокаТоваров.СуммаНДС  = Выборка.СуммаНДСПропорционально;
						Строка2.СуммаНДС = Строка2.СуммаНДС - СтрокаТоваров.СуммаНДС;
						
						Если СтрокаТоваров.Сумма <> 0 Тогда
							СтрокаТоваров.Сумма  = СтрокаТоваров.Сумма *  (Выборка.СуммаНДСПропорционально/Выборка.СуммаНДС);
						КонецЕсли;
						Строка2.Сумма = Строка2.Сумма - СтрокаТоваров.Сумма;
						
						Строка2.СуммаВзаиморасчетов = Строка2.Сумма + Строка2.СуммаНДС;

						Строка2.СтатьяДекларацииНДСНалоговыйКредит	= ОпределитьСтатьюНалоговойДекларации(Строка2);
						
					Иначе			
						
						СтрокаТоваров.ДляОперацийОблагаемыхНДС  = Ложь;

					КонецЕсли;
					
				КонецЕсли;
				
				СтрокаТоваров.СуммаВзаиморасчетов					= СтрокаТоваров.Сумма + СтрокаТоваров.СуммаНДС;
				СтрокаТоваров.СтатьяДекларацииНДСНалоговыйКредит	= ОпределитьСтатьюНалоговойДекларации(СтрокаТоваров);
				
			КонецЕсли; 
		
		КонецЦикла; 
		
	КонецЕсли; 		
	
КонецПроцедуры

// Производит заполнение документа по данным регистра ОжидаемыйИПодтвержденныйНДСПриобретений
// с учетом движений документа-основания по тому же регистру, либо (для платежных документов)
// данных расшифровки платежа.
//
Процедура ЗаполнитьПоДокументуОснованиюСУчетомОстатков() Экспорт

	ОснованиеПлатежныйДокумент = (ОбщегоНазначения.ЕстьТабЧастьДокумента("РасшифровкаПлатежа", ДокументОснование.Метаданные()));
	ОснованиеСчет		       = (ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.СчетНаОплатуПоставщика"));	
	
	// Сохраним данные табличной части
	ТоварыДоЗаполнения		= Товары.Выгрузить();
	СуммаТарыДоЗаполнения 	= СуммаВозвратнойТары;
	
	Товары.Очистить();
	СуммаВозвратнойТары = 0;
	
	//Получим данные по документу
	ЗаполнитьПоДокументуОснованию();
	ТоварыПоДокументу 		= Товары.Выгрузить();
	СуммаТарыПоДокументу 	= СуммаВозвратнойТары;
	
	Товары.Очистить();
	СуммаВозвратнойТары = 0;
	
	//Получим остатки по договору
	ЗаполнитьПоОстаткам();
	ТоварыОстатки	 = Товары.Выгрузить();
	СуммаТарыОстатки = СуммаВозвратнойТары;
	
	Товары.Очистить();
	СуммаВозвратнойТары = 0;
	
	// ТОВАРЫ
	// сначала восстановим данные до заполнения.
	Товары.Загрузить(ТоварыДоЗаполнения);
	
	
	// свернем таблицы по ключевым измерениям                                                                  
	ТоварыПоДокументу.Свернуть("СтавкаНДС,ДляХозяйственнойДеятельности,ДляОперацийОблагаемыхНДС,Амортизируется,ПропорциональныйНДС", "Сумма, СуммаНДС");	
	ТоварыОстатки.Свернуть("СтавкаНДС,ДляХозяйственнойДеятельности,ДляОперацийОблагаемыхНДС,Амортизируется,ПропорциональныйНДС", "Сумма, СуммаНДС,СуммаВзаиморасчетов");	

	Для каждого СтрокаДокумент Из ТоварыПоДокументу Цикл
		//Если ОснованиеПлатежныйДокумент ИЛИ ОснованиеСчет Тогда
		Если     ОснованиеСчет
			ИЛИ (ОснованиеПлатежныйДокумент И ДоговорКонтрагента.СложныйНалоговыйУчет) Тогда
			СтрокаОстатков = ТоварыОстатки.НайтиСтроки(Новый Структура("СтавкаНДС",  СтрокаДокумент.СтавкаНДС));
		Иначе
			СтрокаОстатков = ТоварыОстатки.НайтиСтроки(Новый Структура("СтавкаНДС,
																		|ДляХозяйственнойДеятельности,
																		|ДляОперацийОблагаемыхНДС,
																		|Амортизируется
																		|,ПропорциональныйНДС", 
																		СтрокаДокумент.СтавкаНДС,
																		СтрокаДокумент.ДляХозяйственнойДеятельности,
																		СтрокаДокумент.ДляОперацийОблагаемыхНДС,
																		СтрокаДокумент.Амортизируется
																		,СтрокаДокумент.ПропорциональныйНДС));
		КонецЕсли; 
		
		Если СтрокаОстатков.Количество()>0 Тогда
			
			СтрокаОстатков = СтрокаОстатков[0];
			
			СтрокаТЧ = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрокаОстатков);
			
			Если СтрокаДокумент.СуммаНДС < 0 Тогда
				//возврат
				СтрокаТЧ.СуммаНДС = Макс(СтрокаОстатков.СуммаНДС, СтрокаДокумент.СуммаНДС);
				СтрокаТЧ.Сумма 	  = Макс(СтрокаОстатков.Сумма, 	 СтрокаДокумент.Сумма);
			Иначе	
				СтрокаТЧ.СуммаНДС = МИН(СтрокаОстатков.СуммаНДС, СтрокаДокумент.СуммаНДС);
				СтрокаТЧ.Сумма 	  = МИН(СтрокаОстатков.Сумма, 	 СтрокаДокумент.Сумма);
			КонецЕсли;
			СтрокаТЧ.СуммаВзаиморасчетов = СтрокаТЧ.Сумма + СтрокаТЧ.СуммаНДС;
			
			СтрокаТЧ.СтатьяДекларацииНДСНалоговыйКредит = ОпределитьСтатьюНалоговойДекларации(СтрокаТЧ);
			
			// уменьшим суммы для дальнешего учета аванса
			СтрокаДокумент.Сумма 	= СтрокаДокумент.Сумма - СтрокаТЧ.Сумма; 
			СтрокаДокумент.СуммаНДС = СтрокаДокумент.СуммаНДС - СтрокаТЧ.СуммаНДС; 
			
		КонецЕсли;
	
	КонецЦикла;
	
	// оставим строки из данных документа, которые могут быть добавлены учитывая аванс
	ПустыеСтроки = ТоварыПоДокументу.НайтиСтроки(Новый Структура("Сумма",0));
	Для каждого ПустяСтрока ИЗ ПустыеСтроки  Цикл
		ТоварыПоДокументу.Удалить(ПустяСтрока);	
	КонецЦикла;
	
	СуммаПоДокументу = ТоварыПоДокументу.Итог("Сумма") + ТоварыПоДокументу.Итог("СуммаНДС");
	
	//Перенесем данные из документа учитывая остатки
	// получим сумму аванса, которую можно закрыть любыми ставками по данным отргузки.
	СуммаАванса = ТоварыОстатки.НайтиСтроки(Новый Структура("СтавкаНДС", Перечисления.СтавкиНДС.ПустаяСсылка()));
	Если СуммаАванса.Количество() = 0 Тогда
		СуммаАванса = 0;	
	Иначе
		СуммаАванса = СуммаАванса[0].СуммаВзаиморасчетов;
	КонецЕсли;
	
	Если СуммаПоДокументу >= 0 Тогда
		СуммаКРаспределению = Мин(СуммаАванса, СуммаПоДокументу);
	Иначе
		СуммаКРаспределению = Макс(СуммаАванса, СуммаПоДокументу);		
	КонецЕсли;
	
	Если СуммаКРаспределению <> 0 И СуммаАванса <> 0 И СуммаПоДокументу <> 0 Тогда
	
		Коэфф = СуммаКРаспределению / СуммаПоДокументу;
		
		Погрешность = 0;
		
		Для каждого СтрокаДокумент Из ТоварыПоДокументу Цикл
		
			СтрокаТЧ = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрокаДокумент);
			
			СтрокаТЧ.Сумма 	  = ОбщегоНазначения.ОкруглитьСУчетомПогрешности(Коэфф*СтрокаТЧ.Сумма, 2, Погрешность);
			СтрокаТЧ.СуммаНДС = ОбщегоНазначения.ОкруглитьСУчетомПогрешности(Коэфф*СтрокаТЧ.СуммаНДС, 2, Погрешность);
			СтрокаТЧ.СуммаВзаиморасчетов = СтрокаТЧ.Сумма + СтрокаТЧ.СуммаНДС; 

			СтрокаТЧ.СтатьяДекларацииНДСНалоговыйКредит = ОпределитьСтатьюНалоговойДекларации(СтрокаТЧ);
		
		КонецЦикла; 
		
	КонецЕсли;
	
	// ВОЗВРАТНАЯ ТАРА
	СуммаВозвратнойТары = СуммаТарыДоЗаполнения + ?(СуммаТарыПоДокументу > 0, Мин(СуммаТарыПоДокументу, СуммаТарыОстатки), Макс(СуммаТарыПоДокументу, СуммаТарыОстатки));

КонецПроцедуры
 
// Производит заполнение табличной части документа по услугам, полученным от нерезидента(на территории Украины)
//
Процедура ЗаполнитьПоРаботамОтНерезидента() Экспорт

	
	ПогрешностиОкругления = Новый Соответствие;
	ВидДокументаОснования = ДокументОснование.Метаданные().Имя;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	Запрос.УстановитьПараметр("ОблагаемыйВидДеятельностиНДС", Перечисления.ВидыДеятельностиНДС.Облагаемая);
	Запрос.УстановитьПараметр("НеоблагаемыйВидНалоговойДеятельности",  Справочники.ВидыНалоговойДеятельности.НеОблагаемая);
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Основание.Номенклатура,
	|	Основание.Номенклатура.СтавкаНДС КАК СтавкаНДС,
	|	Основание.Количество,
	|	Основание.Сумма,
	|	Основание.Содержание,                                
	|	ВЫБОР
	|		КОГДА Основание.НалоговоеНазначение.ВидДеятельностиНДС = &ОблагаемыйВидДеятельностиНДС
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ДляОперацийОблагаемыхНДС,
	|	ВЫБОР
	|		КОГДА Основание.НалоговоеНазначение.ВидНалоговойДеятельности = &НеоблагаемыйВидНалоговойДеятельности
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА 
	|	КОНЕЦ КАК ДляХозяйственнойДеятельности,
	|	Основание.НалоговоеНазначение.Амортизируется КАК Амортизируется,
	|	Основание.Ссылка.ВалютаДокумента КАК ВалютаДокумента,
	|	ВЫБОР КОГДА Основание.Ссылка.ВалютаДокумента = Основание.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов ТОГДА
	|		Основание.Ссылка.КурсВзаиморасчетов
	|	ИНАЧЕ
	|		1
	|	КОНЕЦ                                           КАК КурсДокумента,
	|	ВЫБОР КОГДА Основание.Ссылка.ВалютаДокумента = Основание.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов ТОГДА
	|		Основание.Ссылка.КратностьВзаиморасчетов
	|	ИНАЧЕ
	|		1
	|	КОНЕЦ                                           КАК КратностьДокумента
	|ИЗ
	|	Документ."+ВидДокументаОснования+".Услуги КАК Основание
	|
	|ГДЕ
	|	Основание.Ссылка = &ДокументОснование";
	
	Запрос.Текст = ТекстЗапроса;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = Товары.Добавить();
		НоваяСтрока.НаименованиеТовара         = Выборка.Содержание;
		НоваяСтрока.Количество                 = Выборка.Количество;
		
		НоваяСтрока.СтавкаНДС = Выборка.СтавкаНДС;

		// расчет сумм будем вести по алгоритму расчета гривневых сумм из налоговой накладной - для борьбы с ошибками округления.
		// при поступлении НДС указываться не должен. В любом случае налог насчитывается сверху на сумму услуг. 
		СуммаСНДСВал  = Ценообразование.ПересчитатьЦенуПриИзмененииФлаговНалогов(Выборка.Сумма,Перечисления.СпособыЗаполненияЦен.ПоЦенамНоменклатуры,Ложь,Истина,Истина,УчетНДС.ПолучитьСтавкуНДС(НоваяСтрока.СтавкаНДС));
		СуммаСНДСВал  = Окр(СуммаСНДСВал,2);
		СуммаСНДСРегл = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СуммаСНДСВал, Выборка.ВалютаДокумента, мВалютаРегламентированногоУчета,
												   Выборка.КурсДокумента, 1,
										   		   Выборка.КратностьДокумента, 1,
												   , ПогрешностиОкругления, "СуммаСНДСРегл");
		НоваяСтрока.СуммаВзаиморасчетов = СуммаСНДСРегл;										   
		НоваяСтрока.СуммаНДС = Ценообразование.РассчитатьСуммуНДСсУчетомПогрешности(СуммаСНДСРегл, Истина, Истина, НоваяСтрока.СтавкаНДС, ПогрешностиОкругления);
		НоваяСтрока.Сумма = НоваяСтрока.СуммаВзаиморасчетов - НоваяСтрока.СуммаНДС; 
				
		НоваяСтрока.Цена = 	НоваяСтрока.Сумма / ?(НоваяСтрока.Количество = 0, 1, НоваяСтрока.Количество);
																			
		СчетаУчета = БухгалтерскийУчет.ПолучитьСчетаУчетаНоменклатуры(Организация, Выборка.Номенклатура);
		
		НоваяСтрока.ДляХозяйственнойДеятельности    = Выборка.ДляХозяйственнойДеятельности;
		НоваяСтрока.ДляОперацийОблагаемыхНДС    	= Выборка.ДляОперацийОблагаемыхНДС;
		НоваяСтрока.Амортизируется    				= Выборка.Амортизируется;
        НоваяСтрока.СтатьяДекларацииНДСНалоговыйКредит = ОпределитьСтатьюНалоговойДекларации(НоваяСтрока);
		
	КонецЦикла;	

КонецПроцедуры

// Производит заполнение табличной части документа по услугам комиссии, оказанным нерезидентом
// (считаются полученными на территории Украины)
//
Процедура ЗаполнитьПоУслугамКомиссииОтНерезидента() Экспорт

	ПогрешностиОкругления = Новый Соответствие;
	ВидДокументаОснования = ДокументОснование.Метаданные().Имя;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	Запрос.УстановитьПараметр("ОблагаемыйВидДеятельностиНДС", Перечисления.ВидыДеятельностиНДС.Облагаемая);
	Запрос.УстановитьПараметр("НеоблагаемыйВидНалоговойДеятельности",  Справочники.ВидыНалоговойДеятельности.НеОблагаемая);
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Основание.Номенклатура,
	|	""Продажа "" + ВЫРАЗИТЬ(Основание.Номенклатура.Наименование КАК СТРОКА(100)) КАК Содержание,
	|	1 КАК Количество,
	|	Основание.СуммаВознаграждения КАК Сумма,
	|	ВЫБОР
	|		КОГДА Основание.Ссылка.НалоговоеНазначение.ВидДеятельностиНДС = &ОблагаемыйВидДеятельностиНДС
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ДляОперацийОблагаемыхНДС,
	|	ВЫБОР
	|		КОГДА Основание.Ссылка.НалоговоеНазначение.ВидНалоговойДеятельности = &НеоблагаемыйВидНалоговойДеятельности
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА 
	|	КОНЕЦ КАК ДляХозяйственнойДеятельности,
	|	Основание.Ссылка.НалоговоеНазначение.Амортизируется КАК Амортизируется,
	|	Основание.Ссылка.ВалютаДокумента КАК ВалютаДокумента,
	|	ВЫБОР КОГДА Основание.Ссылка.ВалютаДокумента = Основание.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов ТОГДА
	|		Основание.Ссылка.КурсВзаиморасчетов
	|	ИНАЧЕ
	|		1
	|	КОНЕЦ                                           КАК КурсДокумента,
	|	ВЫБОР КОГДА Основание.Ссылка.ВалютаДокумента = Основание.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов ТОГДА
	|		Основание.Ссылка.КратностьВзаиморасчетов
	|	ИНАЧЕ
	|		1
	|	КОНЕЦ                                           КАК КратностьДокумента
	|ИЗ
	|	Документ."+ВидДокументаОснования+".Товары КАК Основание
	|
	|ГДЕ
	|	Основание.Ссылка = &ДокументОснование";
	
	Запрос.Текст = ТекстЗапроса;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = Товары.Добавить();
		НоваяСтрока.НаименованиеТовара         = Выборка.Содержание;
		НоваяСтрока.Количество                 = Выборка.Количество;
		
		НоваяСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС20;

		// расчет сумм будем вести по алгоритму расчета гривневых сумм из налоговой накладной - для борьбы с ошибками округления.
		// при поступлении НДС указываться не должен. В любом случае налог насчитывается сверху на сумму услуг. 
		СуммаСНДСВал  = Ценообразование.ПересчитатьЦенуПриИзмененииФлаговНалогов(Выборка.Сумма,Перечисления.СпособыЗаполненияЦен.ПоЦенамНоменклатуры,Ложь,Истина,Истина,УчетНДС.ПолучитьСтавкуНДС(НоваяСтрока.СтавкаНДС));
		СуммаСНДСВал  = Окр(СуммаСНДСВал,2);
		СуммаСНДСРегл = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СуммаСНДСВал, Выборка.ВалютаДокумента, мВалютаРегламентированногоУчета,
												   Выборка.КурсДокумента, 1,
										   		   Выборка.КратностьДокумента, 1,
												   , ПогрешностиОкругления, "СуммаСНДСРегл");
		НоваяСтрока.СуммаВзаиморасчетов = СуммаСНДСРегл; 										   
		НоваяСтрока.СуммаНДС = Ценообразование.РассчитатьСуммуНДСсУчетомПогрешности(СуммаСНДСРегл, Истина, Истина, НоваяСтрока.СтавкаНДС, ПогрешностиОкругления);
		НоваяСтрока.Сумма = НоваяСтрока.СуммаВзаиморасчетов - НоваяСтрока.СуммаНДС; 
				
		НоваяСтрока.Цена = 	НоваяСтрока.Сумма / ?(НоваяСтрока.Количество = 0, 1, НоваяСтрока.Количество);
																			
		СчетаУчета = БухгалтерскийУчет.ПолучитьСчетаУчетаНоменклатуры(Организация, Выборка.Номенклатура);
		
		НоваяСтрока.ДляХозяйственнойДеятельности    = Выборка.ДляХозяйственнойДеятельности;
		НоваяСтрока.ДляОперацийОблагаемыхНДС    	= Выборка.ДляОперацийОблагаемыхНДС;
		НоваяСтрока.Амортизируется			    	= Выборка.Амортизируется;
        НоваяСтрока.СтатьяДекларацииНДСНалоговыйКредит = ОпределитьСтатьюНалоговойДекларации(НоваяСтрока);
		
	КонецЦикла;	

КонецПроцедуры

Процедура ЗаполнитьПоКомиссионнойТорговлеНалоговыйКодекс() Экспорт
	
	ВалютаОснования = ДокументОснование.ВалютаДокумента; 
	Данные = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаОснования, ДокументОснование.Дата);
	
	Если    ДокументОснование = Неопределено 
		ИЛИ ДокументОснование.Пустая() Тогда
	
		// нет данных для заполнения
		Возврат;	
	
	КонецЕсли;

	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	Запрос.УстановитьПараметр("Курс", 				Данные.Курс/Данные.Кратность);
	
	Запрос.УстановитьПараметр("ОблагаемыйВидДеятельностиНДС", Перечисления.ВидыДеятельностиНДС.Облагаемая);
	
	Запрос.Текст =
	"ВЫБРАТЬ Разрешенные
	|	ОжидаемыйИПодтвержденныйНДСПриобретений.СтавкаНДС,
	|	ОжидаемыйИПодтвержденныйНДСПриобретений.ДляХозяйственнойДеятельности,
	|	ВЫБОР
	|		КОГДА ОжидаемыйИПодтвержденныйНДСПриобретений.ВидДеятельностиНДС = &ОблагаемыйВидДеятельностиНДС
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ДляОперацийОблагаемыхНДС,
	|	Амортизируется КАК Амортизируется,
	|	ОжидаемыйИПодтвержденныйНДСПриобретений.ВозвратнаяТара,
	|	&Курс * ОжидаемыйИПодтвержденныйНДСПриобретений.СуммаНДС КАК СуммаНДС,
	|	&Курс * ОжидаемыйИПодтвержденныйНДСПриобретений.БазаНДС КАК Сумма
	|ИЗ
	|	РегистрНакопления.ОжидаемыйИПодтвержденныйНДСПриобретений КАК ОжидаемыйИПодтвержденныйНДСПриобретений
	|ГДЕ
	|	  ОжидаемыйИПодтвержденныйНДСПриобретений.Регистратор 		 = &ДокументОснование
	|";
	
	// сохраним имеющиеся строки в табличной части
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
	
		Если Выборка.ВозвратнаяТара = Истина Тогда
			
			СуммаВозвратнойТары = СуммаВозвратнойТары + Выборка.Сумма;
			
		Иначе
			
			СтрокаТоваров = Товары.Добавить();
			СтрокаТоваров.СтавкаНДС 					= Выборка.СтавкаНДС;
			СтрокаТоваров.ДляХозяйственнойДеятельности 	= Выборка.ДляХозяйственнойДеятельности;
			СтрокаТоваров.ДляОперацийОблагаемыхНДС 		= Выборка.ДляОперацийОблагаемыхНДС;
			СтрокаТоваров.Амортизируется 				= Выборка.Амортизируется;
			СтрокаТоваров.СуммаНДС 						= Выборка.СуммаНДС;
			СтрокаТоваров.Сумма 						= Выборка.Сумма;
			СтрокаТоваров.СуммаВзаиморасчетов			= Выборка.Сумма + Выборка.СуммаНДС;

			Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ВозвратТоваровПоставщику")
			 ИЛИ ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ВозвратТоваровПоставщикуИзНТТ") Тогда
			
				СтрокаТоваров.Сумма 						= - СтрокаТоваров.Сумма;
				СтрокаТоваров.СуммаВзаиморасчетов			= - СтрокаТоваров.СуммаВзаиморасчетов;	
			
			КонецЕсли;
			
			СтрокаТоваров.СтатьяДекларацииНДСНалоговыйКредит	= ОпределитьСтатьюНалоговойДекларации(СтрокаТоваров);
			
		КонецЕсли; 
	
	КонецЦикла; 

КонецПроцедуры

Процедура ЗаполнитьСчетаУчетаВСтрокеТабЧасти(СтрокаТЧ, Номенклатура) Экспорт

	СчетаУчета = БухгалтерскийУчет.ПолучитьСчетаУчетаНоменклатуры(Организация, Номенклатура);
	
	НалоговоеНазначение = СчетаУчета.НалоговоеНазначение;
	
	Если ЗначениеЗаполнено(НалоговоеНазначение) Тогда
		
		СтрокаТЧ.ДляХозяйственнойДеятельности = НЕ (НалоговоеНазначение.ВидНалоговойДеятельности = Справочники.ВидыНалоговойДеятельности.НеОблагаемая);
		СтрокаТЧ.ДляОперацийОблагаемыхНДС 	  = НЕ (НалоговоеНазначение.ВидДеятельностиНДС = Перечисления.ВидыДеятельностиНДС.Необлагаемая);
		СтрокаТЧ.Амортизируется 	  		  = НалоговоеНазначение.Амортизируется;
		
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьСчетаУчетаВСтрокеТабЧасти()

// Определеяет рекомендуемое значение статьи налоговой декларации (СтатьяДекларацииНДСНалоговыйКредит)
// в зависимости от вида операции документа и значений параметров учета, указанных в строке ТЧ
//
// Параметры:
// СтрокаТЧ - строка ТЧ Товары (возвратная тара в книгу покупок не попадает)
//
Функция ОпределитьСтатьюНалоговойДекларации(СтрокаТЧ) Экспорт
	
	СтатьиДеклараций = Справочники.СтатьиНалоговыхДеклараций;
	

	Если  ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.ПогашениеНалоговогоВекселя Тогда			
		
		    Возврат  СтатьиДеклараций.ПустаяСсылка();
		
	Иначе
		// НалоговаяНакладная 
		// ТоварныйЧек 
		// РасчетКорректировки
		// РаботыОтНерезидентаПрошлогоПериода 
		// BeксeльПpoшлoгoПepиoдa 
		
		// Определим, имеется ли право на налоговый кредит	
		Если  СтрокаТЧ.ДляХозяйственнойДеятельности
			И СтрокаТЧ.ДляОперацийОблагаемыхНДС Тогда
			// Уплаченный НДС имеем право включать в налоговый кредит 
			
			Если    СтрокаТЧ.СтавкаНДС = Перечисления.СтавкиНДС.НДС0 
				ИЛИ СтрокаТЧ.СтавкаНДС = Перечисления.СтавкиНДС.НДС7
				ИЛИ СтрокаТЧ.СтавкаНДС = Перечисления.СтавкиНДС.НДС14
				ИЛИ СтрокаТЧ.СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
				// приобретение с уплатой НДС
				
				Если    ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.НалоговаяНакладная
					ИЛИ ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.ИсправлениеОшибки
					ИЛИ ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.ТоварныйЧек Тогда
					
					// 10.1 Декларации,
					Если СтрокаТЧ.Амортизируется Тогда
						
						Если СтрокаТЧ.ПропорциональныйНДС Тогда
						    Возврат  СтатьиДеклараций.НДС_НКПропорциональноВклВКредитПоставкаОФ;
						Иначе	
							Возврат  СтатьиДеклараций.НДС_НКПокупкаСНДСвВРОблагПриобрОФ;
						КонецЕсли;
					ИначеЕсли (Дата >= '20080101' И Дата < '20110301') И ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом Тогда	
						
						Возврат  СтатьиДеклараций.НДС_НКПокупкаСНДСвВРОблагКомиссия;
						
					Иначе
						
						Если СтрокаТЧ.ПропорциональныйНДС Тогда
						    Возврат  СтатьиДеклараций.НДС_НКПропорциональноВклВКредит;
						Иначе	
							Возврат  СтатьиДеклараций.НДС_НКПокупкаСНДСвВРОблаг;
						КонецЕсли;
						
					КонецЕсли;
					
				ИначеЕсли ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.ВосстановлениеНалоговогоКредита Тогда
					
					Если СтрокаТЧ.ПропорциональныйНДС Тогда
					    Возврат  СтатьиДеклараций.НДС_НККорректировкаВосстановлениеКредитаПропорциональноВклВКредит;
					Иначе	
						Возврат  СтатьиДеклараций.НДС_НККорректировкаВосстановлениеКредита;
					КонецЕсли;

				ИначеЕсли   ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РасчетКорректировкиВозврат
						ИЛИ ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РасчетКорректировкиКорректировка	Тогда

					Если СтрокаТЧ.ПропорциональныйНДС Тогда
						Если СтрокаТЧ.Амортизируется Тогда
							Возврат  СтатьиДеклараций.НДС_НККорректировкаПропорциональноВклВКредитПоставкаОФ;						
						Иначе
							Возврат  СтатьиДеклараций.НДС_НККорректировкаПропорциональноВклВКредит;						
						КонецЕсли;
					Иначе	
						Если СтрокаТЧ.Амортизируется Тогда
							Возврат  СтатьиДеклараций.НДС_НКИзменениеСтоимостиОФ;						
						Иначе
							Возврат  СтатьиДеклараций.НДС_НКИзменениеСтоимости;						
						КонецЕсли;
					КонецЕсли;
					
				ИначеЕсли ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РаботыОтНерезидентаПрошлогоПериода Тогда
					
					Если СтрокаТЧ.ПропорциональныйНДС Тогда
						Возврат  СтатьиДеклараций.НДС_НКПропорциональноВклВКредит;
					Иначе	
						Возврат  СтатьиДеклараций.НДС_НКИмпортВРОблагУслугиНерезидента;
					КонецЕсли;
					
				ИначеЕсли ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.BeксeльПpoшлoгoПepиoдa Тогда
					
					Возврат  СтатьиДеклараций.НДС_НКИмпортВРОблагВексель;
					
				ИначеЕсли  ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.ТаможенноеОформлениеТоваровКомитента Тогда
					
					Если СтрокаТЧ.ПропорциональныйНДС Тогда
						Возврат  СтатьиДеклараций.НДС_НКПропорциональноВклВКредит;
					Иначе	
						Возврат  СтатьиДеклараций.НДС_НКИмпортВРОблагНДСТамож;
					КонецЕсли;
					
				КонецЕсли;
				
			Иначе
				
				// приобретение без НДС
				Если    ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.НалоговаяНакладная
					ИЛИ ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента	
					ИЛИ ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.ВосстановлениеНалоговогоКредита
					ИЛИ ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.ТоварныйЧек Тогда
					
// 11.1 Декларации,
					Возврат  СтатьиДеклараций.НДС_НКПокупкаБезНДСвВРОблаг;
					
				ИначеЕсли ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РасчетКорректировкиВозврат
					  ИЛИ ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РасчетКорректировкиКорректировка	Тогда
					  
					 Возврат  СтатьиДеклараций.НДС_НККорректировкаБезНК;


				Иначе
					// Импорт
					
					Если ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РаботыОтНерезидентаПрошлогоПериода Тогда
						
						// странно, услуги от нерезидента успользуемые на территории Украины облагаются по ставке 20%
						Возврат  СтатьиДеклараций.ПустаяСсылка();
						
					ИначеЕсли ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.BeксeльПpoшлoгoПepиoдa Тогда
						
						// странно, был оформлен  вексель по ГТД не предусматривающей уплаты НДС
						Возврат  СтатьиДеклараций.ПустаяСсылка();
						
					ИначеЕсли  ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.ТаможенноеОформлениеТоваровКомитента Тогда
					
						Возврат  СтатьиДеклараций.НДС_НКИмпортВРОблагБезНДС;
						
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;	
			
		Иначе 
			//нет права на налоговый кредит
			
			Если  СтрокаТЧ.ДляХозяйственнойДеятельности Тогда
				// относятся к хоз. деятельности, но будет использоваться в необлагаемых операциях
				
				Если    СтрокаТЧ.СтавкаНДС = Перечисления.СтавкиНДС.НДС0 
					ИЛИ СтрокаТЧ.СтавкаНДС = Перечисления.СтавкиНДС.НДС7
					ИЛИ СтрокаТЧ.СтавкаНДС = Перечисления.СтавкиНДС.НДС14
					ИЛИ СтрокаТЧ.СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
					// приобретение с уплатой НДС
					
					Если    ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.НалоговаяНакладная
						ИЛИ ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.ИсправлениеОшибки
						ИЛИ ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.ТоварныйЧек 
						ИЛИ ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РасчетКорректировкиВозврат
						ИЛИ ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РасчетКорректировкиКорректировка	Тогда
						
						Если СтрокаТЧ.ПропорциональныйНДС Тогда
							
							Если ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РасчетКорректировкиВозврат
							 ИЛИ ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РасчетКорректировкиКорректировка Тогда
								Если СтрокаТЧ.Амортизируется Тогда
									Возврат  СтатьиДеклараций.НДС_НККорректировкаПропорциональноНеВклВКредитПоставкаОФ;						
								Иначе
									Возврат  СтатьиДеклараций.НДС_НККорректировкаПропорциональноНеВклВКредит;						
								КонецЕсли;
							Иначе
								Если СтрокаТЧ.Амортизируется Тогда
									Возврат  СтатьиДеклараций.НДС_НКПропорциональноНеВклВКредитПоставкаОФ;		
								Иначе
									Возврат  СтатьиДеклараций.НДС_НКПропорциональноНеВклВКредит;		
								КонецЕсли;
							КонецЕсли;
							
						ИначеЕсли ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РасчетКорректировкиВозврат
							  ИЛИ ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РасчетКорректировкиКорректировка Тогда	
							Если Дата < '2014-12-01' Тогда
								Возврат  СтатьиДеклараций.НДС_НККорректировкаБезНКНеХоз;
							Иначе
								Если СтрокаТЧ.Амортизируется Тогда
									Возврат  СтатьиДеклараций.НДС_НКИзменениеСтоимостиОФ;						
								Иначе
									Возврат  СтатьиДеклараций.НДС_НКИзменениеСтоимости;						
								КонецЕсли;
							КонецЕсли;
							
						Иначе
						
							Если СтрокаТЧ.Амортизируется Тогда
								Возврат  СтатьиДеклараций.НДС_НКПокупкаСНДСвВРНеОблагПриобрОФ;
							Иначе
								Возврат  СтатьиДеклараций.НДС_НКПокупкаСНДСвВРНеОблаг;
							КонецЕсли;
							
						КонецЕсли;	
						
					ИначеЕсли ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.ВосстановлениеНалоговогоКредита Тогда	
						Если СтрокаТЧ.ПропорциональныйНДС Тогда
							Возврат СтатьиДеклараций.НДС_НККорректировкаВосстановлениеКредитаПропорциональноНеВклВКредит;	
						Иначе
							Возврат СтатьиДеклараций.НДС_НКПокупкаСНДСвВРНеОблаг;	
						КонецЕсли
					ИначеЕсли ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РаботыОтНерезидентаПрошлогоПериода Тогда
						
						// 13.3  Декларации,
						Если СтрокаТЧ.ПропорциональныйНДС Тогда
							Если СтрокаТЧ.Амортизируется Тогда
								Возврат  СтатьиДеклараций.НДС_НКПропорциональноНеВклВКредитПоставкаОФ;		
							Иначе
								Возврат  СтатьиДеклараций.НДС_НКПропорциональноНеВклВКредит;		
							КонецЕсли;
						Иначе	
							Возврат  СтатьиДеклараций.НДС_НКИмпортВРНеОблагНеОбъектУслугиНерезидента;
						КонецЕсли;
						
					ИначеЕсли ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.BeксeльПpoшлoгoПepиoдa Тогда
						
						    Возврат  СтатьиДеклараций.ПустаяСсылка();
						
					ИначеЕсли  ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.ТаможенноеОформлениеТоваровКомитента Тогда
					
						Если СтрокаТЧ.ПропорциональныйНДС Тогда
							Если СтрокаТЧ.Амортизируется Тогда
								Возврат  СтатьиДеклараций.НДС_НКПропорциональноНеВклВКредитПоставкаОФ;		
							Иначе
								Возврат  СтатьиДеклараций.НДС_НКПропорциональноНеВклВКредит;		
							КонецЕсли;
						Иначе	
							Возврат  СтатьиДеклараций.НДС_НКИмпортВРНеОблагНеОбъектНДСТамож;
						КонецЕсли;
						
					КонецЕсли;
					
				Иначе
					// приобретение без НДС					 

					Если    ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.НалоговаяНакладная
						ИЛИ ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.ИсправлениеОшибки
						ИЛИ ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.ТоварныйЧек Тогда
						
						Возврат  СтатьиДеклараций.НДС_НКПокупкаБезНДСвВРНеОблаг;
						
					ИначеЕсли ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РасчетКорректировкиВозврат
						  ИЛИ ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РасчетКорректировкиКорректировка	Тогда
						
						Возврат  СтатьиДеклараций.НДС_НККорректировкаБезНК;
						
					Иначе
						// Импорт
						Если ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РаботыОтНерезидентаПрошлогоПериода Тогда
							
							// странно, услуги от нерезидента успользуемые на территории Украины облагаются по ставке 20%
							Возврат  СтатьиДеклараций.ПустаяСсылка();
							
						ИначеЕсли ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.BeксeльПpoшлoгoПepиoдa Тогда
							
							// странно, был оформлен  вексель по ГТД не предусматривающей уплаты НДС
							Возврат  СтатьиДеклараций.ПустаяСсылка();
							
						ИначеЕсли  ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.ТаможенноеОформлениеТоваровКомитента Тогда
					
							Возврат  СтатьиДеклараций.НДС_НКИмпортВРНеОблагНеОбъектБезНДС;
						
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;	
				
			Иначе 
				//не относятся к хоз деятельности 
				
				Если    СтрокаТЧ.СтавкаНДС = Перечисления.СтавкиНДС.НДС0 
					ИЛИ СтрокаТЧ.СтавкаНДС = Перечисления.СтавкиНДС.НДС7
					ИЛИ СтрокаТЧ.СтавкаНДС = Перечисления.СтавкиНДС.НДС14
					ИЛИ СтрокаТЧ.СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
					
					// приобретение с уплатой НДС
					
					Если ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РасчетКорректировкиВозврат
						  ИЛИ ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РасчетКорректировкиКорректировка Тогда	
					
						Если СтрокаТЧ.Амортизируется Тогда
							Возврат  СтатьиДеклараций.НДС_НКИзменениеСтоимостиОФ;						
						Иначе
							Возврат  СтатьиДеклараций.НДС_НКИзменениеСтоимости;						
						КонецЕсли;
					Иначе	
						
						Если СтрокаТЧ.Амортизируется Тогда
							Возврат  СтатьиДеклараций.НДС_НКПокупкаБезНДСнеВРОФ;						
						Иначе
							Возврат  СтатьиДеклараций.НДС_НКПокупкаСНДСнеВР_;						
						КонецЕсли;
						
					КонецЕсли;
					
				Иначе
					// приобретение без уплаты НДС
					
					Если ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РасчетКорректировкиВозврат
						  ИЛИ ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РасчетКорректировкиКорректировка Тогда	
						Если Дата < '2014-12-01' Тогда
							
							Возврат  СтатьиДеклараций.НДС_НККорректировкаБезНК;
							
						Иначе	
							
							Возврат  СтатьиДеклараций.НДС_НККорректировкаБезНКНеХоз;
							
						КонецЕсли;
						
					Иначе	
						
						Возврат  СтатьиДеклараций.НДС_НКПокупкаБезНДСнеВР_;
						
					КонецЕсли;
					
				КонецЕсли;			
				
			КонецЕсли;
			
		КонецЕсли;		
		
	КонецЕсли;			
	
КонецФункции                    

// В случае, когда документ-основание является документом оплаты или Авансовым отчетом (то есть документом,
// в которм могут быть указаны несколько Договоров/сделок) - возвращает один из договоров/сделку. Выбор производится либо
// автоматически, либо (при работе на Клиенте и если договоров несколько) интерактивно пользователем.
// Параметры
//   Основание - Документ основание
// Возвращаемое значение:
//  Структура 
//		<СправочникСсылка.ДоговорыКонтрагентов>   – выбранный/определенный договор
//		<ДокументСсылка>   						  – выбранная сделка
//
Функция ОпределитьДоговорСделку(Основание) 
	
	Перем ТабДоговора, ПредпочтительныйДоговорСделка;
	
	ПустойДоговорСделка = Новый Структура("ДоговорКонтрагента,Сделка");
	
	Если Основание = Неопределено Тогда
		
		Возврат ПустойДоговорСделка;
		
	КонецЕсли;	
	
	МетаданныеДокумента = Основание.Метаданные();
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.АвансовыйОтчет") Тогда
		
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ
		                |	АвансовыйОтчетВозвратнаяТара.ДоговорКонтрагента,
		                |	АвансовыйОтчетВозвратнаяТара.Контрагент КАК Контрагент,
						|	АвансовыйОтчетВозвратнаяТара.Сделка КАК Сделка
		                |ИЗ
		                |	Документ.АвансовыйОтчет.ВозвратнаяТара КАК АвансовыйОтчетВозвратнаяТара
		                |ГДЕ
		                |	 АвансовыйОтчетВозвратнаяТара.Ссылка = &Ссылка
		                |	 И НЕ АвансовыйОтчетВозвратнаяТара.ДоговорКонтрагента = &ПустойДоговор
		                |
		                |ОБЪЕДИНИТЬ
		                |
		                |ВЫБРАТЬ
		                |	АвансовыйОтчетОплатаПоставщикам.ДоговорКонтрагента,
		                |	АвансовыйОтчетОплатаПоставщикам.Контрагент,
						|	АвансовыйОтчетОплатаПоставщикам.Сделка
		                |ИЗ
		                |	Документ.АвансовыйОтчет.ОплатаПоставщикам КАК АвансовыйОтчетОплатаПоставщикам
		                |ГДЕ
		                |	АвансовыйОтчетОплатаПоставщикам.Ссылка = &Ссылка
		                |	И НЕ АвансовыйОтчетОплатаПоставщикам.ДоговорКонтрагента = &ПустойДоговор
		                |
		                |ОБЪЕДИНИТЬ
		                |
		                |ВЫБРАТЬ
		                |	АвансовыйОтчетПрочее.ДоговорКонтрагента,
		                |	АвансовыйОтчетПрочее.Контрагент,
						|	АвансовыйОтчетПрочее.Сделка
		                |ИЗ
		                |	Документ.АвансовыйОтчет.Прочее КАК АвансовыйОтчетПрочее
		                |ГДЕ
		                |	АвансовыйОтчетПрочее.Ссылка = &Ссылка
		                |	И НЕ АвансовыйОтчетПрочее.ДоговорКонтрагента = &ПустойДоговор
		                |
		                |ОБЪЕДИНИТЬ
		                |
		                |ВЫБРАТЬ
		                |	АвансовыйОтчетТовары.ДоговорКонтрагента,
		                |	АвансовыйОтчетТовары.Контрагент,
						|	АвансовыйОтчетТовары.Сделка
		                |ИЗ
		                |	Документ.АвансовыйОтчет.Товары КАК АвансовыйОтчетТовары
		                |ГДЕ
		                |	 АвансовыйОтчетТовары.Ссылка = &Ссылка
		                |	 И НЕ АвансовыйОтчетТовары.ДоговорКонтрагента = &ПустойДоговор
		                |
		                |ОБЪЕДИНИТЬ
		                |
		                |ВЫБРАТЬ
		                |	РегистрНДС.ДоговорКонтрагента,
		                |	РегистрНДС.ДоговорКонтрагента.Владелец,
						|	РегистрНДС.Сделка
		                |ИЗ
		                |	РегистрНакопления.ОжидаемыйИПодтвержденныйНДСПриобретений КАК РегистрНДС
		                |ГДЕ
		                |	    РегистрНДС.Регистратор = &Ссылка
						|  И НЕ РегистрНДС.ДоговорКонтрагента.СложныйНалоговыйУчет
						|";
						
		Запрос.УстановитьПараметр("Ссылка", Основание);
		Запрос.УстановитьПараметр("ПустойДоговор", Справочники.ДоговорыКонтрагентов.ПустаяСсылка());
		ТабДоговора = Запрос.Выполнить().Выгрузить();
		
		Если ТабДоговора.Количество() = 0 Тогда
			
			Возврат ПустойДоговорСделка;
			
		КонецЕсли;
		
		// первый указанный в документе договор
		ПредпочтительныйДоговорСделка = Новый Структура("ДоговорКонтрагента, Сделка", ТабДоговора[0].ДоговорКонтрагента, ТабДоговора[0].Сделка);
		
		ТабДоговора.Свернуть("Контрагент, ДоговорКонтрагента, Сделка", "");
		ТабДоговора.Сортировать("Контрагент, ДоговорКонтрагента, Сделка");
		ТабДоговора.Колонки.ДоговорКонтрагента.Заголовок = НСтр("ru = 'Договор'; uk = 'Договір'");
		ТабДоговора.Колонки.Контрагент.Заголовок = НСтр("ru = 'Контрагент'; uk = 'Контрагент'");
		ТабДоговора.Колонки.Сделка.Заголовок = НСтр("ru = 'Сделка'; uk = 'Угода'");
		ТабДоговора.Колонки.ДоговорКонтрагента.Ширина = 20;
		ТабДоговора.Колонки.Контрагент.Ширина = 10;
		ТабДоговора.Колонки.Сделка.Ширина = 30;
		
	ИначеЕсли ОбщегоНазначения.ЕстьТабЧастьДокумента("РасшифровкаПлатежа", МетаданныеДокумента) Тогда
		
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ
		                |	ПлатежныйДокумент.ДоговорКонтрагента,
						|	ПлатежныйДокумент.Сделка
		                |ИЗ
		                |	Документ."+ МетаданныеДокумента.Имя +".РасшифровкаПлатежа КАК ПлатежныйДокумент
		                |ГДЕ
		                |	ПлатежныйДокумент.Ссылка = &Ссылка
						|
						|ОБЪЕДИНИТЬ 
						|
						|ВЫБРАТЬ
		                |	РегистрНДС.ДоговорКонтрагента,
						|	РегистрНДС.Сделка
		                |ИЗ
		                |	РегистрНакопления.ОжидаемыйИПодтвержденныйНДСПриобретений КАК РегистрНДС
		                |ГДЕ
		                |	    РегистрНДС.Регистратор = &Ссылка
						|  И НЕ РегистрНДС.ДоговорКонтрагента.СложныйНалоговыйУчет";
						
		Запрос.УстановитьПараметр("Ссылка", Основание);
		ТабДоговора = Запрос.Выполнить().Выгрузить();
		
		Если ТабДоговора.Количество() = 0 Тогда
			
			Возврат ПустойДоговорСделка;
			
		КонецЕсли;
		
		// первый указанный в документе договор
		ПредпочтительныйДоговорСделка = Новый Структура("ДоговорКонтрагента, Сделка", ТабДоговора[0].ДоговорКонтрагента, ТабДоговора[0].Сделка);
		
		ТабДоговора.Свернуть("ДоговорКонтрагента,Сделка", "");		
		ТабДоговора.Сортировать("ДоговорКонтрагента,Сделка");		
		ТабДоговора.Колонки.ДоговорКонтрагента.Заголовок = НСтр("ru = 'Договор'; uk = 'Договір'");
		ТабДоговора.Колонки.Сделка.Заголовок = НСтр("ru = 'Сделка'; uk = 'Угода'");
		ТабДоговора.Колонки.ДоговорКонтрагента.Ширина = 30;
		ТабДоговора.Колонки.Сделка.Ширина = 30;
		
	ИначеЕсли ОбщегоНазначения.ЕстьТабЧастьДокумента("СуммыДолга", МетаданныеДокумента) Тогда
		
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ
		                |	КорректировкаДолга.ДоговорКонтрагента,
						|	КорректировкаДолга.Сделка
		                |ИЗ
		                |	Документ."+ МетаданныеДокумента.Имя +".СуммыДолга КАК КорректировкаДолга
		                |ГДЕ
		                |	КорректировкаДолга.Ссылка = &Ссылка
						|
						|ОБЪЕДИНИТЬ 
						|
						|ВЫБРАТЬ
		                |	РегистрНДС.ДоговорКонтрагента,
						|	РегистрНДС.Сделка
		                |ИЗ
		                |	РегистрНакопления.ОжидаемыйИПодтвержденныйНДСПриобретений КАК РегистрНДС
		                |ГДЕ
		                |	    РегистрНДС.Регистратор = &Ссылка
						|  И НЕ РегистрНДС.ДоговорКонтрагента.СложныйНалоговыйУчет";
						
		Запрос.УстановитьПараметр("Ссылка", Основание);
		ТабДоговора = Запрос.Выполнить().Выгрузить();
		
		Если ТабДоговора.Количество() = 0 Тогда
			
			Возврат ПустойДоговорСделка;
			
		КонецЕсли;
		
		// первый указанный в документе договор
		ПредпочтительныйДоговорСделка = Новый Структура("ДоговорКонтрагента, Сделка", ТабДоговора[0].ДоговорКонтрагента, ТабДоговора[0].Сделка);
		
		ТабДоговора.Свернуть("ДоговорКонтрагента,Сделка", "");		
		ТабДоговора.Сортировать("ДоговорКонтрагента,Сделка");		
		ТабДоговора.Колонки.ДоговорКонтрагента.Заголовок = НСтр("ru = 'Договор'; uk = 'Договір'");
		ТабДоговора.Колонки.Сделка.Заголовок = НСтр("ru = 'Сделка'; uk = 'Угода'");
		ТабДоговора.Колонки.ДоговорКонтрагента.Ширина = 30;
		ТабДоговора.Колонки.Сделка.Ширина = 30;
		
	
	ИначеЕсли ОбщегоНазначения.ЕстьРеквизитДокумента("ДоговорКонтрагента",  МетаданныеДокумента) Тогда
		
		ПредпочтительныйДоговорСделка = Новый Структура("ДоговорКонтрагента, Сделка", Основание.ДоговорКонтрагента, Неопределено);
		
		Если    ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказПоставщику")
			ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.СчетНаОплатуПоставщика") Тогда
			
			// сам документ и будет сделкой
			ПредпочтительныйДоговорСделка.Вставить("Сделка", Основание);	
			
			Возврат ПредпочтительныйДоговорСделка;

		ИначеЕсли ОбщегоНазначения.ЕстьРеквизитДокумента("Сделка",  				 МетаданныеДокумента)
			  ИЛИ ОбщегоНазначения.ЕстьРеквизитДокумента("СделкаПоПриобретению",  МетаданныеДокумента) Тогда
			  
			ИмяРеквизитаСделка = ?(ОбщегоНазначения.ЕстьРеквизитДокумента("СделкаПоПриобретению",  МетаданныеДокумента), 
								   "СделкаПоПриобретению", 
								   "Сделка");
			  
			Если     Основание.ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам 
				 ИЛИ Основание.ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам Тогда
				
				ПредпочтительныйДоговорСделка.Вставить("Сделка", Основание[ИмяРеквизитаСделка]);		
				
			КонецЕсли;
			
			ЗаказВТЧ = Константы.УказаниеЗаказовВТабличнойЧастиДокументов.Получить();
			Если Основание.ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам
				И (    ЗаказВТЧ = Перечисления.ВариантыУказанияЗаказовВТабличнойЧастиДокументов.ДляДокументовПоступленияРеализации 
				   ИЛИ ЗаказВТЧ = Перечисления.ВариантыУказанияЗаказовВТабличнойЧастиДокументов.ДляДокументовПоступления)
				И (    ТипЗнч(Основание) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") 
				   ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.ПоступлениеТоваровУслугВНТТ") ) Тогда
				   
				  МетаданныеОснования = Основание.Метаданные();
				  МассивЗаказов = Новый Массив;
				  Для каждого ТЧОснования Из МетаданныеОснования.ТабличныеЧасти Цикл
					  Если НЕ (ТЧОснования.Реквизиты.Найти("ЗаказПоставщику") = Неопределено) Тогда
						  Для каждого СтрокаТЧ Из Основание[ТЧОснования.Имя] Цикл
							  МассивЗаказов.Добавить(СтрокаТЧ.ЗаказПоставщику);
						  КонецЦикла;
					  КонецЕсли;						
				  КонецЦикла;
				  МассивЗаказов = УчетНДС.УдалитьПовторяющиесяЭлементыМассива(МассивЗаказов);				
				  
				  ТабДоговора = Новый ТаблицаЗначений();
				  ТабДоговора.Колонки.Добавить("ДоговорКонтрагента");
				  ТабДоговора.Колонки.Добавить("Сделка");
				  ТабДоговора.Колонки.ДоговорКонтрагента.Заголовок = НСтр("ru = 'Договор'; uk = 'Договір'");
				  ТабДоговора.Колонки.Сделка.Заголовок = НСтр("ru = 'Сделка'; uk = 'Угода'");
				  ТабДоговора.Колонки.ДоговорКонтрагента.Ширина = 30;
				  ТабДоговора.Колонки.Сделка.Ширина = 30;
				  
				  Для каждого Заказ Из МассивЗаказов Цикл
				  	СтрокаДоговоров = ТабДоговора.Добавить();
				  	СтрокаДоговоров.ДоговорКонтрагента = Основание.ДоговорКонтрагента;
				    СтрокаДоговоров.Сделка = Заказ;
				  КонецЦикла; 
				  
				  Если ЗначениеЗаполнено(ПредпочтительныйДоговорСделка.Сделка) Тогда
				  	СтрокаДоговоров = ТабДоговора.Вставить(0);
				  	СтрокаДоговоров.ДоговорКонтрагента = Основание.ДоговорКонтрагента;
				    СтрокаДоговоров.Сделка = ПредпочтительныйДоговорСделка.Сделка;
				  ИначеЕсли МассивЗаказов.Количество() > 0 Тогда
					ПредпочтительныйДоговорСделка.Сделка = МассивЗаказов[0];
				  КонецЕсли;
				  
				  ТабДоговора.Свернуть("ДоговорКонтрагента,Сделка", "");		
				  
			ИначеЕсли НЕ Основание.ДоговорКонтрагента.СложныйНалоговыйУчет 
				  И Основание.ДоговорКонтрагента.ВестиПоДокументамРасчетовСКонтрагентомРегл Тогда
				  
				  ПредпочтительныйДоговорСделка.Вставить("Сделка",  Основание.Сделка);		
				  
				  Если Основание.Проведен Тогда
						Запрос = Новый Запрос();
						Запрос.Текст = "ВЫБРАТЬ
						                |	РегистрНДС.ДоговорКонтрагента,
										|	РегистрНДС.Сделка
						                |ИЗ
						                |	РегистрНакопления.ОжидаемыйИПодтвержденныйНДСПриобретений КАК РегистрНДС
						                |ГДЕ
						                |	РегистрНДС.Регистратор = &Ссылка";
										
						Запрос.УстановитьПараметр("Ссылка", Основание);
						ТабДоговора = Запрос.Выполнить().Выгрузить();
						
						Если ТабДоговора.Количество() = 0 Тогда
							// это очень странно
							Возврат ПредпочтительныйДоговорСделка;
							
						КонецЕсли;
						
						// первый указанный в документе договор
						ПредпочтительныйДоговорСделка = Новый Структура("ДоговорКонтрагента, Сделка", ТабДоговора[0].ДоговорКонтрагента, ТабДоговора[0].Сделка);
						
						ТабДоговора.Свернуть("ДоговорКонтрагента,Сделка", "");		
						ТабДоговора.Сортировать("ДоговорКонтрагента,Сделка");		
						ТабДоговора.Колонки.ДоговорКонтрагента.Заголовок = НСтр("ru = 'Договор'; uk = 'Договір'");
						ТабДоговора.Колонки.Сделка.Заголовок = НСтр("ru = 'Сделка'; uk = 'Угода'");
						ТабДоговора.Колонки.ДоговорКонтрагента.Ширина = 30;
						ТабДоговора.Колонки.Сделка.Ширина = 30;
				  Иначе
					  Возврат ПредпочтительныйДоговорСделка;		
				  КонецЕсли;
			Иначе	  
				
				Возврат ПредпочтительныйДоговорСделка;
			
			КонецЕсли;
			
		Иначе
			
			Возврат ПредпочтительныйДоговорСделка;
			
		КонецЕсли;
				
	Иначе
		
		Возврат ПустойДоговорСделка;	
		
	КонецЕсли; 

	
	Если ТабДоговора.Количество() = 1 Тогда 
		// единственный договор
		Возврат  ПредпочтительныйДоговорСделка;
		
	Иначе
		// несколько договоров
#Если Клиент Тогда
	
		ВыбраннаяСтрока = ТабДоговора.ВыбратьСтроку(НСтр("ru='Выберите договор контрагента:';uk='Виберіть договір контрагента:'"));
		Если ВыбраннаяСтрока = Неопределено  Тогда
		
			Возврат ПустойДоговорСделка;
		
		Иначе
			
			Возврат Новый Структура("ДоговорКонтрагента, Сделка", ВыбраннаяСтрока.ДоговорКонтрагента, ВыбраннаяСтрока.Сделка);
			
		КонецЕсли; 
		
#Иначе
	
		// нет возможности выбрать интерактивно
		Возврат ПредпочтительныйДоговорСделка;
		
#КонецЕсли

	КонецЕсли;
	
КонецФункции // ОпределитьДоговорСделку()

Процедура XMLЗаполнить(ЗаполняемыеДанные = "", ТекстXML = Неопределено) Экспорт
	
	ЗаполнятьШапку = Истина;
	ЗаполнятьТЧ = Истина;
	ЗаполнятьКорректируемыйДокумент = Истина;
	Если НЕ ПустаяСтрока(ЗаполняемыеДанные) Тогда
		
		ЗаполняемыеДанныеВРЕГ = ВРег(ЗаполняемыеДанные);
		ЗаполнятьШапку = Найти(ЗаполняемыеДанныеВРЕГ, "ШАПКА") > 0;
		ЗаполнятьТЧ = Найти(ЗаполняемыеДанныеВРЕГ, "ТЧ") > 0;
		ЗаполнятьКорректируемыйДокумент = Найти(ЗаполняемыеДанныеВРЕГ, "КОРРЕКТИРУЕМЫЙДОКУМЕНТ") > 0;
		
	КонецЕсли; 
	
	Если НЕ ЗаполнятьШапку И НЕ ЗаполнятьТЧ И НЕ ЗаполнятьКорректируемыйДокумент Тогда
		Возврат;
	КонецЕсли;
	
		
	СтруктураПоказателейXML = Новый Структура();
	ТЧ = Новый ТаблицаЗначений;
	СтруктураПоказателейXML.Вставить("ТабличнаяЧасть", ТЧ);
	ТЧ.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"));
	КоличествоСтрокТЧ = 0;

	Если ТекстXML = Неопределено Тогда
		ДДXML = ДанныеXML.Получить();// двоичные данные
		Если ЗначениеЗаполнено(ДДXML) Тогда
			ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");
			ДДXML.Записать(ИмяВременногоФайла);
			Текст = Новый ТекстовыйДокумент;
			Текст.Прочитать(ИмяВременногоФайла, "windows-1251");
			ТекстXML = Текст.ПолучитьТекст();
			УдалитьФайлы(ИмяВременногоФайла);
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	

	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ИгнорироватьПробелы = Истина;
	Попытка
		ЧтениеXML.УстановитьСтроку(ТекстXML);
	Исключение
		
		Сообщить(НСТр("ru='Данный файл содерижит информацию в закодированном виде или не является стандартым текстовым XML-файлом."
"Необходимо воспользоваться специализированным программным обеспечением для его расшифровки.';uk='Зазначений файл містить інформацію в закодованому вигляді або не являє собою стандартний текстовий XML-файл."
"Необхідно скористатися спеціалізованим програмним забезбеченням для його розшифрування.'"));
							 
		Возврат;
		
	КонецПопытки;
	
	Пока ЧтениеXML.Прочитать() Цикл
		
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			
			ТекУзел = ВРЕГ(ЧтениеXML.Имя);
			НачалоХХХХ = Найти(ТекУзел, "XXXX");
			
			Если    ТекУзел = "DECLAR"
				ИЛИ ТекУзел = "DECLARHEAD"
				ИЛИ ТекУзел = "DECLARBODY"
				ИЛИ ТекУзел = "LINKED_DOCS" Тогда
				Продолжить;
			ИначеЕсли ВРЕГ(ЧтениеXML.ЗначениеАтрибута("xsi:nil")) = "TRUE" Тогда
					Продолжить;
			ИначеЕсли НачалоХХХХ > 0 И ЗаполнятьТЧ Тогда
				
				НомерСтрокиСтрокой = ЧтениеXML.ЗначениеАтрибута("ROWNUM");
				Если Не ЗначениеЗаполнено(НомерСтрокиСтрокой) Тогда
					Продолжить;
				КонецЕсли;        

				НомерСтроки = Число(НомерСтрокиСтрокой);
				Пока НомерСтроки > КоличествоСтрокТЧ Цикл
					
					КоличествоСтрокТЧ = КоличествоСтрокТЧ + 1;

					НоваяСтрока = ТЧ.Добавить();
					НоваяСтрока.НомерСтроки = КоличествоСтрокТЧ;

				КонецЦикла;
				
				ИмяКолонки = Сред(ТекУзел, НачалоХХХХ + 4);
				Если ТЧ.Колонки.Найти(ИмяКолонки) = Неопределено Тогда
					ТЧ.Колонки.Добавить(ИмяКолонки, Новый ОписаниеТипов("Строка"));
				КонецЕсли;
				
				ЧтениеXML.Прочитать();
				ТЧ[НомерСтроки - 1][ИмяКолонки] = ЧтениеXML.Значение;
				
			Иначе
				ЧтениеXML.Прочитать();
				СтруктураПоказателейXML.Вставить(ТекУзел, ЧтениеXML.Значение);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;		
	
	ЧтениеXML.Закрыть();
	
	// определим номер схемы документа
	C_DOC     = ""; СтруктураПоказателейXML.Свойство("C_DOC",	   C_DOC);
	C_DOC_SUB = ""; СтруктураПоказателейXML.Свойство("C_DOC_SUB", C_DOC_SUB);
	C_DOC_VER = ""; СтруктураПоказателейXML.Свойство("C_DOC_VER", C_DOC_VER);

	// найдем подходящую форму налоговой (регл. отчет)
	Если  НЕ (C_DOC     = "J12" ИЛИ C_DOC     = "F12")
		И НЕ (C_DOC_SUB = "010" ИЛИ C_DOC_SUB = "012") Тогда
		
		// не тот XML подсунули
		Сообщить(НСТр("ru='Загруженный файл не является XML образом Налоговой накладной или Приложения 2 к налоговой накладной!';uk='Завантажений файл не є XML образом Податкової накладної або Додатка 2 до податкової накладної!'"));
		Возврат;	
		
	КонецЕсли;
	
	ПоддерживаемаяВерсия = Ложь;
	
	Попытка
		ПоддерживаемаяВерсия =  Число(C_DOC_VER) >= 8;
	Исключение
	КонецПопытки;
	
	Если Не ПоддерживаемаяВерсия Тогда
		Сообщить(НСТр("ru='Загруженный файл XML имеет устаревшую версию, загрузка не поддерживается.'"));
		Возврат;	
	КонецЕсли;
	
	Если ЗаполнятьШапку ИЛИ ЗаполнятьТЧ Тогда
		
		Если C_DOC_SUB = "010" Тогда
			ИсточникиСумм = 
			"R03G7, НДС20, НДС,
			|R03G109, НДС7, НДС,
			|R03G14, НДС14, НДС,
			|R01G7, НДС20, База, 
			|R01G109, НДС7, База,
			|R01G14, НДС14, База,
			|R01G9, НДС0, База,
			|R01G8, НДС0, База,
			|R01G10, БезНДС, База,";
		Иначе
			ИсточникиСумм = 
			"R02G9, НДС20, НДС,
			|R02G111, НДС7, НДС,
			|R03G14, НДС14, НДС,
			|R01G9, НДС20, База, 
			|R01G111, НДС7, База,
			|R01G14, НДС14, База,
			|R006G03, НДС0, База,
			|R007G03, НДС0, База,
			|R01G11, БезНДС, База,";
		КонецЕсли;
		
		ТаблицаСумм = Новый ТаблицаЗначений;
		ТаблицаСумм.Колонки.Добавить("Имя");
		ТаблицаСумм.Колонки.Добавить("СтавкаНДС");
		ТаблицаСумм.Колонки.Добавить("Показатель");
		ТаблицаСумм.Колонки.Добавить("База", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
		ТаблицаСумм.Колонки.Добавить("НДС", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
		ТаблицаСумм.Колонки.Добавить("Установлен", Новый ОписаниеТипов("Булево"));

		
		Для ж = 1 По СтрЧислоСтрок(ИсточникиСумм) Цикл
			
			НовыйИсточник = ТаблицаСумм.Добавить();
			
			ЧастиИсточника = Новый Массив;
			//определяем позицию первого разделителя
			ИсходнаяСтрока = СтрПолучитьСтроку(ИсточникиСумм, ж);
			позРазделителя = Найти(ИсходнаяСтрока, ", ");
			Пока позРазделителя > 0 Цикл
				//добавляем первую подстроку
				ЧастиИсточника.Добавить(Лев(ИсходнаяСтрока, позРазделителя - 1));
				//обрезаем исходную строку до места окончания разделителя
				ИсходнаяСтрока = Сред(ИсходнаяСтрока, позРазделителя + 2);
				//обновляем позицию разделителя
				позРазделителя = Найти(ИсходнаяСтрока, ",");
			КонецЦикла;
			
			Для жж = 0 По 2 Цикл      
				ЧастьИсточника = СокрЛП(ЧастиИсточника[жж]);
				Если жж = 1 Тогда
					НовыйИсточник[жж] = Перечисления.СтавкиНДС[ЧастьИсточника];					
				Иначе
					НовыйИсточник[жж] = ЧастьИсточника;
				КонецЕсли;
			КонецЦикла;
			
		КонецЦикла;
		
		ЗначениеПоказателя = "";
		Для каждого СтрокаТаблицы Из ТаблицаСумм Цикл
			
			Если СтруктураПоказателейXML.Свойство(СтрокаТаблицы.Имя, ЗначениеПоказателя) Тогда
				
				СтрокаТаблицы[СтрокаТаблицы.Показатель] = ЗначениеПоказателя;
				СтрокаТаблицы.Установлен = Истина;	
			КонецЕсли;
			
		КонецЦикла;
		
		ТаблицаСумм = ТаблицаСумм.Скопировать(Новый Структура("Установлен", Истина), "СтавкаНДС, База, НДС");
		ТаблицаСумм.Свернуть("СтавкаНДС", "База, НДС");
		
	КонецЕсли;
	
	Если ЗаполнятьШапку Тогда
		
		// заполним структуру показателй последней текущей версии
		// переопределим для старых версий
		
		Если C_DOC_SUB = "010" Тогда
			НовВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.НалоговаяНакладная");	
		Иначе
			НовВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РасчетКорректировкиВозврат");	
		КонецЕсли;
		
		Если ВидОперации <> НовВидОперации Тогда
			
			Если ЗначениеЗаполнено(ВидОперации) Тогда
				Сообщить(НСтр("ru='При заполнении изменен вид операции докумнта!';uk='При заповненні змінений вид операції документа!'"), СтатусСообщения.Важное);
			КонецЕсли;
			
			ВидОперации = НовВидОперации;
			
			ВидДокумента = "-";
			ВключаетсяВУточняющийРасчет = Ложь;	
			
		КонецЕсли;
		
		// Организация
		ОрганизацияИНН = ""; СтруктураПоказателейXML.Свойство("HKBUY", ОрганизацияИНН);
		
		СписокПоказателей = Новый СписокЗначений; 
		СписокПоказателей.Добавить("","ИНН");
		Сведения = РегламентированнаяОтчетность.ПолучитьСведенияОбОрганизации(Организация, Дата, СписокПоказателей);
		
		Если НЕ Сведения.Свойство("ИНН") ИЛИ НЕ (ОрганизацияИНН = Сведения.ИНН) Тогда
			
			Если ЗначениеЗаполнено(Организация) Тогда
				Сообщить(НСтр("ru='ИНН Организации в документе не совпадает с ИНН Покупателя из файла!';uk='ІПН Організації в документі, не збігається з ІПН Покупця з файлу!'"), СтатусСообщения.Важное);	                                   
			КонецЕсли;
			
			ЗаполнитьОрганизациюПоИНН(ОрганизацияИНН);
			
		КонецЕсли;
		
		// контрагент
		КонтрагентИНН = ""; 		СтруктураПоказателейXML.Свойство("HKSEL", КонтрагентИНН);
		
		Если НЕ Контрагент.ИНН = КонтрагентИНН Тогда
			
			Если ЗначениеЗаполнено(Контрагент) Тогда
				Сообщить(НСтр("ru='Данные контрагента (ИНН) не соответствуют данным из файла';uk='Дані контрагента (ІПН) не відповідають даним з файлу'"), СтатусСообщения.Важное);	
			КонецЕсли;
			
			ЗаполнитьКонтрагентаПоИНН(КонтрагентИНН);		
			
		КонецЕсли;
		
		//номер вх. документа
		HNUM  = ""; СтруктураПоказателейXML.Свойство("HNUM",  HNUM);  HNUM  = СокрЛП(HNUM);
		HNUM1 = ""; СтруктураПоказателейXML.Свойство("HNUM1", HNUM1); HNUM1 = СокрЛП(HNUM1); HNUM1 = ?(HNUM1 = "0", "", HNUM1);
		HNUM2 = ""; СтруктураПоказателейXML.Свойство("HNUM2", HNUM2); HNUM2 = СокрЛП(HNUM2);
		НомерВходящегоДокумента = HNUM; 
		Если ЗначениеЗаполнено(HNUM1) Тогда
			НомерВходящегоДокумента = НомерВходящегоДокумента + "/" + HNUM1;
		КонецЕсли;
		Если ЗначениеЗаполнено(HNUM2) Тогда
			Если ЗначениеЗаполнено(HNUM1) Тогда
				Если C_DOC_VER > "04" Тогда
					// всего два слеша
					НомерВходящегоДокумента = НомерВходящегоДокумента + "/" + HNUM2;	
				Иначе	
					// всего один слеш
					НомерВходящегоДокумента = НомерВходящегоДокумента + HNUM2;	
				КонецЕсли;
			Иначе
				Если C_DOC_VER > "04" Тогда
					// два слеша
					НомерВходящегоДокумента = НомерВходящегоДокумента + "//" + HNUM2;	
				Иначе	
					// один слеш
					НомерВходящегоДокумента = НомерВходящегоДокумента + "/ " + HNUM2;	
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
		
		HFILL = ""; СтруктураПоказателейXML.Свойство("HFILL", HFILL);
		ДатаВходящегоДокумента = '00010101';
		Если ЗначениеЗаполнено(HFILL) Тогда
			HFILL = СокрЛП(HFILL);
			ДатаВходящегоДокумента = Дата(Сред(HFILL, 5, 4), Сред(HFILL, 3, 2), Сред(HFILL, 1, 2));
		КонецЕсли;
		
		Товары.Очистить();
		
		Для каждого СтрокаСумм Из ТаблицаСумм Цикл
			
			Если СтрокаСумм.База = 0 И СтрокаСумм.НДС = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаДок = Товары.Добавить();
			
			СтрокаДок.СтавкаНДС = СтрокаСумм.СтавкаНДС;
			СтрокаДок.Сумма     = СтрокаСумм.База; 
			СтрокаДок.СуммаНДС  = СтрокаСумм.НДС;
	
		КонецЦикла; 
		
		Тара = 0;
		Если C_DOC_SUB = "010" Тогда
			СтруктураПоказателейXML.Свойство("R02G11",  Тара);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Тара) И Число(Тара) <> 0 Тогда
			
			СуммаВозвратнойТары = СуммаВозвратнойТары + Число(Тара);
			
		КонецЕсли;
		
	КонецЕсли;  
	
	Если ЗаполнятьШапку ИЛИ ЗаполнятьКорректируемыйДокумент Тогда
		
		// для П2 дата и номер корректируемой налоговой накладной
		Если C_DOC_SUB = "012" Тогда
			HNUM  = ""; СтруктураПоказателейXML.Свойство("HPODNUM",  HNUM);  HNUM  = СокрЛП(HNUM);
			HNUM1 = ""; СтруктураПоказателейXML.Свойство("HPODNUM1", HNUM1); HNUM1 = СокрЛП(HNUM1); HNUM1 = ?(HNUM1 = "0", "", HNUM1);
			HNUM2 = ""; СтруктураПоказателейXML.Свойство("HPODNUM2", HNUM2); HNUM2 = СокрЛП(HNUM2);
			НомерКорректируемогоВходящегоДокумента = HNUM; 
			Если ЗначениеЗаполнено(HNUM1) Тогда
				НомерКорректируемогоВходящегоДокумента = НомерКорректируемогоВходящегоДокумента + "/" + HNUM1;
			КонецЕсли;
			Если ЗначениеЗаполнено(HNUM2) Тогда
				Если ЗначениеЗаполнено(HNUM1) Тогда
					Если C_DOC_VER > "04" Тогда
						// всего два слеша
						НомерКорректируемогоВходящегоДокумента = НомерКорректируемогоВходящегоДокумента + "/" + HNUM2;	
					Иначе	
						// всего один слеш
						НомерКорректируемогоВходящегоДокумента = НомерКорректируемогоВходящегоДокумента + HNUM2;	
					КонецЕсли;
				Иначе
					Если C_DOC_VER > "04" Тогда
						// два слеша
						НомерКорректируемогоВходящегоДокумента = НомерКорректируемогоВходящегоДокумента + "//" + HNUM2;	
					Иначе	
						// один слеш
						НомерКорректируемогоВходящегоДокумента = НомерКорректируемогоВходящегоДокумента + "/ " + HNUM2;	
					КонецЕсли;
					
				КонецЕсли;
			КонецЕсли;
			
			HFILL = ""; СтруктураПоказателейXML.Свойство("HPODFILL", HFILL);
			ДатаКорректируемогоВходящегоДокумента = '00010101';
			Если ЗначениеЗаполнено(HFILL) Тогда
				HFILL = СокрЛП(HFILL);
				ДатаКорректируемогоВходящегоДокумента = Дата(Сред(HFILL, 5, 4), Сред(HFILL, 3, 2), Сред(HFILL, 1, 2));
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
		
	Если ЗаполнятьТЧ Тогда
		
		Товары.Очистить();
		
		КэшПоискаУКТВЭД = Неопределено;
		КэшПоискаЕдиИзм = Неопределено;
		
		СоответствиеСтавокНДС = Новый Соответствие;
		СоответствиеСтавокНДС.Вставить("20", Перечисления.СтавкиНДС.НДС20);
		СоответствиеСтавокНДС.Вставить("7", Перечисления.СтавкиНДС.НДС7);
		СоответствиеСтавокНДС.Вставить("14", Перечисления.СтавкиНДС.НДС14);
		СоответствиеСтавокНДС.Вставить("901", Перечисления.СтавкиНДС.НДС0);
		СоответствиеСтавокНДС.Вставить("902", Перечисления.СтавкиНДС.НДС0);
		СоответствиеСтавокНДС.Вставить("903", Перечисления.СтавкиНДС.БезНДС);
		
		Для каждого СтрокаФайла Из СтруктураПоказателейXML.ТабличнаяЧасть Цикл

			СтруктураИсходныхДанных = Новый Структура("G001,G21,G22,G3S,G5,G6,G7,G8,G008,G009,G010,G11_10");
			ЗаполнитьЗначенияСвойств(СтруктураИсходныхДанных, СтрокаФайла);
			
			НоваяСтрока = Товары.Добавить();
			
			НоваяСтрока.НаименованиеТовара = СтруктураИсходныхДанных.G3S;
			
			Если ЗначениеЗаполнено(СтруктураИсходныхДанных.G5) Тогда
				НоваяСтрока.Количество = Число(СтруктураИсходныхДанных.G5);
			ИначеЕсли ЗначениеЗаполнено(СтруктураИсходныхДанных.G8) Тогда
				НоваяСтрока.Количество = Число(СтруктураИсходныхДанных.G8);
			КонецЕсли;

			Если ЗначениеЗаполнено(СтруктураИсходныхДанных.G6) Тогда
				НоваяСтрока.Цена = Число(СтруктураИсходныхДанных.G6);
			ИначеЕсли ЗначениеЗаполнено(СтруктураИсходныхДанных.G7) Тогда
				НоваяСтрока.Цена = Число(СтруктураИсходныхДанных.G7);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтруктураИсходныхДанных.G008) Тогда
				НоваяСтрока.СтавкаНДС = СоответствиеСтавокНДС[СтруктураИсходныхДанных.G008];
			КонецЕсли; 

			Если ЗначениеЗаполнено(СтруктураИсходныхДанных.G010) Тогда
				НоваяСтрока.Сумма = Число(СтруктураИсходныхДанных.G010);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтруктураИсходныхДанных.G11_10) Тогда
				НоваяСтрока.СуммаНДС = Число(СтруктураИсходныхДанных.G11_10);
			КонецЕсли;
			
			НоваяСтрока.СуммаВзаиморасчетов = НоваяСтрока.Сумма + НоваяСтрока.СуммаНДС;
			
			НоваяСтрока.КодУКТВЭД = ПолучитьЭлементКлассификатораУКТВЭД(СтрокаФайла, КэшПоискаУКТВЭД);
			НоваяСтрока.ЕдиницаИзмерения = ПолучитьЭлементКлассификатораЕдиницИзмерения(СтрокаФайла, КэшПоискаЕдиИзм);
			
		КонецЦикла;
		
		СуммаДокумента 	  = Товары.Итог("СуммаВзаиморасчетов");
		СуммаНДСДокумента = Товары.Итог("СуммаНДС");
		
		//если итоги не совпадают с данными раздела А, распределим расхождение по строкам
		ТаблицаПогрешностей = Товары.Выгрузить(,"НомерСтроки, СтавкаНДС, СуммаНДС");
		ТаблицаПогрешностей.Колонки.Добавить("СуммаНДСМинус", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
		
		Для каждого СтрокаПогрешностей Из ТаблицаПогрешностей Цикл
			
			Если СтрокаПогрешностей.СуммаНДС < 0 Тогда
				СтрокаПогрешностей.СуммаНДСМинус = СтрокаПогрешностей.СуммаНДС;
				СтрокаПогрешностей.СуммаНДС = 0;
			КонецЕсли;
			
		КонецЦикла;
		
		ИтогиПогрешностей = ТаблицаПогрешностей.Скопировать();
		ИтогиПогрешностей.Свернуть("СтавкаНДС", "СуммаНДС, СуммаНДСМинус");
		Для каждого СтрокаИтогов Из ИтогиПогрешностей Цикл
			
			СтрокаРазделаА = ТаблицаСумм.Найти(СтрокаИтогов.СтавкаНДС, "СтавкаНДС");
			Если СтрокаРазделаА = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			РасхождениеПоСтавке = СтрокаРазделаА.НДС - СтрокаИтогов.СуммаНДС - СтрокаИтогов.СуммаНДСМинус;
			
			Если РасхождениеПоСтавке = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Если СтрокаИтогов.СуммаНДС = 0 ИЛИ РасхождениеПоСтавке < 0 И СтрокаИтогов.СуммаНДСМинус <> 0 Тогда
				КолонкаПогрешности = "СуммаНДСМинус";
			Иначе
				КолонкаПогрешности = "СуммаНДС";
			КонецЕсли;
			
			ТаблицаПогрешностейПоСтавке = ТаблицаПогрешностей.Скопировать(Новый Структура("СтавкаНДС", СтрокаИтогов.СтавкаНДС), "НомерСтроки, " + КолонкаПогрешности);
			МассивКоэф = ТаблицаПогрешностейПоСтавке.ВыгрузитьКолонку(КолонкаПогрешности);  
			МассивПогрешностей = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(РасхождениеПоСтавке, МассивКоэф, 2);
			
			Для ж = 0 По МассивПогрешностей.ВГраница() Цикл
				
				СтрокаТоваров = Товары[ТаблицаПогрешностейПоСтавке[ж].НомерСтроки -1];
				СтрокаТоваров.СуммаНДС = СтрокаТоваров.СуммаНДС + МассивПогрешностей[ж];
				
			КонецЦикла;
			
		КонецЦикла;
		
		Если КэшПоискаУКТВЭД <> Неопределено Тогда
			
			НовыеКодыУКТВЭД = КэшПоискаУКТВЭД.НайтиСтроки(Новый Структура("НовыйЭлемент", Истина));
			
			ПолныйКлассификаторТоваров = Неопределено;
			ПолныйКлассификаторУслуг = Неопределено;
			
			Для каждого СтрокаКэша ИЗ НовыеКодыУКТВЭД Цикл
				
				Если СтрокаКэша.Ссылка.Вид = Перечисления.ВидыКодовДляНалоговойНакладной.КодУслуги Тогда
					
					Если ПолныйКлассификаторУслуг = Неопределено Тогда
						Макет = НормативносправочныйИнформационныйСервисСервер.ПолучитьМакет("КлассификаторДКПП", Справочники.КлассификаторУКТВЭД.ПолучитьМакет("КлассификаторДКПП"));
						ПолныйКлассификаторУслуг = Новый ТаблицаЗначений;
						ПолныйКлассификаторУслуг.Колонки.Добавить("Код", Новый ОписаниеТипов("Строка"));
						ПолныйКлассификаторУслуг.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка"));
						ТекущаяСтрока = 7;
						Пока ТекущаяСтрока < Макет.ВысотаТаблицы Цикл
							
							Код = Макет.Область(ТекущаяСтрока,1).Текст;
							Наименование = Макет.Область(ТекущаяСтрока,2).Текст;
							ТекущаяСтрока = ТекущаяСтрока + 1;
							Если НЕ ЗначениеЗаполнено(Код) и НЕ ЗначениеЗаполнено(Наименование) Тогда 
								Продолжить; 
							КонецЕсли; 
							НоваяСтрока = ПолныйКлассификаторУслуг.Добавить();
							НоваяСтрока.Код = СокрЛП(Код);
							НоваяСтрока.Наименование = СокрЛП(Наименование);
							
						КонецЦикла;
					КонецЕсли;
					
					СтрокаПолногоКлассификатора = ПолныйКлассификаторУслуг.Найти(СокрЛП(СтрокаКэша.Ссылка.Код), "Код");
					Если СтрокаПолногоКлассификатора <> Неопределено Тогда 
						СправочникОбъект = СтрокаКэша.Ссылка.ПолучитьОбъект();
						СправочникОбъект.Наименование       	 = СокрЛП(СправочникОбъект.Код) + "/"+ СтрокаПолногоКлассификатора.Наименование;
						СправочникОбъект.НаименованиеПолное      = СтрокаПолногоКлассификатора.Наименование;
						СправочникОбъект.Записать();
					КонецЕсли;

				Иначе
					
					Если ПолныйКлассификаторТоваров = Неопределено Тогда
						Макет = НормативносправочныйИнформационныйСервисСервер.ПолучитьМакет("КлассификаторУКТВЭД", Справочники.КлассификаторУКТВЭД.ПолучитьМакет("КлассификаторУКТВЭД"));
						ПолныйКлассификаторТоваров = Новый ТаблицаЗначений;
						ПолныйКлассификаторТоваров.Колонки.Добавить("Код", Новый ОписаниеТипов("Строка"));
						ПолныйКлассификаторТоваров.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка"));
						ПолныйКлассификаторТоваров.Колонки.Добавить("Уровень", Новый ОписаниеТипов("Число"));
						ПолныйКлассификаторТоваров.Колонки.Добавить("Печать", Новый ОписаниеТипов("Строка"));
						
						ТекущаяСтрока = 7;
						Пока ТекущаяСтрока < Макет.ВысотаТаблицы Цикл
							
							Код = Макет.Область(ТекущаяСтрока,1).Текст;
							Наименование = Макет.Область(ТекущаяСтрока,2).Текст;
							Печать = Макет.Область(ТекущаяСтрока,3).Текст;
							ТекущаяСтрока = ТекущаяСтрока + 1;
							Если НЕ ЗначениеЗаполнено(Код) и НЕ ЗначениеЗаполнено(Наименование) Тогда 
								Продолжить; 
							КонецЕсли; 
							НоваяСтрока = ПолныйКлассификаторТоваров.Добавить();
							НоваяСтрока.Код = СокрЛП(Код);
							НоваяСтрока.Наименование = СокрЛП(Наименование);
							НоваяСтрока.Уровень = ТекущаяСтрока;
							НоваяСтрока.Печать = СокрЛП(Печать);
							
						КонецЦикла;
						
					КонецЕсли;
					
					СтрокаПолногоКлассификатора = ПолныйКлассификаторТоваров.Найти(СокрЛП(СтрокаКэша.Ссылка.Код), "Код");
					Если СтрокаПолногоКлассификатора <> Неопределено Тогда 
						
						ПолноеНаименование = СобратьПолноеНаименование(СтрокаПолногоКлассификатора.Уровень, Макет);
						
						СправочникОбъект = СтрокаКэша.Ссылка.ПолучитьОбъект();
						СправочникОбъект.НаименованиеПолное      = ПолноеНаименование;
						СправочникОбъект.Наименование       	 = СокрЛП(СправочникОбъект.Код) + ?(СправочникОбъект.Вид = Перечисления.ВидыКодовДляНалоговойНакладной.КодТовараИмпортированного," X","") 
																	+ "/"+ СтрЗаменить(СправочникОбъект.НаименованиеПолное,Символы.ПС,"");
						СправочникОбъект.ВыводитьПриПечатиЧека   = СтрокаПолногоКлассификатора.Печать = "Так";
						СправочникОбъект.Записать(); 
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Для каждого СтрокаТоваров ИЗ Товары Цикл
		
		СтрокаТоваров.СуммаВзаиморасчетов = СтрокаТоваров.Сумма + СтрокаТоваров.СуммаНДС;
		СтрокаТоваров.СтатьяДекларацииНДСНалоговыйКредит = ОпределитьСтатьюНалоговойДекларации(СтрокаТоваров);
		
	КонецЦикла;
	
КонецПроцедуры

Функция СобратьПолноеНаименование(Знач НомерСтрокиТарифа, Макет)

	СтруктураОписания = ЗаполнитьСтруктуруТекстУровень(НомерСтрокиТарифа, Макет);
	
	ТекУровень = СтруктураОписания.Уровень;
	Если ТекУровень = 0 Тогда
		
		Возврат СтруктураОписания.Текст;
		
	Иначе
		
		Пока НомерСтрокиТарифа > 1 Цикл
			
			НомерСтрокиТарифа = НомерСтрокиТарифа - 1;
			
			ВерхнийУровень = ЗаполнитьСтруктуруТекстУровень(НомерСтрокиТарифа, Макет);
			Если ВерхнийУровень.Уровень >= текУровень Тогда
				Продолжить;
			КонецЕсли;			
			
			Если ВерхнийУровень.Уровень >= 0 Тогда
				
				ТекстВерхнегоУровня     = ВерхнийУровень.Текст + Символы.ПС;
				СтруктураОписания.Текст = ТекстВерхнегоУровня + СтруктураОписания.Текст;
				
			КонецЕсли;
			
			текУровень = ТекУровень - 1;
			
			Если ВерхнийУровень.Уровень = 0 Тогда
				Возврат СтруктураОписания.Текст;
			КонецЕсли;
			
		КонецЦикла;
		
		Возврат  СтруктураОписания.Текст;
		
	КонецЕсли;
	
КонецФункции 

Функция ЗаполнитьСтруктуруТекстУровень(НомерСтрокиТарифа, Макет)
	
	СтруктураОписания = Новый Структура("Текст, Уровень");
	
	ЗначениеТекСтроки = Макет.Область(НомерСтрокиТарифа, 2, НомерСтрокиТарифа, 2).Текст; 	
	
	ЗначениеТекСтроки = СокрЛ(ЗначениеТекСтроки);
	
	ТекУровень = УровеньКлассификатора(ЗначениеТекСтроки);
	
	СтруктураОписания.Уровень = ТекУровень;
	СтруктураОписания.Текст   = ЗначениеТекСтроки;

	Возврат СтруктураОписания;
	
КонецФункции

Функция УровеньКлассификатора(Строка)
	
	Уровень = 0;
	
	ДлинаСтроки = СтрДлина(Строка);
	Для Сч = 1 По ДлинаСтроки Цикл
		
		ТекСимв = Сред(Строка, Сч, 1);
		
		Если ТекСимв = "-" Тогда
			Уровень = Уровень + 1;
		ИначеЕсли  ТекСимв  = " " Тогда
			Продолжить;	
		Иначе
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Уровень;
	
КонецФункции 

Процедура ЗаполнитьКонтрагентаПоИНН(КонтрагентИНН)		
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
               |	Спр.Ссылка
               |ИЗ
               |	Справочник.Контрагенты КАК Спр
               |ГДЕ
               |	Спр.ИНН 		  = &КонтрагентИНН
               |
               |УПОРЯДОЧИТЬ ПО
               |	Спр.Код УБЫВ";
	
	Запрос.УстановитьПараметр("КонтрагентИНН", 			КонтрагентИНН);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Контрагент = Выборка.Ссылка;
		ДоговорКонтрагента = "";
		Сделка 			   = "";
		ДокументОснование  = "";
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьОрганизациюПоИНН(ОрганизацияИНН)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
               |	Рег.Организация КАК Ссылка
               |ИЗ
               |	РегистрСведений.КодыОрганизации.СрезПоследних(&Дата) КАК Рег
               |ГДЕ
               |	Рег.ИНН 		  = &ОрганизацияИНН
               |
               |УПОРЯДОЧИТЬ ПО
               |	Рег.Организация.Код УБЫВ";
	
	Запрос.УстановитьПараметр("ОрганизацияИНН", 			ОрганизацияИНН);
	Запрос.УстановитьПараметр("Дата", Дата);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Организация = Выборка.Ссылка;
		ДоговорКонтрагента = "";
		Сделка = "";
		ДокументОснование = ""
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьЭлементКлассификатораУКТВЭД(ИсходныеДанные, Кэш)
	
	СтруктураПоиска = Новый Структура("Код, Вид");
	Если Кэш = Неопределено Тогда
		Кэш = Новый ТаблицаЗначений; 
		Для каждого ПолеПоиска ИЗ СтруктураПоиска Цикл
			Кэш.Колонки.Добавить(ПолеПоиска.Ключ);            
		КонецЦикла;
		Кэш.Колонки.Добавить("Ссылка");
		Кэш.Колонки.Добавить("НовыйЭлемент", Новый ОписаниеТипов("Булево"));
	КонецЕсли;
	
	СтруктураИсходныхДанныхПоиска = Новый Структура("G4,G32,G322,G33");
	ЗаполнитьЗначенияСвойств(СтруктураИсходныхДанныхПоиска, ИсходныеДанные);

	Если ЗначениеЗаполнено(СтруктураИсходныхДанныхПоиска.G4) Тогда
		
		ИсходныйКодУКТВЭД = СокрЛП(СтруктураИсходныхДанныхПоиска.G4);
		КодУКТВЭД = "";
		Для ж = 1 По СтрДлина(ИсходныйКодУКТВЭД) Цикл
			
			КодУКТВЭД = КодУКТВЭД + Сред(ИсходныйКодУКТВЭД, ж, 1);
			Если ж = 4 ИЛИ ж = 6 ИЛИ ж = 8 Тогда
				КодУКТВЭД = КодУКТВЭД + " ";
			КонецЕсли;
			
		КонецЦикла;
		
		СтруктураПоиска.Код = КодУКТВЭД;
		
		Если ЗначениеЗаполнено(СтруктураИсходныхДанныхПоиска.G32) Тогда
			СтруктураПоиска.Вид = Перечисления.ВидыКодовДляНалоговойНакладной.КодТовараИмпортированного;
		ИначеЕсли ЗначениеЗаполнено(СтруктураИсходныхДанныхПоиска.G322) Тогда
			СтруктураПоиска.Вид = Перечисления.ВидыКодовДляНалоговойНакладной.КодСХПродукции;
		Иначе
			СтруктураПоиска.Вид = Перечисления.ВидыКодовДляНалоговойНакладной.КодТовара;
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(СтруктураИсходныхДанныхПоиска.G33) Тогда
		
		СтруктураПоиска.Код = СокрЛП(СтруктураИсходныхДанныхПоиска.G33);
		СтруктураПоиска.Вид = Перечисления.ВидыКодовДляНалоговойНакладной.КодУслуги;
		
	Иначе
		Возврат Неопределено;
	КонецЕсли;  
	
	НайденныеСтроки = Кэш.НайтиСтроки(СтруктураПоиска);
	Если НайденныеСтроки.Количество() Тогда
		Возврат НайденныеСтроки[0].Ссылка;
	КонецЕсли;

	НоваяЗаписьКэша = Кэш.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяЗаписьКэша, СтруктураПоиска);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КлассификаторУКТВЭД.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КлассификаторУКТВЭД КАК КлассификаторУКТВЭД
	|ГДЕ
	|	КлассификаторУКТВЭД.Код = &Код
	|	И КлассификаторУКТВЭД.Вид = &Вид
	|
	|УПОРЯДОЧИТЬ ПО
	|	КлассификаторУКТВЭД.ПометкаУдаления УБЫВ";
	Запрос.УстановитьПараметр("Код", СтруктураПоиска.Код);
	Запрос.УстановитьПараметр("Вид", СтруктураПоиска.Вид);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		НоваяЗаписьКэша.Ссылка = Выборка.Ссылка;
		
	Иначе
		
		СправочникОбъект = Справочники.КлассификаторУКТВЭД.СоздатьЭлемент();
		
		СправочникОбъект.Код                     = СтруктураПоиска.Код;
		СправочникОбъект.Вид                	 = СтруктураПоиска.Вид;
		СправочникОбъект.Наименование       	 = СокрЛП(СправочникОбъект.Код);
				
		СправочникОбъект.Записать();
		НоваяЗаписьКэша.Ссылка = СправочникОбъект.Ссылка;
		НоваяЗаписьКэша.НовыйЭлемент = Истина;
		
	КонецЕсли;

	Возврат НоваяЗаписьКэша.Ссылка;
	
КонецФункции

Функция ПолучитьЭлементКлассификатораЕдиницИзмерения(ИсходныеДанные, Кэш)
	
	СтруктураПоиска = Новый Структура("Код, Наименование");
	Если Кэш = Неопределено Тогда
		Кэш = Новый ТаблицаЗначений; 
		Для каждого ПолеПоиска ИЗ СтруктураПоиска Цикл
			Кэш.Колонки.Добавить(ПолеПоиска.Ключ);            
		КонецЦикла;
		Кэш.Колонки.Добавить("Ссылка");
		Кэш.Колонки.Добавить("НовыйЭлемент", Новый ОписаниеТипов("Булево"));
	КонецЕсли;
	
	СтруктураИсходныхДанныхПоиска = Новый Структура("G105_2S, G4S");
	ЗаполнитьЗначенияСвойств(СтруктураИсходныхДанныхПоиска, ИсходныеДанные);

	СтруктураПоиска.Код = СокрЛП(СтруктураИсходныхДанныхПоиска.G105_2S);
	СтруктураПоиска.Наименование = СокрЛП(СтруктураИсходныхДанныхПоиска.G4S);
	
	Если НЕ ЗначениеЗаполнено(СтруктураПоиска.Код) И НЕ ЗначениеЗаполнено(СтруктураПоиска.Наименование) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НайденныеСтроки = Кэш.НайтиСтроки(СтруктураПоиска);
	Если НайденныеСтроки.Количество() Тогда
		Возврат НайденныеСтроки[0].Ссылка;
	КонецЕсли;

	НоваяЗаписьКэша = Кэш.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяЗаписьКэша, СтруктураПоиска);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КлассификаторЕдиницИзмерения.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
	|ГДЕ
	|	КлассификаторЕдиницИзмерения.Код = &Код
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	КлассификаторЕдиницИзмерения.Ссылка
	|ИЗ
	|	Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
	|ГДЕ
	|	&Код = """"
	|	И КлассификаторЕдиницИзмерения.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Код", СтруктураПоиска.Код);
	Запрос.УстановитьПараметр("Наименование", СтруктураПоиска.Наименование);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		НоваяЗаписьКэша.Ссылка = Выборка.Ссылка;
		
	Иначе
		
		СправочникОбъект = Справочники.КлассификаторЕдиницИзмерения.СоздатьЭлемент();
		
		СправочникОбъект.Код                     = СтруктураПоиска.Код;
		СправочникОбъект.Наименование       	 = СтруктураПоиска.Наименование;
		СправочникОбъект.НаименованиеПолное      = СправочникОбъект.Наименование;
				
		СправочникОбъект.Записать();
		НоваяЗаписьКэша.Ссылка = СправочникОбъект.Ссылка;
		НоваяЗаписьКэша.НовыйЭлемент = Истина;
		
	КонецЕсли;

	Возврат НоваяЗаписьКэша.Ссылка;
	
КонецФункции
 
/////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Процедура определяет параметры регл. учетной политики
//
Процедура ПодготовитьПараметрыУчетнойПолитикиРегл(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	// Прежде всего, проверим заполнение реквизита Организация в шапке документа
	СтруктураОбязательныхПолей = Новый Структура("Организация");
	// Теперь позовем общую процедуру проверки
	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	// Организация не заполнена, получать учетную политику нет смысла
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	УчетнаяПолитикаНУ = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(КонецМесяца(Дата), Отказ, Организация, "Нал");
		
	СтруктураШапкиДокумента.Вставить("ЕстьНДС"                        , УчетнаяПолитикаНУ.ЕстьНДС);
	
КонецПроцедуры // ПодготовитьПараметрыУчетнойПолитикиРегл()

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверяется также правильность заполнения реквизитов ссылочных полей документа.
// Проверка выполняется по объекту и по выборке из результата запроса по шапке.
//
// Параметры: 
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении,
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	Если  НЕ СтруктураШапкиДокумента.ЕстьНДС Тогда
		// по фирме не ведется учет НДС, проводить документ не имеет смысла
		ОбщегоНазначения.ОшибкаПриПроведении(НСтр("ru='Фирма не является плательщиком НДС!';uk='Фірма не є платником ПДВ!'"), Отказ, Заголовок);
	КонецЕсли;
	
	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = 
	Новый Структура("ВидОперации, Организация, Контрагент, ДоговорКонтрагента, СчетНДС, ДатаВходящегоДокумента");
	Если ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.ПогашениеНалоговогоВекселя Тогда
		СтруктураОбязательныхПолей.Вставить("СчетУчетаВексель");	
	Иначе
		СтруктураОбязательныхПолей.Вставить("СчетУчетаНДС");	
	КонецЕсли;
	
	Если Дата >= '2015-07-01' Тогда
		
		СтруктураОбязательныхПолей.Вставить("СчетНДСУсловнаяПродажа");	
		
		Если 	((ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РасчетКорректировкиВозврат) 
			 ИЛИ (ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РасчетКорректировкиКорректировка))	Тогда
			СтруктураОбязательныхПолей.Вставить("ДатаКорректируемогоВходящегоДокумента");		 
		КонецЕсли;
		
	КонецЕсли;		 
	
	Если 	ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам
		ИЛИ ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам 
		ИЛИ (ДоговорКонтрагента.ВестиПоДокументамРасчетовСКонтрагентомРегл И НЕ ДоговорКонтрагента.СложныйНалоговыйУчет) Тогда
		                        
		СтруктураОбязательныхПолей.Вставить("Сделка");
		
	КонецЕсли;
	
	Если ВключаетсяВУточняющийРасчет Тогда
		СтруктураОбязательныхПолей.Вставить("УточняемыйПериод");
	КонецЕсли;
	
	Если    ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.ИсправлениеОшибки 
		ИЛИ ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.ВосстановлениеНалоговогоКредита Тогда
		СтруктураОбязательныхПолей.Вставить("СчетУчетаКорректировкиНДСКредит");
		Если СтруктураОбязательныхПолей.Свойство("Сделка") Тогда
			СтруктураОбязательныхПолей.Удалить("Сделка");
		КонецЕсли;
	КонецЕсли;
	
	// Теперь позовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	Если ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.ВосстановлениеНалоговогоКредита 
		И НЕ (СуммаДокумента = 0 И СуммаНДСДокумента = 0) Тогда
	
		ОбщегоНазначения.ОшибкаПриПроведении(НСтр("ru='Для данного вида операции сумма документа и сумма НДС должна быть нулевой!';uk='Для даного виду операції сума документа та ПДВ повинна дорівнювати нулю!'"), Отказ, Заголовок);
	
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Выгружает результат запроса в табличную часть, добавляет ей необходимые колонки для проведения.
//
// Параметры: 
//  РезультатЗапросаПоТоварам - результат запроса по табличной части "Товары",
//  СтруктураШапкиДокумента   - выборка по результату запроса по шапке документа.
//
// Возвращаемое значение:
//  Сформированная таблица значений.
//
Функция ПодготовитьТаблицуТоваров(РезультатЗапросаПоТоварам, СтруктураШапкиДокумента)

	ТаблицаТоваров = РезультатЗапросаПоТоварам.Выгрузить();
	
	ТаблицаТоваров.Колонки.Добавить("ПроводкиСуммаНДС",     ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаТоваров.Колонки.Добавить("ВидДеятельностиНДС",   Новый ОписаниеТипов("ПеречислениеСсылка.ВидыДеятельностиНДС"));
	ТаблицаТоваров.Колонки.Добавить("СуммаНДСВал",     		ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаТоваров.Колонки.Добавить("СуммаВал",     		ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаТоваров.Колонки.Добавить("СуммаНДСПропорционально", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаТоваров.Колонки.Добавить("СуммаНДСУсловнойПродажи", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	
	Для каждого СтрокаТаблицы из ТаблицаТоваров Цикл
		
		// движения по регистру ОжидаемыйИПодтвержденныйНДСПриобретений могут быть только от резидентов
		// и только в гривне.
		СтрокаТаблицы.СуммаНДСВал = СтрокаТаблицы.СуммаНДС;
		СтрокаТаблицы.СуммаВал 	  = СтрокаТаблицы.Сумма;
		
		// Сумма налогового кредита 
		СтрокаТаблицы.ПроводкиСуммаНДС = СтрокаТаблицы.СуммаНДС;
		// Обнулим эту сумму, если отсутствует право на налоговый кредит	
		Если  НЕ (СтрокаТаблицы.ДляХозяйственнойДеятельности И СтрокаТаблицы.ДляОперацийОблагаемыхНДС) Тогда
			СтрокаТаблицы.ПроводкиСуммаНДС = 0;
		КонецЕсли;
		
		Если СтрокаТаблицы.ПропорциональныйНДС Тогда
		    СтрокаТаблицы.ВидДеятельностиНДС = Перечисления.ВидыДеятельностиНДС.ПропорциональноОблагаемая;	
			Если СтрокаТаблицы.ДляОперацийОблагаемыхНДС Тогда
				СтрокаТаблицы.СуммаНДСПропорционально =  СтрокаТаблицы.СуммаНДСВал
			КонецЕсли;
		ИначеЕсли СтрокаТаблицы.ДляОперацийОблагаемыхНДС Тогда
			СтрокаТаблицы.ВидДеятельностиНДС = Перечисления.ВидыДеятельностиНДС.Облагаемая;	
		Иначе	
			СтрокаТаблицы.ВидДеятельностиНДС = Перечисления.ВидыДеятельностиНДС.Необлагаемая;				
		КонецЕсли;
		
		// с 2015 года, если дата документ и дата вх. нал. документа после 07.2015 - на налоговый кредит относятся все суммы вх. НДС, однако
		// если приобретение осуществляется для не облагаемых/не хоз. операций, необходимо оформить условную продажу
		Если Дата >= '2015-07-01' Тогда
			
			Если СтрокаТаблицы.ВидДеятельностиНДС = Перечисления.ВидыДеятельностиНДС.Необлагаемая Тогда
			
				СтрокаТаблицы.СуммаНДСУсловнойПродажи = СтрокаТаблицы.СуммаНДС;	
				
			ИначеЕсли  СтрокаТаблицы.ВидДеятельностиНДС = Перечисления.ВидыДеятельностиНДС.ПропорциональноОблагаемая 
				     И НЕ СтрокаТаблицы.ДляОперацийОблагаемыхНДС Тогда
					 
				СтрокаТаблицы.СуммаНДСУсловнойПродажи = СтрокаТаблицы.СуммаНДС;	
				
			КонецЕсли;
		
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаТоваров;

КонецФункции // ПодготовитьТаблицуТоваров()

// Проверяет правильность заполнения строк табличной части "Товары".
//
// Параметры:
// Параметры: 
//  ТаблицаПоТоварам        - таблица значений, содержащая данные для проведения и проверки ТЧ Товары
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении.
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиТовары(ТаблицаПоТоварам, СтруктураШапкиДокумента, Отказ, Заголовок)

	ИмяТабличнойЧасти = "Товары";

	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура("СтавкаНДС,СтатьяДекларацииНДСНалоговыйКредит");
	
	// Теперь позовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, ИмяТабличнойЧасти, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	// проверим допустимость указания пропорционального ндс
	Если Не Отказ Тогда
		
		Для каждого Строка Из Товары Цикл
				
			Если  Строка.ПропорциональныйНДС Тогда
				
				Если НЕ Строка.СтавкаНДС = Перечисления.СтавкиНДС.НДС20
				   И НЕ Строка.СтавкаНДС = Перечисления.СтавкиНДС.НДС14
				   И НЕ Строка.СтавкаНДС = Перечисления.СтавкиНДС.НДС7	
				   И НЕ Строка.СтавкаНДС = Перечисления.СтавкиНДС.НДС0  
				   И (Строка.СтатьяДекларацииНДСНалоговыйКредит = Справочники.СтатьиНалоговыхДеклараций.НДС_НКПропорционально ИЛИ
				      Строка.СтатьяДекларацииНДСНалоговыйКредит.ПринадлежитЭлементу(Справочники.СтатьиНалоговыхДеклараций.НДС_НКПропорционально)) Тогда
				
					СтрокаСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='В строке ""%1"" указан признак пропорционального НДС для ставки НДС отличной от 20%(0%)! Статья декларации НДС(н/к) в этом случае не должна входить в группу ""%2""!.';uk='У рядку ""%1"" зазначена ознака пропорційного ПДВ для ставки ПДВ відмінної від 20%(0%)! Стаття декларації ПДВ(п/к) у цьому випадку не повинна входити в групу ""%2""!'"), Строка.НомерСтроки, Справочники.СтатьиНалоговыхДеклараций.НДС_НКПропорционально);
					ОбщегоНазначения.ОшибкаПриПроведении(СтрокаСообщения, Отказ, Заголовок);				
					
				ИначеЕсли НЕ Строка.ДляХозяйственнойДеятельности Тогда
					
					СтрокаСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='В строке ""%1"" указан признак пропорционального НДС! В этом случае должен быть установлен признак использования в хозяйственной деятельности!.';uk='У рядку ""%1"" зазначена ознака пропорційного ПДВ! У цьому випадку повинна бути встановлена ознака використання в господарській діяльності!'"), Строка.НомерСтроки);
					ОбщегоНазначения.ОшибкаПриПроведении(СтрокаСообщения, Отказ, Заголовок);				
					
				КонецЕсли;			
				
			КонецЕсли;	
			
		КонецЦикла; 
		
	КонецЕсли;

КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиТовары()

// По результату запроса по шапке документа формируем движения по регистрам.
//
// Параметры: 
//  СтруктураШапкиДокумента   - выборка из результата запроса по шапке документа,
//  ТаблицаПоТоварам          - таблица значений, содержащая данные для проведения и проверки ТЧ Товары
//  Отказ                     - флаг отказа в проведении,
//  Заголовок                 - строка, заголовок сообщения об ошибке проведения.
//
Процедура ДвиженияПоРегистрам(СтруктураШапкиДокумента, ТаблицаПоТоварам, Отказ, Заголовок);
	
	// Проводки по бухгалтерскому учету НДС 
	ПроводкиБУ = Движения.Хозрасчетный;

	// ТОВАРЫ
	ТаблицаДвижений = ТаблицаПоТоварам.Скопировать();
	//ТаблицаДвижений.Свернуть("СчетУчетаНДС","ПроводкиСуммаНДС");
	ТаблицаДвижений.Свернуть("","ПроводкиСуммаНДС,СуммаНДСУсловнойПродажи");

	Корректировка = ((ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РасчетКорректировкиВозврат) 
			     ИЛИ (ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РасчетКорректировкиКорректировка));
	
	СодержаниеПроводки = "НДС: налоговый кредит: ";
	Если 	 ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.НалоговаяНакладная Тогда
		СодержаниеПроводки = СодержаниеПроводки+ "налоговая накладная";
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.ТоварныйЧек Тогда 
		СодержаниеПроводки = СодержаниеПроводки+ "подтверждение (товарный чек)";
	ИначеЕсли  ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РасчетКорректировкиВозврат Тогда
		СодержаниеПроводки = "НДС: налоговые обязательства: расчет корректировки (возврат)";       	
	ИначеЕсли  ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РасчетКорректировкиКорректировка Тогда
		СодержаниеПроводки = "НДС: налоговые обязательства: расчет корректировки (изменение суммы компенсации)";       
	ИначеЕсли  ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РаботыОтНерезидентаПрошлогоПериода Тогда
		СодержаниеПроводки = СодержаниеПроводки+ "работы от нерезидента";
	ИначеЕсли  ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.BeксeльПpoшлoгoПepиoдa Тогда		
		СодержаниеПроводки = СодержаниеПроводки+ "вексель, погашенный в прошлом периоде";
	ИначеЕсли  ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.ИсправлениеОшибки Тогда		
	    Если СтруктураШапкиДокумента.ВключаетсяВУточняющийРасчет = Ложь Тогда
			СодержаниеПроводки = СодержаниеПроводки+ НСтр("ru='исправление ошибки в текущем периоде';uk='виправлення помилки у поточному періоді'");
		Иначе
			СодержаниеПроводки = СодержаниеПроводки+ "корректировка через уточняющий расчет";			
		КонецЕсли;
	ИначеЕсли  ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.ВосстановлениеНалоговогоКредита Тогда		
	    Если СтруктураШапкиДокумента.ВключаетсяВУточняющийРасчет = Ложь Тогда
			СодержаниеПроводки = СодержаниеПроводки+ НСтр("ru='восстановление налогового кредита в текущем периоде';uk='відновлення податкового кредиту поточному періоді'");
		Иначе
			СодержаниеПроводки = СодержаниеПроводки+ НСтр("ru='восстановление налогового кредита через уточняющий расчет';uk='відновлення податкового кредиту через уточнюючий розрахункок'");			
		КонецЕсли;
	КонецЕсли;		
	
	Для Каждого СтрокаТаблицы Из ТаблицаДвижений Цикл
		
		Если    СтрокаТаблицы.ПроводкиСуммаНДС <> 0 Тогда
			
			Проводка = ПроводкиБУ.Добавить();

			Проводка.Период                     = СтруктураШапкиДокумента.Дата;
			Проводка.Активность                 = Истина;
			Проводка.Организация                = СтруктураШапкиДокумента.Организация;
			Проводка.Сумма                      = СтрокаТаблицы.ПроводкиСуммаНДС;
			Проводка.Содержание                 = СодержаниеПроводки;
			Проводка.НомерЖурнала               = "";

				
			Если ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.ПогашениеНалоговогоВекселя Тогда
					
				Проводка.СчетДт                     = СтруктураШапкиДокумента.СчетУчетаВексель;
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, ВексельСубконто1);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, ВексельСубконто2);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, ВексельСубконто3);

			
				Проводка.СчетКт                     = СтруктураШапкиДокумента.СчетНДС;
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СубконтоДт1);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, СубконтоДт2);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, СубконтоДт3);
					
			Иначе	
					
				Проводка.СчетДт                     = СтруктураШапкиДокумента.СчетНДС;
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СубконтоДт1);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, СубконтоДт2);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, СубконтоДт3);

				Если    ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.ИсправлениеОшибки
					ИЛИ ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.ВосстановлениеНалоговогоКредита  Тогда
					
					Проводка.СчетКт= СтруктураШапкиДокумента.СчетУчетаКорректировкиНДСКредит;
					
				Иначе
				
					Проводка.СчетКт                     = СтруктураШапкиДокумента.СчетУчетаНДС;
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Контрагенты", СтруктураШапкиДокумента.Контрагент);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Договоры"   , СтруктураШапкиДокумента.ДоговорКонтрагента);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "ДокументыРасчетовСКонтрагентами", ОпределитьСделкуЛокально());
				
				КонецЕсли;
					
			КонецЕсли;	
					
		КонецЕсли;

	КонецЦикла;
	
	ДвиженияПоРегиструОжидаемыйИПодтвержденныйНДСПриобретений(СтруктураШапкиДокумента, ТаблицаПоТоварам,  Отказ, Заголовок);
	
	ДвиженияПоРегиструНДСНалоговыйКредит( СтруктураШапкиДокумента, ТаблицаПоТоварам,  Отказ, Заголовок);
	
	// с 2015 года, если дата документ и дата вх. нал. документа после 07.2015 - на налоговый кредит относятся все суммы вх. НДС, однако
	// если приобретение осуществляется для не облагаемых/не хоз. операций, необходимо оформить условную продажу
	Если    (НЕ Корректировка И ДатаВходящегоДокумента 				  >= '2015-07-01' И Дата >= '2015-07-01')
		ИЛИ (   Корректировка И ДатаКорректируемогоВходящегоДокумента >= '2015-07-01' И Дата >= '2015-07-01') Тогда
		
		Для Каждого СтрокаТаблицы Из ТаблицаДвижений Цикл
			
			Если    СтрокаТаблицы.СуммаНДСУсловнойПродажи <> 0 Тогда
				
				Проводка = ПроводкиБУ.Добавить();

				Проводка.Период                     = СтруктураШапкиДокумента.Дата;
				Проводка.Активность                 = Истина;
				Проводка.Организация                = СтруктураШапкиДокумента.Организация;
				Проводка.Сумма                      = СтрокаТаблицы.СуммаНДСУсловнойПродажи;
				Проводка.Содержание                 = НСтр("ru='Налоговый кредит по операциям не обл. НДС после 07.2015';uk='Податковий кредит за операціями не опод. ПДВ після 07.2015'", Локализация.КодЯзыкаИнформационнойБазы());
				Проводка.НомерЖурнала               = "";

					
				Проводка.СчетДт                     = СтруктураШапкиДокумента.СчетНДС;
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СубконтоДт1);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, СубконтоДт2);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, СубконтоДт3);

				Проводка.СчетКт= СтруктураШапкиДокумента.СчетНДСУсловнаяПродажа;
					
			КонецЕсли;

		КонецЦикла;
		
		ДвиженияПоРегиструОжидаемыйИПодтвержденныйНДСПродаж(СтруктураШапкиДокумента, ТаблицаПоТоварам,  Отказ, Заголовок);
	
	КонецЕсли;

КонецПроцедуры // ДвиженияПоРегистрам()

Процедура ДвиженияПоРегиструОжидаемыйИПодтвержденныйНДСПриобретений(СтруктураШапкиДокумента, ТаблицаПоТоварам,  Отказ, Заголовок)

	Если  ВидОперации <> Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.НалоговаяНакладная 
		И ВидОперации <> Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.ТоварныйЧек 
		И ВидОперации <> Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РасчетКорректировкиВозврат
		И ВидОперации <> Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РасчетКорректировкиКорректировка Тогда
		
		// В этом случае движения по регистру НДСПокупок этом документом не формируются
		Возврат
		
	КонецЕсли;
	
	НаборДвижений = Движения.ОжидаемыйИПодтвержденныйНДСПриобретений;
	
	// Получим таблицу значений, совпадающую со струкутрой набора записей регистра.
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
	
	ТаблицаДвиженийОплата 	  = ТаблицаДвижений.Скопировать();
	ТаблицаДвиженийТара 	  = ТаблицаДвижений.Скопировать();
	
	// ТОВАРЫ
	ТаблицаКопия = ТаблицаПоТоварам.Скопировать();                                                                                           
	ТаблицаКопия.Свернуть("СтавкаНДС,ДляХозяйственнойДеятельности,ВидДеятельностиНДС,ВозвратнаяТара,Амортизируется", "СуммаВал, СуммаНДСВал, СуммаНДСПропорционально");
	
	ТаблицаКопия.Колонки.СуммаВал.Имя    = "БазаНДС";
	ТаблицаКопия.Колонки.СуммаНДСВал.Имя = "СуммаНДС";
	
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаКопия, ТаблицаДвижений);
	
	ТаблицаДвижений.ЗаполнитьЗначения(Организация       , "Организация");
	ТаблицаДвижений.ЗаполнитьЗначения(ДоговорКонтрагента, "ДоговорКонтрагента");
	ТаблицаДвижений.ЗаполнитьЗначения(ОпределитьСделкуЛокально(), "Сделка");
	
	Если ВидОперации =  Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РасчетКорректировкиВозврат Тогда
		ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПриобретений.Возврат, "СобытиеНДС");
		
		ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.КодыОперацийОжидаемыйИПодтвержденныйНДСПриобретений.КорректировкаНалоговыйДокумент, "КодОперации");
		
		// Инвертируем суммы
		Для Каждого Строка Из ТаблицаДвижений Цикл
			Строка.БазаНДС	   = -Строка.БазаНДС;
			Строка.СуммаНДС    = -Строка.СуммаНДС;
			Строка.СуммаНДСПропорционально = -Строка.СуммаНДСПропорционально;
		КонецЦикла;
		
	Иначе
		ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПриобретений.Поступление, "СобытиеНДС");
		ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.КодыОперацийОжидаемыйИПодтвержденныйНДСПриобретений.ПодтвержденныйНДС,  "КодОперации");
	КонецЕсли;		
	
	// ТАРА
	Если     СтруктураШапкиДокумента.СуммаВозвратнойТары <> 0 
		И НЕ ВидОперации =  Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РасчетКорректировкиВозврат 
		И НЕ ВидОперации =  Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РасчетКорректировкиКорректировка Тогда
		
		СтрокаДвиженийПоТаре = ТаблицаДвиженийТара.Добавить();
		СтрокаДвиженийПоТаре.СтавкаНДС 						= Перечисления.СтавкиНДС.НеНДС;
		СтрокаДвиженийПоТаре.ДляХозяйственнойДеятельности 	= Истина;
		СтрокаДвиженийПоТаре.ВидДеятельностиНДС 			= Перечисления.ВидыДеятельностиНДС.Необлагаемая;
		СтрокаДвиженийПоТаре.ВозвратнаяТара 				= Истина;
		СтрокаДвиженийПоТаре.БазаНДС 						= СтруктураШапкиДокумента.СуммаВозвратнойТары;
		
		ТаблицаДвиженийТара.ЗаполнитьЗначения(Организация       , "Организация");
		ТаблицаДвиженийТара.ЗаполнитьЗначения(ОпределитьСделкуЛокально(), "Сделка");
		ТаблицаДвиженийТара.ЗаполнитьЗначения(ДоговорКонтрагента, "ДоговорКонтрагента");
		ТаблицаДвиженийТара.ЗаполнитьЗначения(Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПриобретений.Поступление, "СобытиеНДС");
		ТаблицаДвиженийТара.ЗаполнитьЗначения(Перечисления.КодыОперацийОжидаемыйИПодтвержденныйНДСПриобретений.ПодтвержденныйНДС,  "КодОперации");
		
	КонецЕсли; 
	
	Если НЕ Отказ И ТаблицаДвижений.Количество() > 0 Тогда
		
		НаборДвижений.мПериод          = Дата;
		НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;
		
		Движения.ОжидаемыйИПодтвержденныйНДСПриобретений.ВыполнитьРасход();
	
	КонецЕсли;

	Если НЕ Отказ И ТаблицаДвиженийТара.Количество() > 0 Тогда
		
		НаборДвижений.мПериод          = Дата;
		НаборДвижений.мТаблицаДвижений = ТаблицаДвиженийТара;
		
		Движения.ОжидаемыйИПодтвержденныйНДСПриобретений.ВыполнитьРасход();
		
	КонецЕсли;
	
КонецПроцедуры


Процедура ДвиженияПоРегиструОжидаемыйИПодтвержденныйНДСПродаж(СтруктураШапкиДокумента, ТаблицаПоТоварам,  Отказ, Заголовок)

	Если  ВидОперации <> Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.НалоговаяНакладная 
		И ВидОперации <> Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.ТоварныйЧек 
		И ВидОперации <> Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РасчетКорректировкиВозврат
		И ВидОперации <> Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РаботыОтНерезидентаПрошлогоПериода
		И ВидОперации <> Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РасчетКорректировкиКорректировка
		И ВидОперации <> Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.ИсправлениеОшибки		Тогда
		
		// В этом случае движения по регистру НДСПокупок этом документом не формируются
		Возврат
		
	КонецЕсли;
	
	НаборДвижений = Движения.ОжидаемыйИПодтвержденныйНДСПродаж;
	
	// Получим таблицу значений, совпадающую со струкутрой набора записей регистра.
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
	
	// ТОВАРЫ
	ТаблицаКопия = ТаблицаПоТоварам.Скопировать();                                                                                          
	Сч = 0;
	Пока Сч < ТаблицаКопия.Количество() Цикл
	
		СтрокаТоваров = ТаблицаКопия[Сч];	
		Если СтрокаТоваров.СуммаНДСУсловнойПродажи = 0 Тогда
			ТаблицаКопия.Удалить(СтрокаТоваров);                      
		Иначе
			Сч = Сч + 1;
		КонецЕсли;	
	
	КонецЦикла;
	
	ТаблицаКопия.Свернуть("СтавкаНДС", "СуммаВал, СуммаНДСУсловнойПродажи");
	
	ТаблицаКопия.Колонки.СуммаВал.Имя    			 = "БазаНДС";
	ТаблицаКопия.Колонки.СуммаНДСУсловнойПродажи.Имя = "СуммаНДС";
	
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаКопия, ТаблицаДвижений);
	
	ТаблицаДвижений.ЗаполнитьЗначения(Организация       , "Организация");
	
	Если ВидОперации =  Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РасчетКорректировкиВозврат Тогда
		
		ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПродаж.УсловнаяПродажаВозврат, "СобытиеНДС");
		ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.КодыОперацийОжидаемыйИПодтвержденныйНДСПродаж.ОжидаемыйНДС, "КодОперации");
		
		// Инвертируем суммы
		Для Каждого Строка Из ТаблицаДвижений Цикл
			Строка.БазаНДС	   = -Строка.БазаНДС;
			Строка.СуммаНДС    = -Строка.СуммаНДС;
		КонецЦикла;
		
	ИначеЕсли ВидОперации =  Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.ИсправлениеОшибки Тогда
		
		Для каждого Строка Из ТаблицаДвижений Цикл
			
			Если Строка.БазаНДС < 0 Тогда
				Строка.БазаНДС	   = -Строка.БазаНДС;
				Строка.СуммаНДС    = -Строка.СуммаНДС;
				Строка.СобытиеНДС  = Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПродаж.УсловнаяПродажаВозврат;
			Иначе	
				Строка.СобытиеНДС  = Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПродаж.УсловнаяПродажа;
			КонецЕсли;
		
		КонецЦикла;
		
		ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.КодыОперацийОжидаемыйИПодтвержденныйНДСПродаж.ОжидаемыйНДС, "КодОперации");
		
	Иначе
		
		ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПродаж.УсловнаяПродажа,    "СобытиеНДС");
		ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.КодыОперацийОжидаемыйИПодтвержденныйНДСПродаж.ОжидаемыйНДС,  "КодОперации");
		
	КонецЕсли;		
	
	Если НЕ Отказ И ТаблицаДвижений.Количество() > 0 Тогда
		
		НаборДвижений.мПериод          = Дата;
		НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;
		
		Движения.ОжидаемыйИПодтвержденныйНДСПродаж.ВыполнитьПриход();
	
	КонецЕсли;
	
КонецПроцедуры


Процедура ДвиженияПоРегиструНДСНалоговыйКредит(СтруктураШапкиДокумента, ТаблицаПоТоварам,  Отказ, Заголовок);
  		
	НаборДвижений = Движения.НДСНалоговыйКредит;
	
	// Получим таблицу значений, совпадающую со струкутрой набора записей регистра.
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
	
	ТаблицаКопия = ТаблицаПоТоварам.Скопировать();

	ТаблицаКопия.Свернуть("СтавкаНДС, СтатьяДекларацииНДСНалоговыйКредит", "Сумма, СуммаНДС");
	
	ТаблицаКопия.Колонки.Сумма   .Имя = "БазаНДС";
	ТаблицаКопия.Колонки.СуммаНДС.Имя = "НДС";
	
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаКопия, ТаблицаДвижений);
	
	ТаблицаДвижений.ЗаполнитьЗначения(Организация       , "Организация");
	ТаблицаДвижений.ЗаполнитьЗначения(ДоговорКонтрагента, "ДоговорКонтрагента");
	ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.КодыОперацийНДСНалоговыйКредит.ПервичныйДокумент, "КодОперации");
	
	Если НЕ Отказ И ТаблицаДвижений.Количество() > 0 Тогда
		
		НаборДвижений.мПериод          = Дата;
		НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;
		
		Движения.НДСНалоговыйКредит.ДобавитьДвижение();
	
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ


// Процедура - обработчик события "ОбработкаЗаполнения".
//
Процедура ОбработкаЗаполнения(Основание)
	
	Если Не Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(Основание)) ИЛИ Основание = Неопределено Тогда
		Возврат;
	КонецЕсли;

	// Заполним реквизиты из стандартного набора по документу основанию.
	ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание);
	
	Если НЕ ЗначениеЗаполнено(Дата) Тогда
		Дата = ОБщегоНазначения.ПолучитьРабочуюДату();	
	КонецЕсли;
 	
	ДокументОснование = Основание;
	
	ДоговорСделка 	   = ОпределитьДоговорСделку(Основание);
	ДоговорКонтрагента = ДоговорСделка.ДоговорКонтрагента;
	Сделка 			   = ДоговорСделка.Сделка;
	
	// в случае Авансового отчета контрагент может быть переопределен
	Контрагент = ДоговорКонтрагента.Владелец;
	
	СхемыНалогообложения = РегистрыСведений.СхемыНалогообложенияКонтрагентов.СрезПоследних(Дата, Новый Структура("Контрагент", Контрагент));
	Если СхемыНалогообложения.Количество() = 0 Тогда
		ПлательщикНДС = Истина;
	Иначе
		ПлательщикНДС = СхемыНалогообложения[0].СхемаНалогообложения.НДС;
	КонецЕсли;

	Если  ТипЗнч(Основание) = Тип("ДокументСсылка.КорректировкаОжидаемогоИПодтвержденногоНДС")  Тогда

	  ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.ИсправлениеОшибки;	
	  ВключаетсяВУточняющийРасчет = истина;
	  Возврат;
	  
  	ИначеЕсли  ТипЗнч(Основание) = Тип("ДокументСсылка.ИзменениеНалоговогоНазначенияЗапасов") 
	  	 ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.ИзменениеНалоговогоНазначенияТЗР") Тогда
	  
	  ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.ВосстановлениеНалоговогоКредита;	
	  Возврат;
	  
	ИначеЕсли  ТипЗнч(Основание) = Тип("ДокументСсылка.ПриходныйКассовыйОрдер")
	  ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.ПлатежноеПоручениеВходящее") 
	  ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.ПлатежныйОрдерПоступлениеДенежныхСредств") Тогда
		// возврат
		ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РасчетКорректировкиВозврат;
	ИначеЕсли (    ТипЗнч(Основание) = Тип("ДокументСсылка.ВозвратТоваровПоставщику") 
	  		  ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.ВозвратТоваровПоставщикуИзНТТ"))
			 И (НЕ   Основание.ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом) Тогда

		ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РасчетКорректировкиВозврат;
	
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.РасходныйКассовыйОрдер")
		  ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.ПлатежноеПоручениеИсходящее") Тогда
		  
		Если ПлательщикНДС  Тогда
			ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.НалоговаяНакладная;
		Иначе
			ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.ТоварныйЧек;
		КонецЕсли;
		
	ИначеЕсли (    ТипЗнч(Основание) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг")
	  	       ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.ПоступлениеТоваровУслугВНТТ")) 
		         И Основание.ДоговорКонтрагента.Внешнеэкономический Тогда
		
		ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РаботыОтНерезидентаПрошлогоПериода;
		
		ЗаполнитьПоРаботамОтНерезидента();
		// стандартнго заполнения не будет.
		Возврат;
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ОтчетКомиссионераОПродажах")  
		 И Основание.ДоговорКонтрагента.Внешнеэкономический Тогда	
		
		ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РаботыОтНерезидентаПрошлогоПериода;
		
		ЗаполнитьПоУслугамКомиссииОтНерезидента();
		// стандартнго заполнения не будет.
		Возврат;
		
	ИначеЕсли (  ТипЗнч(Основание) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг")
			 ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.ПоступлениеТоваровУслугВНТТ")) 
			 И Основание.ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом Тогда

		ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.НалоговаяНакладная;
		
		ЗаполнитьПоКомиссионнойТорговлеНалоговыйКодекс();
		// стандартнго заполнения не будет.
		Возврат;
		
	ИначеЕсли (  ТипЗнч(Основание) = Тип("ДокументСсылка.ВозвратТоваровПоставщику")
			 ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.ВозвратТоваровПоставщикуИзНТТ")) 
			 И Основание.ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом Тогда

		ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РасчетКорректировкиВозврат;
		
		ЗаполнитьПоКомиссионнойТорговлеНалоговыйКодекс();
		// стандартнго заполнения не будет.
		Возврат;
		
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ПереоценкаТоваровПринятыхНаКомиссию") Тогда
		
		ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РасчетКорректировкиКорректировка;
		
		ЗаполнитьПоКомиссионнойТорговлеНалоговыйКодекс();
		
		Возврат	
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
		
		ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РасчетКорректировкиКорректировка;
		
		ЗаполнитьПоКомиссионнойТорговлеНалоговыйКодекс();
		
		Возврат	
		
	Иначе
		
		Если ПлательщикНДС  Тогда
			ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.НалоговаяНакладная;
		Иначе
			ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.ТоварныйЧек;
		КонецЕсли;
		
	КонецЕсли;
	
	// дату документа установим равной дате документа-основания
	Дата = Основание.Дата;
	
	ЗаполнитьПоДокументуОснованиюСУчетомОстатков();
	
КонецПроцедуры // ОбработкаЗаполнения()

// Процедура вызывается перед записью документа 
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Посчитать суммы документа и записать ее в соответствующий реквизит шапки для показа в журналах
	СуммаДокумента 	  = Товары.Итог("СуммаВзаиморасчетов");
	СуммаНДСДокумента = Товары.Итог("СуммаНДС");
	
	Если ДоговорКонтрагента.Внешнеэкономический Тогда
		// Договор - внешнеэкономический
		СуммаВозвратнойТары = 0
	КонецЕсли;
	
	Если СчетНДСУсловнаяПродажа.Пустая() Тогда
		СчетНДСУсловнаяПродажа = ПланыСчетов.Хозрасчетный.УсловнаяПродажа;
	КонецЕсли;
	
	мУдалятьДвижения = НЕ ЭтоНовый();
		
КонецПроцедуры // ПередЗаписью

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	// Дерево значений, содержащее имена необходимых полей в запросе по шапке.
	Перем ДеревоПолейЗапросаПоШапке;
	
	Если мУдалятьДвижения Тогда
		ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;

	// Заголовок для сообщений об ошибках проведения.
	Заголовок = НСтр("ru='Проведение документа ""';uk='Проведення документа ""'") + СокрЛП(Ссылка) + """: ";

	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);

	// Заполним по шапке документа дерево параметров, нужных при проведении.
	ДеревоПолейЗапросаПоШапке      = ОбщегоНазначения.СформироватьДеревоПолейЗапросаПоШапке();
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "Организация"         , "ДоговорОрганизация");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "ВидДоговора"         , "ВидДоговора");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "ВедениеВзаиморасчетов"                   , "ВедениеВзаиморасчетов");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "ВалютаВзаиморасчетов"                    , "ВалютаВзаиморасчетов");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "СложныйНалоговыйУчет"					   , "СложныйНалоговыйУчет");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "Внешнеэкономический"                     , "Внешнеэкономический");	

	// Сформируем запрос на дополнительные параметры, нужные при проведении, по данным шапки документа
	СтруктураШапкиДокумента = УправлениеЗапасами.СформироватьЗапросПоДеревуПолей(ЭтотОбъект, ДеревоПолейЗапросаПоШапке, СтруктураШапкиДокумента, мВалютаРегламентированногоУчета);
	
	// Получим данные учетной политики
	ПодготовитьПараметрыУчетнойПолитикиРегл(СтруктураШапкиДокумента, Отказ, Заголовок);
	// При получении учетной политики произошли ошибки
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
		
	// Проверим правильность заполнения шапки документа
	ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок);

	// Получим необходимые данные для проведения и проверки заполенения по табличной части "Товары".
	СтруктураПолей = Новый Структура();
	СтруктураПростыхПолей = Новый Структура();
	
	СтруктураПолей.Вставить("Сумма"                     , "Сумма");
	СтруктураПолей.Вставить("СтавкаНДС"                 , "СтавкаНДС");
	СтруктураПолей.Вставить("СуммаНДС"					, "СуммаНДС");
	СтруктураПолей.Вставить("ДляХозяйственнойДеятельности", "ДляХозяйственнойДеятельности");
	СтруктураПолей.Вставить("ДляОперацийОблагаемыхНДС"	, "ДляОперацийОблагаемыхНДС");
	СтруктураПолей.Вставить("Амортизируется"			, "Амортизируется");
	СтруктураПолей.Вставить("ПропорциональныйНДС"		, "ПропорциональныйНДС");
	СтруктураПолей.Вставить("СтатьяДекларацииНДСНалоговыйКредит"  	, "СтатьяДекларацииНДСНалоговыйКредит");
	СтруктураПростыхПолей.Вставить("ВозвратнаяТара"     , Ложь);
	
	РезультатЗапросаПоТоварам = ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "Товары", СтруктураПолей, СтруктураПростыхПолей);

	// Подготовим таблицу товаров для проведения.
	ТаблицаПоТоварам = ПодготовитьТаблицуТоваров(РезультатЗапросаПоТоварам, СтруктураШапкиДокумента);

	// Проверить заполнение ТЧ "Товары".
	ПроверитьЗаполнениеТабличнойЧастиТовары(ТаблицаПоТоварам, СтруктураШапкиДокумента, Отказ, Заголовок);
   	
	// Движения по документу
	Если Не Отказ Тогда
		ДвиженияПоРегистрам(СтруктураШапкиДокумента, ТаблицаПоТоварам, Отказ, Заголовок);
	КонецЕсли;
	
	Движения.Хозрасчетный.ВыполнитьДействияПередЗаписьюДвижений();

КонецПроцедуры // ОбработкаПроведения()

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	
КонецПроцедуры

// копия общей процедуры НалоговыйУчет.ОпределитьСделкуНалоговыйУчет(). С одним отличием - Упрощ. нал. учет по расчетным документом в 
// качестве сделки всегда возвращает указанную в документе сделку
// 
Функция ОпределитьСделкуЛокально() Экспорт

	Если ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом Тогда
		
		Если НЕ ДоговорКонтрагента.СложныйНалоговыйУчет 
			  И ДоговорКонтрагента.ВестиПоДокументамРасчетовСКонтрагентомРегл Тогда
			  
			Возврат Сделка;

			
		Иначе
			
			Возврат Неопределено;
						
		КонецЕсли;
		
	Иначе

		Возврат Сделка;

	КонецЕсли;
   
КонецФункции // УправлениеВзаиморасчетами.ОпределитьДокументРасчетовСКонтрагентом()

мВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
