#Область ОбщегоНазначения

Функция ОкруглитьВБольшую(Числ, ПорядокОкругления = 0) Экспорт
	Перем Рез;
    
	Если ПорядокОкругления = 0 Тогда
		Возврат Числ;
	КонецЕсли;
    // округление к верхней границе по заданному порядку 
    // преобразуем порядок округления число
    Порядок            = ПорядокОкругления; 
    // вычислим количество интервалов, входящих в число
    КолвоИнтервал    = Числ / Порядок;   
    // вычислим целое количество интервалов.
    КолвоИнтервалЦел= Цел(КолвоИнтервал);  
    Если КолвоИнтервал = КолвоИнтервалЦел Тогда
        // Числа поделились нацело. Округлять не нужно.
        Рез    = Числ;
    Иначе
        Рез    = Порядок * (КолвоИнтервалЦел + 1);
    КонецЕсли;
         
    Возврат Рез;
	
КонецФункции // глОкруглить()

Процедура ПоказатьДополнительныеРеквизитыНоменклатуры(КолонкиТабПоля, ЯчейкиСтрокиТабПоля, СтруктураДанных, Период = Неопределено) Экспорт

	ЯчейкиСтрокиТабПоля.ЕстьКодС.ОтображатьФлажок = Истина;
	
	Если СтруктураДанных.Номенклатура <> Неопределено Тогда
		СтруктураРеквизитов = ПолучитьДополнительныеРеквизитыНоменклатуры(СтруктураДанных.Номенклатура, Период);
		СтруктураОстатков 	= ПолучитьОстаткиНоменклатуры(СтруктураДанных.Номенклатура, СтруктураДанных.Склад, Период);
		
		СписокДниБлокировки = Новый СписокЗначений;
		СписокДниБлокировки.Добавить("Пн");
		СписокДниБлокировки.Добавить("Вт");
		СписокДниБлокировки.Добавить("Ср");
		СписокДниБлокировки.Добавить("Чт");
		СписокДниБлокировки.Добавить("Пт");
		СписокДниБлокировки.Добавить("Сб");
		СписокДниБлокировки.Добавить("Вс");
		
		СтрокаДниБлокировки = "";
		
		Для н = 1 По СтрДлина(СтруктураРеквизитов.БлокироватьПроизводство) Цикл
			
			Признак = Сред(СтруктураРеквизитов.БлокироватьПроизводство, н, 1);
			
			Если Признак = "1" Тогда
				СтрокаДниБлокировки = СтрокаДниБлокировки + СписокДниБлокировки.Получить(н-1);
			КонецЕсли;
			
		КонецЦикла;	
		
		ЯчейкиСтрокиТабПоля.ЕстьКодС.Флажок = ?(СтруктураРеквизитов.ЕстьКодС = Неопределено, Ложь, СтруктураРеквизитов.ЕстьКодС);
		ЯчейкиСтрокиТабПоля.Выход.УстановитьТекст(СтруктураРеквизитов.Выход);
		ЯчейкиСтрокиТабПоля.ДниБлокировкиВыпуска.УстановитьТекст(СтрокаДниБлокировки);
		ЯчейкиСтрокиТабПоля.Остаток.УстановитьТекст(?(СтруктураОстатков = Неопределено, "", СтруктураОстатков.Количество));
	Иначе
		ЯчейкиСтрокиТабПоля.ЕстьКодС.Флажок = Ложь;
		ЯчейкиСтрокиТабПоля.Выход.УстановитьТекст("");
		ЯчейкиСтрокиТабПоля.ДниБлокировкиВыпуска.УстановитьТекст("");
		ЯчейкиСтрокиТабПоля.Остаток.УстановитьТекст("");
	КонецЕсли;

КонецПроцедуры

Функция ПолучитьДополнительныеРеквизитыНоменклатуры(Номенклатура, Период = Неопределено) Экспорт
	
	СтруктураРеквизитов = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", 		?(Период = Неопределено, ТекущаяДата(), Период));
	Запрос.УстановитьПараметр("Номенклатура", 	Номенклатура);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДопРеквизитыНоменклатуры.БлокироватьВыписку 		КАК БлокироватьВыписку,
	|	ДопРеквизитыНоменклатуры.БлокироватьПроизводство 	КАК БлокироватьПроизводство,
	|	ДопРеквизитыНоменклатуры.Выход 						КАК Выход,
	|	ДопРеквизитыНоменклатуры.ВидДокументаУК 			КАК ВидДокументаУК,
	|	ДопРеквизитыНоменклатуры.ВидДокументаУК1 			КАК ВидДокументаУК1,
	|	ДопРеквизитыНоменклатуры.ВидДокументаУК2 			КАК ВидДокументаУК2,
	|	ДопРеквизитыНоменклатуры.ЕстьКодС 					КАК ЕстьКодС,
	|	ДопРеквизитыНоменклатуры.НомерУК 					КАК НомерУК,
	|	ДопРеквизитыНоменклатуры.НомерУК1 					КАК НомерУК1,
	|	ДопРеквизитыНоменклатуры.НомерУК2 					КАК НомерУК2,
	|	ДопРеквизитыНоменклатуры.ДатаУК 					КАК ДатаУК,
	|	ДопРеквизитыНоменклатуры.ДатаУК1 					КАК ДатаУК1,
	|	ДопРеквизитыНоменклатуры.ДатаУК2 					КАК ДатаУК2,
	|	ДопРеквизитыНоменклатуры.КонечныйСрок 				КАК КонечныйСрок,
	|	ДопРеквизитыНоменклатуры.КонечныйСрок1 				КАК КонечныйСрок1,
	|	ДопРеквизитыНоменклатуры.КонечныйСрок2 				КАК КонечныйСрок2,
	|	ДопРеквизитыНоменклатуры.ПримСтр 					КАК ПримСтр,
	|	ДопРеквизитыНоменклатуры.ПримСтр1 					КАК ПримСтр1,
	|	ДопРеквизитыНоменклатуры.ПримСтр2 					КАК ПримСтр2
	|ИЗ
	|	РегистрСведений.umk_ДопРеквизитыНоменклатуры.СрезПоследних(&Период, Номенклатура = &Номенклатура) КАК ДопРеквизитыНоменклатуры
	|";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Для Каждого Колонка Из РезультатЗапроса.Колонки Цикл
		СтруктураРеквизитов.Вставить(Колонка.Имя, Неопределено);
	КонецЦикла;
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат СтруктураРеквизитов;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	ЗаполнитьЗначенияСвойств(СтруктураРеквизитов, Выборка);
	
	Возврат СтруктураРеквизитов;
	
КонецФункции

Функция ПолучитьОстаткиНоменклатуры(Номенклатура, Склад, Период = Неопределено) Экспорт
	
	СтруктураРеквизитов = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", 		?(Период = Неопределено, ТекущаяДата(), КонецДня(Период)));
	Запрос.УстановитьПараметр("Номенклатура", 	Номенклатура);
	Запрос.УстановитьПараметр("Склад", 			Склад);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыОрганизацийОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыОрганизацийОстатки.Склад КАК Склад,
	|	ТоварыОрганизацийОстатки.КоличествоОстаток КАК Количество,
	|	ВложенныйЗапрос.КоличествоХарактеристика
	|ИЗ
	|	РегистрНакопления.ТоварыОрганизаций.Остатки(
	|			&Период,
	|			Номенклатура = &Номенклатура
	|				И Склад = &Склад) КАК ТоварыОрганизацийОстатки,
	|	(ВЫБРАТЬ
	|		ЕСТЬNULL(ТоварыОрганизацийОстатки.КоличествоОстаток, 0) КАК КоличествоХарактеристика
	|	ИЗ
	|		РегистрНакопления.ТоварыОрганизаций.Остатки(
	|				&Период,
	|				Номенклатура = &Номенклатура
	|					И Склад = &Склад
	|					И НЕ ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК ТоварыОрганизацийОстатки) КАК ВложенныйЗапрос";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Для Каждого Колонка Из РезультатЗапроса.Колонки Цикл
		СтруктураРеквизитов.Вставить(Колонка.Имя, Неопределено);
	КонецЦикла;
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	ЗаполнитьЗначенияСвойств(СтруктураРеквизитов, Выборка);
	
	Возврат СтруктураРеквизитов;
	
КонецФункции

// Процедура - создать штрихкод
// Параметры
//  текстрока - строка ТЧ документа
//  Штрихкод
//
Процедура НовыйШтрихкод(ТекущаяСтрока, Штрихкод) Экспорт
	
	//Если ТекущаяСтрока = Неопределено Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//ОбновитьШтрихкод = Истина;
	//ЕстьШтрихкод = Ложь;
	//
	//// Найдем штрихкод с необходимыми параметрами
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	Штрихкоды.Штрихкод КАК Штрихкод,
	//	|	Штрихкоды.Владелец,
	//	|	Штрихкоды.ХарактеристикаНоменклатуры
	//	|ИЗ
	//	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	//	|ГДЕ
	//	|	Штрихкоды.Штрихкод = &Штрихкод";
	//	
	////	|	Штрихкоды.Владелец = &Владелец
	////	|	И Штрихкоды.ТипШтрихкода = &ТипШтрихкода
	////	|	И Штрихкоды.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры";
	////
	//
	//Запрос.УстановитьПараметр("Штрихкод", Штрихкод);  
	//
	//Запрос.УстановитьПараметр("Владелец", ТекущаяСтрока.Номенклатура);
	//Запрос.УстановитьПараметр("ТипШтрихкода", ПланыВидовХарактеристик.ТипыШтрихкодов.umk5);
	//Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры", ТекущаяСтрока.ХарактеристикаНоменклатуры);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//Выборка = РезультатЗапроса.Выбрать();
	//
	////Если Выборка.Следующий() Тогда 
	////	ШтрихкодВыборка = Выборка.Штрихкод;
	////	ОбновитьШтрихкод =  Не (Штрихкод = ШтрихкодВыборка);
	////	ЕстьШтрихкод = Истина;
	////КонецЕсли;
	//
	//// Поменяем все наоборот. Проверим не изменилась ли номенклатура у штрихкода. 
	//Если Выборка.Следующий() Тогда 
	//	ШтрихкодВыборка = Выборка.Штрихкод;
	//	ОбновитьШтрихкод =  Не (Выборка.Владелец = ТекущаяСтрока.Номенклатура) ИЛИ 
	//      Не(Выборка.ХарактеристикаНоменклатуры = ТекущаяСтрока.ХарактеристикаНоменклатуры);
	//	ЕстьШтрихкод = Истина;
	//КонецЕсли;

	////
	////Если ОбновитьШтрихкод и ЕстьШтрихкод Тогда   // удалим запись 
	////	НаборЗаписей = РегистрыСведений.Штрихкоды.СоздатьНаборЗаписей();
	////	НаборЗаписей.Отбор.Штрихкод.Установить(ШтрихкодВыборка);
	////	НаборЗаписей.Записать(); 
	////КонецЕсли;
	//
	//Если ОбновитьШтрихкод и ЕстьШтрихкод Тогда   // удалим запись 
	//	НаборЗаписей = РегистрыСведений.Штрихкоды.СоздатьНаборЗаписей();
	//	НаборЗаписей.Отбор.ХарактеристикаНоменклатуры.Установить(Выборка.ХарактеристикаНоменклатуры);
	//	НаборЗаписей.Отбор.Владелец.Установить(Выборка.Владелец);
	//	НаборЗаписей.Записать(); 
	//КонецЕсли;
	//
	//
	//Если ОбновитьШтрихкод Тогда
	//	
	//	//Удалим если уже есть по текущей строке
	//	НаборЗаписей = РегистрыСведений.Штрихкоды.СоздатьНаборЗаписей();
	//	НаборЗаписей.Отбор.ХарактеристикаНоменклатуры.Установить(ТекущаяСтрока.ХарактеристикаНоменклатуры);
	//	НаборЗаписей.Отбор.Владелец.Установить(ТекущаяСтрока.Номенклатура);
	//	НаборЗаписей.Записать(); 
	//	
	//	//Запишем
	//	
	//	ТекЗапись = РегистрыСведений.Штрихкоды.СоздатьМенеджерЗаписи();
	//	
	//	ТекЗапись.Владелец         = ТекущаяСтрока.Номенклатура;
	//	ТекЗапись.ЕдиницаИзмерения = ТекущаяСтрока.Номенклатура.ЕдиницаХраненияОстатков;
	//	ТекЗапись.ХарактеристикаНоменклатуры = ТекущаяСтрока.ХарактеристикаНоменклатуры;
	//	ТекЗапись.ТипШтрихкода     = ПланыВидовХарактеристик.ТипыШтрихкодов.umk5;
	//	ТекЗапись.Качество         = Справочники.Качество.Новый;
	//	ТекЗапись.Штрихкод         = Штрихкод;
	//	
	//	Попытка
	//		ТекЗапись.Записать(Истина);
	//	Исключение
	//	КонецПопытки;
	//	
	//КонецЕсли;
	//
КонецПроцедуры

// Возвращает штрихкод для строки документа
Функция ВывестиШтрихкод(ТекущаяСтрока, ТипШтрихкода) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Штрихкоды.Штрихкод
		|ИЗ
		|	РегистрСведений.Штрихкоды КАК Штрихкоды
		|ГДЕ
		|	Штрихкоды.Владелец = &Владелец
		|	И Штрихкоды.ТипШтрихкода = &ТипШтрихкода
		|	И Штрихкоды.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры";
	
	Запрос.УстановитьПараметр("Владелец", ТекущаяСтрока.Номенклатура);
	Запрос.УстановитьПараметр("ТипШтрихкода", ТипШтрихкода);
	Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры", ТекущаяСтрока.ХарактеристикаНоменклатуры);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Штрихкод
	
КонецФункции

Процедура СоздатьЗаписьСрокГодности(ТекущаяСтрока, ПараметрыСрокаГодности) Экспорт
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
		Возврат;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	umk_СрокиГодности.Номенклатура,
		|	umk_СрокиГодности.Характеристика,
		|	umk_СрокиГодности.СрокГодности,
		|	umk_СрокиГодности.ВидСрокаГодности
		|ИЗ
		|	РегистрСведений.umk_СрокиГодности КАК umk_СрокиГодности
		|ГДЕ
		|	umk_СрокиГодности.Номенклатура = &Номенклатура
		|	И umk_СрокиГодности.Характеристика = &Характеристика
		|	И umk_СрокиГодности.СрокГодности = &СрокГодности
		|	И umk_СрокиГодности.ВидСрокаГодности = &ВидСрокаГодности";
	
	Запрос.УстановитьПараметр("ВидСрокаГодности", Перечисления.umk_ВидыСроковГодности[ПараметрыСрокаГодности["ВидСрокаГодности"]]);
	Запрос.УстановитьПараметр("Номенклатура", ТекущаяСтрока.Номенклатура);
	Запрос.УстановитьПараметр("СрокГодности",  ПараметрыСрокаГодности["СрокГодности"]);
	Запрос.УстановитьПараметр("Характеристика", ТекущаяСтрока.ХарактеристикаНоменклатуры);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат  // Есть запись с такими значениями, не создаем
	КонецЕсли;
	
	ТекЗапись = РегистрыСведений.umk_СрокиГодности.СоздатьМенеджерЗаписи();
	
	ТекЗапись.Номенклатура        = ТекущаяСтрока.Номенклатура;
	ТекЗапись.Характеристика = ТекущаяСтрока.ХарактеристикаНоменклатуры;
	ТекЗапись.СрокГодности     = ПараметрыСрокаГодности["СрокГодности"];
	ТекЗапись.ВидСрокаГодности = Перечисления.umk_ВидыСроковГодности[ПараметрыСрокаГодности["ВидСрокаГодности"]];
	
	//Попытка //Пусть лучше вылетит ошибка. 
		ТекЗапись.Записать(Истина);
	//Исключение
	//КонецПопытки;
		
КонецПроцедуры

//Прелбразует строку 77 в дату
Функция ПреобразоватьДату77(СтрокаДата) Экспорт
	//01.01.2020
	Если СтрДлина(СтрокаДата) = 10 Тогда
		Возврат Дата(Прав(СтрокаДата,4),Сред(СтрокаДата,4,2),Лев(СтрокаДата,2))
	ИначеЕсли СтрДлина(СтрокаДата) = 8 Тогда  // 01.01.20
		Возврат Дата("20" + Прав(СтрокаДата,2),Сред(СтрокаДата,4,2),Лев(СтрокаДата,2))
	Иначе
		Возврат '00010101000000' 
	КонецЕсли;
	
КонецФункции

Функция ГруппыКонтрагентовПоПодразделению(Подразделение) Экспорт
	
	СтруктураГрупп = Новый Структура();
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтрагентыПодразделений.ГруппаКонтрагентов
		|ИЗ
		|	РегистрСведений.КонтрагентыПодразделений КАК КонтрагентыПодразделений
		|ГДЕ
		|	КонтрагентыПодразделений.Подразделение = &Подразделение";
	
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	ГруппыКонтрагентов = РезультатЗапроса.ВыгрузитьКолонку("ГруппаКонтрагентов");
	
	СтруктураГрупп.Вставить("ГруппыКонтрагентов", ГруппыКонтрагентов);
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.ЭтоГруппа = ИСТИНА
		|	И НЕ Контрагенты.Ссылка В (&ГруппыКонтрагентов)";
	
	Запрос.УстановитьПараметр("ГруппыКонтрагентов", ГруппыКонтрагентов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	 СтруктураГрупп.Вставить("ГруппыИсключений", РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка"));
	 
	 Возврат СтруктураГрупп
	
КонецФункции

Функция ГруппыКонтрагентовОтчеты() Экспорт
	
	ОсновноеПодразделение = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновноеПодразделение");
	СтруктураОтбора = ГруппыКонтрагентовПоПодразделению(ОсновноеПодразделение);
	
	Возврат  СтруктураОтбора.ГруппыКонтрагентов
	
КонецФункции

#КонецОбласти


#Область ВнешнееПодключение

Функция ПолучитьВыборкуДокументов(ИмяДокумента, НачалоПериода = Неопределено, ОкончаниеПериода = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", 		?(НачалоПериода = Неопределено, Неопределено, НачалоДня(НачалоПериода)));
	Запрос.УстановитьПараметр("ОкончаниеПериода", 	?(ОкончаниеПериода = Неопределено, Неопределено, КонецДня(ОкончаниеПериода)));
	Запрос.УстановитьПараметр("Организация",  Константы.umk_ГоловнаяОрганизация.Получить());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Документ.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.%ИмяДокумента% КАК Документ
	|ГДЕ
	|	Документ.Проведен
	|	И Документ.Организация = &Организация
	|	И ВЫБОР КОГДА &НачалоПериода = НЕОПРЕДЕЛЕНО ИЛИ &ОкончаниеПериода = НЕОПРЕДЕЛЕНО ТОГДА ИСТИНА ИНАЧЕ Документ.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода КОНЕЦ";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ИмяДокумента%", ИмяДокумента);
	Запрос.Текст = ТекстЗапроса;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат Выборка; 
	
КонецФункции

Функция ПолучитьВыборкуСправочников(ИмяСправочника) Экспорт
	
	Запрос = Новый Запрос;
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Справочник.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.%ИмяСправочника% КАК Справочник
	|
	|ГДЕ
	|	НЕ Справочник.ПометкаУдаления";
		
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ИмяСправочника%", ИмяСправочника);
	Запрос.Текст = ТекстЗапроса;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат Выборка; 
	
КонецФункции

Функция ПолучитьСчетУчетаНоменклатуры(Номенклатура) Экспорт
	
	Результат = Новый Структура("СчетУчета", ПланыСчетов.Хозрасчетный.ПустаяСсылка());
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номенклатура", 		Номенклатура);
	Запрос.УстановитьПараметр("ВидНоменклатуры", 	Номенклатура.ВидНоменклатуры);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СчетаУчетаНоменклатуры.СчетУчетаБУ КАК СчетУчета
	|ИЗ
	|	РегистрСведений.СчетаУчетаНоменклатуры КАК СчетаУчетаНоменклатуры
	|
	|ГДЕ
	|	СчетаУчетаНоменклатуры.Номенклатура = &Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	СчетаУчетаНоменклатуры.СчетУчетаБУ КАК СчетУчета
	|ИЗ
	|	РегистрСведений.СчетаУчетаНоменклатуры КАК СчетаУчетаНоменклатуры
	|
	|ГДЕ
	|	СчетаУчетаНоменклатуры.ВидНоменклатуры = &ВидНоменклатуры
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьЦеныНоменклатуры(Номенклатура = Неопределено, Период = Неопределено, ТипЦен = Неопределено) Экспорт
	
	Результат 						= Новый Массив;
	Период 							= ?(Период = Неопределено, ТекущаяДата(), Период);
	//ТипЦен 							= ?(ТипЦен = Неопределено, Справочники.ТипыЦенНоменклатуры.Плановая, ТипЦен);
	ВалютаРегламентированногоУчета 	= Константы.ВалютаРегламентированногоУчета.Получить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период",			Период);
	Запрос.УстановитьПараметр("ТипЦен", 		ТипЦен);
	Запрос.УстановитьПараметр("Номенклатура", 	Номенклатура);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЦеныНоменклатуры.Период 		КАК Период,
	|	ЦеныНоменклатуры.Номенклатура 	КАК Номенклатура,
	|	ЦеныНоменклатуры.ТипЦен 		КАК ТипЦен,
	|	ЦеныНоменклатуры.Валюта 		КАК Валюта,
	|	ЦеныНоменклатуры.Цена 			КАК Цена
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			&Период,
	|			ВЫБОР КОГДА &Номенклатура = НЕОПРЕДЕЛЕНО ТОГДА ИСТИНА ИНАЧЕ Номенклатура = &Номенклатура КОНЕЦ
	|			И ВЫБОР КОГДА &ТипЦен = НЕОПРЕДЕЛЕНО ТОГДА ИСТИНА ИНАЧЕ ТипЦен В (&ТипЦен) КОНЕЦ) КАК ЦеныНоменклатуры
	|";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Результат.Добавить(ПолучитьСтруктуруЦен());
		Возврат Результат;
	КонецЕсли;

	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтруктураРезультат = ПолучитьСтруктуруЦен();
		
		ЗаполнитьЗначенияСвойств(СтруктураРезультат, Выборка);
	
    	ПолученнаяЦена 	= Выборка.Цена;

		ПолученнаяЦена 	= Ценообразование.ОкруглитьЦену(ПолученнаяЦена, Выборка.ТипЦен.ПорядокОкругления, Выборка.ТипЦен.ОкруглятьВБольшуюСторону);
		ПолученнаяЦена 	= Ценообразование.ПересчитатьЦенуПриИзмененииВалюты(ПолученнаяЦена, Выборка.Валюта, ВалютаРегламентированногоУчета, 1, 1, Период);
		
		СтруктураРезультат.Цена = ПолученнаяЦена;
		
		Результат.Добавить(СтруктураРезультат);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСтруктуруЦен()
	
	Возврат Новый Структура("Период, Номенклатура, ТипЦен, Валюта, Цена",
							Дата(1, 1, 1),
							Справочники.Номенклатура.ПустаяСсылка(),
							Справочники.ТипыЦенНоменклатуры.ПустаяСсылка(),
							Справочники.Валюты.ПустаяСсылка(),
							0);
	
КонецФункции
						
Функция ПолучитьТаблицуОстатков(Период, СтрокаСчетов) Экспорт
	
	МассивСчетов = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(СтрокаСчетов,",");
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХозрасчетныйОстатки.Субконто1 КАК Номенклатура,
		|	ХозрасчетныйОстатки.СуммаОстаток,
		|	ХозрасчетныйОстатки.КоличествоОстаток
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(&Период, Счет.Код В (&МассивСчетов), , Организация = &Организация) КАК ХозрасчетныйОстатки";
	
	Запрос.УстановитьПараметр("МассивСчетов", МассивСчетов);
	Запрос.УстановитьПараметр("Период", ?(Период = Неопределено, ТекущаяДата(), Новый Граница(КонецДня(Период), ВидГраницы.Включая)));
	Запрос.УстановитьПараметр("Организация",Константы.umk_ГоловнаяОрганизация.Получить()); //Временно 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Возврат Выборка
						
КонецФункции

Функция ПолучитьЗначениеКонтактаКонтрагента(Контрагент,ВидКИ) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтактнаяИнформация.Представление
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Объект = &Контрагент
		|	И КонтактнаяИнформация.Вид = &ВидКИ";
	
	Запрос.УстановитьПараметр("ВидКИ", ВидКИ);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат  Выборка.Представление
	Иначе
		Возврат ""
	КонецЕсли;
	
	
КонецФункции

#КонецОбласти

#Область РасчетЗарплаты

Функция ФормулаРасчетаЗарплаты(ВидРасчета, Период) Экспорт
	 	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	umk_ФормулаРасчетаЗарплаты.ФормулаРасчета КАК ФормулаРасчета
		|ИЗ
		|	РегистрСведений.umk_ФормулыРасчетаЗарплаты.СрезПоследних(&Период, ВидРасчета = &ВидРасчета) КАК ФормулыРасчетаЗарплатыСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.umk_ФормулаРасчетаЗарплаты КАК umk_ФормулаРасчетаЗарплаты
		|		ПО ФормулыРасчетаЗарплатыСрезПоследних.Формура = umk_ФормулаРасчетаЗарплаты.Ссылка";
	
	Запрос.УстановитьПараметр("ВидРасчета", ВидРасчета);
	Запрос.УстановитьПараметр("Период", Период);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Возврат Выборка
		
КонецФункции	

// Возвращает копию набора записей регистра расчета в виде
//Таблицы значений
Функция НаборЗаписейКопия(НаборЗаписейРегистра) Экспорт
	
	НаборЗаписейРегистраКопия = Новый ТаблицаЗначений;
	НаборЗаписейРегистраКопия.Колонки.Добавить("Сотрудник");
	НаборЗаписейРегистраКопия.Колонки.Добавить("ВидРасчета");
	НаборЗаписейРегистраКопия.Колонки.Добавить("Результат");
	НаборЗаписейРегистраКопия.Колонки.Добавить("РезультатУпр");
	
	Для Каждого Запись Из НаборЗаписейРегистра Цикл
		НоваяЗапись = НаборЗаписейРегистраКопия.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Запись);
	КонецЦикла;
	
	НаборЗаписейРегистраКопия.Свернуть("Сотрудник,ВидРасчета", "Результат,РезультатУпр"); 
	
	Возврат НаборЗаписейРегистраКопия
	
КонецФункции

#КонецОбласти

#Область УниверсальныеМеханизмы

// Выводит на печать подготовленный макет 
//
//  ПечДокумент            - ТабличыйДокумент, макет на печать,
//  КоличествоЭкземпляров  - Число, количество экземпляров на печать,
//  НаПринтер              - Булево, Если истина, то выводим сразу на принтер.
//  Заголовок              - Заголовок окна табличного документа
//  НепосредственнаяПечать - используется только для режи
Процедура НапечататьДокумент(ПечДокумент, КоличествоЭкземпляров = 1, НаПринтер = Ложь, Заголовок = "", Ссылка = Неопределено, ИсточникМакета = Неопределено, Редактировать = Ложь, ОбъектСохраненияФайла = Неопределено) Экспорт

	Если ПечДокумент = Неопределено тогда
		Возврат;
	КонецЕсли;

	// Получить необходимое количество копий
	Если КоличествоЭкземпляров > 0 Тогда
		ПечДокумент.КоличествоЭкземпляров = КоличествоЭкземпляров;
	КонецЕсли;

	Если НЕ ПечДокумент.АвтоМасштаб
	   И НЕ ЗначениеЗаполнено(ПечДокумент.ИмяПринтера) Тогда
		ПечДокумент.АвтоМасштаб = Истина;
	КонецЕсли;

	Если ТипЗнч(НаПринтер) = Тип("Булево") Тогда
		Если НаПринтер Тогда
			ПечДокумент.Вывод = ИспользованиеВывода.Разрешить;
			ПечДокумент.Напечатать();
		Иначе
			ФормаПечати = ПолучитьОбщуюФорму("umk_ПечатьДокументов",, Новый УникальныйИдентификатор);
			ФормаПечати.ОбъектПечати     = Ссылка;
			ФормаПечати.ОбъектСохраненияФайла = ОбъектСохраненияФайла;
			ФормаПечати.ПечатныйДокумент = ПечДокумент;
			ФормаПечати.Заголовок        = Заголовок;
			ФормаПечати.Защита           = УправлениеДопПравамиПользователей.ЗащитаТаблиц();
			ФормаПечати.Редактировать    = Редактировать;
			//ФормаПечати.ИсточникМакета   = ИсточникМакета;
			ФормаПечати.Открыть();
		КонецЕсли;
	ИначеЕсли ТипЗнч(НаПринтер) = Тип("Массив") Тогда
		ПечДокумент.Вывод = ИспользованиеВывода.Разрешить;
		ПечДокумент.Напечатать();

		НаПринтер.Добавить(ПечДокумент);
	КонецЕсли;

КонецПроцедуры // НапечататьДокумент()
// Проверим есть ли по регистратору сохраненный в базу табл. документ
Функция ВыборкаПоОбъектуПечати(ОбъектПечати) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ХранилищеДополнительнойИнформации.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ХранилищеДополнительнойИнформации КАК ХранилищеДополнительнойИнформации
		|ГДЕ
		|	ХранилищеДополнительнойИнформации.Объект = &ОбъектПечати
		|	И ХранилищеДополнительнойИнформации.ПометкаУдаления = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка УБЫВ";
	
	Запрос.УстановитьПараметр("ОбъектПечати", ОбъектПечати);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выбрать();
	
	
КонецФункции
// Возвращает родителя вкерхнего уровня
Функция ПолучитьРодителяВерхнегоУровня(ИмяСправочника,СпрСсылка) Экспорт
	
	Если Не СпрСсылка = Неопределено И Не СпрСсылка = Null Тогда
		
		Пока Истина  Цикл
			Если Спрссылка.Родитель =  Справочники[ИмяСправочника].Пустаяссылка()
				Тогда
				Возврат Спрссылка
			Иначе
				Спрссылка = Спрссылка.Родитель;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецФункции
// Устанавливает флаг оригинал в списках документов
Функция ДокументПолучен(ИмяРегистра, Документ, Записать = Ложь) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокументыРегистра.ДокументПолучен
		|ИЗ РегистрСведений." + ИмяРегистра + " КАК ДокументыРегистра
		|ГДЕ
		|	ДокументыРегистра.Документ = &Документ";
	
	Запрос.УстановитьПараметр("Документ", Документ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Если Записать Тогда
			Менеджер = РегистрыСведений[ИмяРегистра].СоздатьМенеджерЗаписи();
			Менеджер.Документ = Документ;
			Менеджер.ДокументПолучен = Не Выборка.ДокументПолучен;
			Менеджер.Записать(Истина);
			
			Возврат  Менеджер.ДокументПолучен;
		Иначе
			Возврат Выборка.ДокументПолучен
		КонецЕсли;
		
	Иначе
		Если Записать Тогда
			Менеджер = РегистрыСведений[ИмяРегистра].СоздатьМенеджерЗаписи();
			Менеджер.Документ = Документ;
			Менеджер.ДокументПолучен = Истина;
			Менеджер.Записать(Истина);
			
			Возврат  Менеджер.ДокументПолучен;
			
		Иначе
			Возврат Ложь
		КонецЕсли;
		
	КонецЕсли;
		
КонецФункции

// Возвращает среднюю стоимость реализованной продукции в базе 7.7. 
Функция СтоимостьПартииРН_77(ДокументПартии, Номенклатура) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументРеализации",ДокументПартии);
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА umk_СебестоимостьРеализацииБаза77.Количество = 0
		|			ТОГДА 0
		|		ИНАЧЕ umk_СебестоимостьРеализацииБаза77.СебестоимостьРеализации / umk_СебестоимостьРеализацииБаза77.Количество
		|	КОНЕЦ КАК Стоимость
		|ИЗ
		|	РегистрСведений.umk_СебестоимостьРеализацииБаза77 КАК umk_СебестоимостьРеализацииБаза77
		|ГДЕ
		|	umk_СебестоимостьРеализацииБаза77.ДокументРеализации = &ДокументРеализации
		|	И umk_СебестоимостьРеализацииБаза77.Номенклатура = &Номенклатура";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
	    Возврат	Выборка.Стоимость 
		
	Иначе
		
		Возврат 0
		
	КонецЕсли;
	
	
КонецФункции

// Вызывает паузу в выполнении кода
Процедура Пауза(Секунды) Экспорт
	 
	ВремяОкончания = ТекущаяДата() + Секунды;
	Пока ТекущаяДата() <= ВремяОкончания Цикл	
	КонецЦикла;
	
КонецПроцедуры 

// Функция собирает подразделение и должность физ. лица на указанную дату
//
// Параметры: 
//  ФизЛицо.    - физ. лицо, для которго необходимо получить данные
//  ДатаПериода - дата получения сведений
//  Организация - организация, для которой необходимо получить данные
//
// Возвращаемое значение:
//  Структура с данными.
//
Функция ДолжностьОтветственногоЛицаОрганизации(ФизЛицо, ДатаПериода, Организация) Экспорт

	Результат = Новый Структура("Должность");

	Если ЗначениеЗаполнено(Организация) Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ФизЛицо"    , ФизЛицо);
		Запрос.УстановитьПараметр("ДатаПериода", ДатаПериода);
		Запрос.УстановитьПараметр("Организация", Организация);

		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Работники.Должность.Представление КАК Должность
		|ИЗ
		|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(
		|			&ДатаПериода,
		|			Организация = &Организация
		|				И Сотрудник.Физлицо = &ФизЛицо) КАК Работники
		|
		|УПОРЯДОЧИТЬ ПО
		|	Работники.Период УБЫВ";

		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Результат.Должность = СокрЛП(Выборка.Должность);
		КонецЕсли;
	КонецЕсли;

	Возврат Результат;

КонецФункции // ДолжностьОтветственногоЛицаОрганизации()

#КонецОбласти

#Область ПодпискиНаСобытие
// Проверить уникальность наименования характеристики
Процедура umk_ПроверитьУникальностьХарактеристикиПередЗаписью(Источник, Отказ) Экспорт
	
	Если Источник.ЭтоНовый()  Или Не ЗначениеЗаполнено(Источник.Наименование) Тогда	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХарактеристикиНоменклатуры.Ссылка
		|ИЗ
		|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|ГДЕ
		|	ХарактеристикиНоменклатуры.Владелец = &Владелец
		|	И ХарактеристикиНоменклатуры.Наименование = &Наименование";
		
		Запрос.УстановитьПараметр("Владелец", Источник.Владелец);
		Запрос.УстановитьПараметр("Наименование", Источник.Наименование);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		// Недопускаем не уникальные наименования
		Отказ = Выборка.Следующий();
		// Недопускаем пустые значения
		Если Не Отказ Тогда
			Отказ = Источник.Наименование = "<Свойства не назначены>";
		КонецЕсли;
		
		Если Не Отказ Тогда
			Отказ = Источник.Наименование = "";
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
// Проверка возможности записи (изменения) содержимого регистров с учетом даты запрета изменения данных в зависимоти от типа документа(даты запрета редактирования)
//
Процедура umk_ПередЗаписьюРегистраДатаЗапретаРедактированияПоДокументамПередЗаписью(Источник, Отказ, Замещение) Экспорт
		
	Если Отказ ИЛИ Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроверкаПериодаЗаписейРегистров(Источник, Отказ);
	Если Отказ Тогда
		#Если Клиент Тогда
			Сообщить("Процедура проверки документа УМК. Редактирование данных этого периода запрещено. Изменения не могут быть записаны...", СтатусСообщения.Важное);
		#КонецЕсли
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписьюРегистраДатаЗапретаРедактированияПередЗаписью()

Процедура ПроверкаПериодаЗаписейРегистров(Источник, Отказ)
		
	Регистратор = Источник.Отбор.Регистратор.Значение;
	
	Если ТипЗнч(Регистратор) = Тип("ДокументСсылка.ЗакрытиеМесяца") Тогда
		Возврат
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГраницыЗапрета.ГраницаЗапретаИзменений
		|ИЗ
		|	РегистрСведений.umk_ГраницыЗапретаИзмененияДанных КАК ГраницыЗапрета
		|ГДЕ
		|	ГраницыЗапрета.ДокументОбъектМетаданных = &ИмяМетаданных";
	
	Запрос.УстановитьПараметр("ИмяМетаданных", Строка(ПолучитьМетаданныеДокументаПоСсылке(Регистратор)));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Отказ =  Регистратор.Дата <= КонецДня(Выборка.ГраницаЗапретаИзменений);
			
	КонецЕсли;
	
	//Не устанавливаем запрет если .. 
	
	Если ТипЗнч(Регистратор) = Тип("ДокументСсылка.ОтчетПроизводстваЗаСмену") Тогда
		
		Если Регистратор.Дата <= КонецДня(Выборка.ГраницаЗапретаИзменений) Тогда

		Отказ = Не Регистратор.ИспользоватьМатериалы;
		
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверкаПериодаЗапиДокумента(ДокументОбъект, ФормаДокумента)
	
	ДокументСсылка = ДокументОбъект.Ссылка;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГраницыЗапрета.ГраницаЗапретаИзменений
		|ИЗ
		|	РегистрСведений.umk_ГраницыЗапретаИзмененияДанных КАК ГраницыЗапрета
		|ГДЕ
		|	ГраницыЗапрета.ДокументОбъектМетаданных = &ИмяМетаданных";
	
	Запрос.УстановитьПараметр("ИмяМетаданных", Строка(ПолучитьМетаданныеДокументаПоСсылке(ДокументСсылка)));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ФормаДокумента.ТолькоПросмотр =  ДокументСсылка.Дата <= КонецДня(Выборка.ГраницаЗапретаИзменений);
			
	КонецЕсли;
	
	//Не устанавливаем запрет если .. 
	
	Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ОтчетПроизводстваЗаСмену") Тогда
		
		Если ДокументСсылка.Дата <= КонецДня(Выборка.ГраницаЗапретаИзменений) Тогда
			
			ФормаДокумента.ТолькоПросмотр = Не ДокументОбъект.ИспользоватьМатериалы;
			
		КонецЕсли;
		
	КонецЕсли;

	
КонецПроцедуры

// Функция возвращает метаданные документа, которому принадлежит переданная строка
//
// Параметры
//  СтрокаТабличнойЧасти - ссылка на строку табличной части
//
// Возвращаемое значение:
//   Метаданные - метаданные документа, как оно задано в конфигураторе
//
Функция ПолучитьМетаданныеДокументаПоСсылке(СсылкаНаДокумент) Экспорт

	МетаданныеДокумента = Метаданные.НайтиПоТипу(ТипЗнч(СсылкаНаДокумент));//.Родитель();
	Возврат МетаданныеДокумента;

КонецФункции // ПолучитьМетаданныеДокументаПоСсылкеНаСтроку()

Процедура  ОпределитьДоступностьВозможностьИзмененияДокументаПоДатеЗапретаУМК(ДокументОбъект, ФормаДокумента) Экспорт
	
	ПроверкаПериодаЗапиДокумента(ДокументОбъект, ФормаДокумента);
	
КонецПроцедуры
// Установим последовательно время документа
Процедура umk_УстановитьВремяДокументаПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если Источник.РучнУстановкаВремени Тогда
		Возврат
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		Если РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда
			РежимПроведения = РежимПроведенияДокумента.Неоперативный
		КонецЕсли;
		
		
		Если ТипЗнч(Источник) = Тип("ДокументОбъект.ОтчетПроизводстваЗаСмену") Тогда
			Источник.Дата = НачалоДня(Источник.Дата)  // 0
		ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.КомплектацияНоменклатуры") Тогда
			Если Источник.ВидОперации = Перечисления.ВидыОперацийКомплектацияНоменклатуры.Разукомплектация Тогда 
				//Источник.Дата = НачалоДня(Источник.Дата) + 51060 //14:11
			Иначе
				Источник.Дата = НачалоДня(Источник.Дата) + 3 //0:03 //комплектация 
			КонецЕсли;
		ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда
			Если Источник.umk_ОснованиеПеремещение.umk_ДатаПеремещения Тогда
				Возврат;
			КонецЕсли;
			Источник.Дата = НачалоДня(Источник.Дата) + 50400 // 14:00
		ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ВозвратТоваровОтПокупателя") Тогда
			Если Источник.Дата < '20230901000000' Тогда
				Источник.Дата = НачалоДня(Источник.Дата) // 00:00
			Иначе
				Источник.Дата = НачалоДня(Источник.Дата) + 51000 // 14:10
			КонецЕсли;
		ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ПеремещениеТоваров") Тогда
			Если ЗначениеЗаполнено(Источник.umk_Основание) Тогда
				Источник.Дата = НачалоДня(Источник.Дата) + 1 // 00:01 - Если перемещение по возврату	
			Иначе
				Источник.Дата = НачалоДня(Источник.Дата) + 39600 // 11
			КонецЕсли;
		ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.СписаниеТоваров") Тогда
			Если Источник.Дата < '20230901000000' Тогда
				Источник.Дата = НачалоДня(Источник.Дата) + 43200//12:00
			Иначе
				Источник.Дата = НачалоДня(Источник.Дата) + 51300 //14:25	
			КонецЕсли;
		ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ПоступлениеТоваровУслуг") Тогда
			Источник.Дата = НачалоДня(Источник.Дата) + 1 // 0:01
		ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ЗаказПокупателя") Тогда
			Источник.Дата = НачалоДня(Источник.Дата)//00
		ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ПлатежноеПоручениеВходящее") Тогда
			Источник.Дата = НачалоДня(Источник.Дата) + 50401 // 14:01
		ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ПлатежноеПоручениеИсходящее") Тогда
			Источник.Дата = НачалоДня(Источник.Дата) + 50401 // 14:01
		ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ПутевойЛист") Тогда
			Источник.Дата = НачалоДня(Источник.Дата) + 50401 // 14:01
		КонецЕсли;
		


	КонецЕсли;

КонецПроцедуры
// Записать данные о документе поступления 
Процедура umk_ЗаписатьДопРеквизитыПоПоступлениюПриЗаписи(Источник, Отказ) Экспорт
	
	Для Каждого СтрокаТовары Из Источник.Товары Цикл
		
		Если ЗначениеЗаполнено(СтрокаТовары.Номенклатура)
			И (
			ЗначениеЗаполнено(СтрокаТовары.ВидДокументаУК) ИЛИ
			ЗначениеЗаполнено(СтрокаТовары.НомерУК) ИЛИ
			ЗначениеЗаполнено(СтрокаТовары.ДатаУК) ИЛИ
			ЗначениеЗаполнено(СтрокаТовары.КонечныйСрок) ИЛИ
			ЗначениеЗаполнено(СтрокаТовары.ВидДокументаУК1) ИЛИ
			ЗначениеЗаполнено(СтрокаТовары.НомерУК1) ИЛИ
			ЗначениеЗаполнено(СтрокаТовары.ДатаУК1) ИЛИ
			ЗначениеЗаполнено(СтрокаТовары.КонечныйСрок1) ИЛИ
			ЗначениеЗаполнено(СтрокаТовары.ВидДокументаУК2) ИЛИ
			ЗначениеЗаполнено(СтрокаТовары.НомерУК2) ИЛИ
			ЗначениеЗаполнено(СтрокаТовары.ДатаУК2) ИЛИ
			ЗначениеЗаполнено(СтрокаТовары.КонечныйСрок2) ИЛИ
			ЗначениеЗаполнено(СтрокаТовары.ПримСтр) ИЛИ
			ЗначениеЗаполнено(СтрокаТовары.ПримСтр1) ИЛИ
			ЗначениеЗаполнено(СтрокаТовары.ПримСтр2))
			Тогда
			
			СоздатьЗаписьВРегистре(Источник,СтрокаТовары,СтрокаТовары.Номенклатура, НачалоДня(Источник.Дата));
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
//Добавим запись в регистр
Процедура СоздатьЗаписьВРегистре(Источник, СтрокаТовары, Номенклатура, Период)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	umk_ДопРеквизитыНоменклатурыСрезПоследних.Номенклатура,
		|	umk_ДопРеквизитыНоменклатурыСрезПоследних.БлокироватьВыписку,
		|	umk_ДопРеквизитыНоменклатурыСрезПоследних.БлокироватьПроизводство,
		|	umk_ДопРеквизитыНоменклатурыСрезПоследних.Выход,
		|	umk_ДопРеквизитыНоменклатурыСрезПоследних.ЕстьКодС
		|ИЗ
		|	РегистрСведений.umk_ДопРеквизитыНоменклатуры.СрезПоследних(&Период, Номенклатура = &Номенклатура) КАК umk_ДопРеквизитыНоменклатурыСрезПоследних";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Период", Период);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Запись = РегистрыСведений.umk_ДопРеквизитыНоменклатуры.СоздатьМенеджерЗаписи();
	
	Если Выборка.Следующий() Тогда
		
	    ЗаполнитьЗначенияСвойств(Запись, Выборка);
		ЗаполнитьЗначенияСвойств(Запись, СтрокаТовары);
		
	Иначе
		ЗаполнитьЗначенияСвойств(Запись, СтрокаТовары);
	КонецЕсли;
	Запись.ДокументПоступления = Источник.Ссылка; 
	Запись.Период = Период;
	Запись.Записать(Истина);
	 
КонецПроцедуры

#Область ФормированиеДокументовСписаниеРазукомплектация

//Перед записью возврата покупателя проверяем наличее непроведенных зависимых документов
Процедура ВозвратТовараПроведениеНепроведенныхДокументовПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если Не Источник.Ссылка.Проведен И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокументыВозвратТоваров.ВозвратТовара,
		|	ДокументыВозвратТоваров.ЗависимыйДокумент
		|ИЗ
		|	РегистрСведений.ДокументыВозвратТоваров КАК ДокументыВозвратТоваров
		|ГДЕ
		|	ДокументыВозвратТоваров.ВозвратТовара = &ВозвратТовара
		|	И ДокументыВозвратТоваров.ЗависимыйДокумент.Проведен = ЛОЖЬ
		|	И ДокументыВозвратТоваров.ЗависимыйДокумент.ПометкаУдаления = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("ВозвратТовара", Источник.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Попытка
				Документ = Выборка.ЗависимыйДокумент.ПолучитьОбъект();
				Документ.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				Отказ = Истина;
			КонецПопытки;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

//Проведение
//
Процедура ВозвратТовараСоздатьСписаниеКомплектациюОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	НовыйМеханизмУчетаВозвратаДата =  Константы.НовыйМеханизмУчетаВозврата.Получить();
	ПрименятьНовыйМеханизмУчетаВозврата = ЗначениеЗаполнено(НовыйМеханизмУчетаВозвратаДата) 
	И Источник.Дата >= НовыйМеханизмУчетаВозвратаДата;
	
	Если Источник.НеСоздаватьДокументыСписания Тогда
		Возврат
	КонецЕсли; 

	ПрименятьМеханизм = Константы.ФормироватьДокументыВозврата.Получить();
	
	Если Не ЗначениеЗаполнено(ПрименятьМеханизм) Тогда
		Возврат
	КонецЕсли;
	
	Если Источник.Дата < ПрименятьМеханизм Тогда
		Возврат
	КонецЕсли;
	
	
	ОбновляемДокументы = Ложь;
	МассивДокументов = Новый Массив;
	Подразделение = Справочники.Подразделения.НайтиПоКоду("000000001");
	СтатьяЗатрат = Справочники.СтатьиЗатрат.НайтиПоКоду("100000081");
	
	// Товары для перемещения. Срок годности не истек.
	ТаблицаДляСписания = Новый ТаблицаЗначений;
	ТаблицаДляСписания.Колонки.Добавить("Номенклатура");
	ТаблицаДляСписания.Колонки.Добавить("Количество");
	ТаблицаДляСписания.Колонки.Добавить("ЕдиницаИзмерения");
	ТаблицаДляСписания.Колонки.Добавить("ЕдиницаИзмеренияМест");
	ТаблицаДляСписания.Колонки.Добавить("Коэффициент");
	ТаблицаДляСписания.Колонки.Добавить("Цена");
	ТаблицаДляСписания.Колонки.Добавить("СерияНоменклатуры");
	ТаблицаДляСписания.Колонки.Добавить("ХарактеристикаНоменклатуры");
	ТаблицаДляСписания.Колонки.Добавить("СчетУчетаБУ");
	ТаблицаДляСписания.Колонки.Добавить("Качество");
	ТаблицаДляСписания.Колонки.Добавить("НалоговоеНазначение");
	ТаблицаДляСписания.Колонки.Добавить("НоменклатурнаяПозиция");
	
	ТаблицаРазукомплектаций = ТаблицаДляСписания.Скопировать();
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ *
	|ИЗ
	|	Документ.ВозвратТоваровОтПокупателя.Товары КАК Товары
	|ГДЕ
	|	Товары.Ссылка = &ОбъектСсылка");
	
	Запрос.УстановитьПараметр("ОбъектСсылка", Источник.ссылка);
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		Если ПодлежитРазукомплектации(Источник.Ссылка, Выборка)
			Тогда
			НоваяСтрокаРазукомплектация = ТаблицаРазукомплектаций.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаРазукомплектация, Выборка);
		Иначе
			НоваяСтрокаСписание  = ТаблицаДляСписания.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаСписание, Выборка);
		КонецЕсли;
		
	КонецЦикла;
	
	//Свернем таблицы
	ТаблицаДляСписания.Свернуть("Номенклатура,ЕдиницаИзмерения,ЕдиницаИзмеренияМест,Коэффициент,
	|Цена,СерияНоменклатуры,ХарактеристикаНоменклатуры,СчетУчетаБУ,Качество,НалоговоеНазначение,НоменклатурнаяПозиция","Количество");
	
	ТаблицаРазукомплектаций.Свернуть("Номенклатура,ЕдиницаИзмерения,ЕдиницаИзмеренияМест,Коэффициент,
	|Цена,СерияНоменклатуры,ХарактеристикаНоменклатуры,СчетУчетаБУ,Качество,НалоговоеНазначение,НоменклатурнаяПозиция","Количество");
	
	//Проверяем наличие таблиц
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВозвратТоваровТаблицы.ТаблицаСписания,
	|	ВозвратТоваровТаблицы.ТаблицаКомплектов
	|ИЗ
	|	РегистрСведений.ВозвратТоваровТаблицы КАК ВозвратТоваровТаблицы
	|ГДЕ
	|	ВозвратТоваровТаблицы.ВозвратТовара = &ВозвратТовара";
	
	Запрос.УстановитьПараметр("ВозвратТовара",  Источник.ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		//Сравниваем таблицы
		ТаблицаСписанияКэш = Выборка.ТаблицаСписания.Получить(); 
		ТаблицаКомплектовКэш = Выборка.ТаблицаКомплектов.Получить(); 
		
		Если НастройкаПравДоступа.СравнитьТаблицыНаборовЗаписей(ТаблицаДляСписания, ТаблицаСписанияКэш) И 
			НастройкаПравДоступа.СравнитьТаблицыНаборовЗаписей(ТаблицаРазукомплектаций, ТаблицаКомплектовКэш) Тогда
			КорректирвкаДат(Источник, Отказ,ПрименятьНовыйМеханизмУчетаВозврата);
			Возврат
		Иначе
			ОбновляемДокументы = Истина;	 	
		КонецЕсли; 
	КонецЕсли;
	
	Если ОбновляемДокументы Тогда
		//Удалим все зависимые документы.
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокументыВозвратТоваров.ЗависимыйДокумент КАК Ссылка
		|ИЗ
		|	РегистрСведений.ДокументыВозвратТоваров КАК ДокументыВозвратТоваров
		|ГДЕ
		|	ДокументыВозвратТоваров.ВозвратТовара = &ВозвратТовара
		|	И ДокументыВозвратТоваров.ЗависимыйДокумент.ПометкаУдаления = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("ВозвратТовара",  Источник.ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Документ = Выборка.Ссылка.ПолучитьОбъект();
			Если Документ.Проведен Тогда
				Режим = РежимЗаписиДокумента.ОтменаПроведения;
			Иначе
				Режим = РежимЗаписиДокумента.Запись;
			КонецЕсли;
			Документ.ПометкаУдаления = Истина;
			Попытка
				Документ.Записать(Режим);
			Исключение
				Сообщить(ОписаниеОшибки());
			КонецПопытки;
		КонецЦикла;
		
	КонецЕсли; //удаляем документы
	
	//Обновляем таблицы в регистре
	Запись = РегистрыСведений.ВозвратТоваровТаблицы.СоздатьМенеджерЗаписи();
	Запись.ВозвратТовара = Источник.Ссылка;
	Запись.ТаблицаКомплектов = Новый ХранилищеЗначения(ТаблицаРазукомплектаций);
	Запись.ТаблицаСписания =   Новый ХранилищеЗначения(ТаблицаДляСписания);
	Запись.Записать(Истина);
	
	// Создаем документы
	
	Для Каждого СтрокаТЧ Из ТаблицаРазукомплектаций Цикл 
		
		Комплектация = Документы.КомплектацияНоменклатуры.СоздатьДокумент();
		// Заполнить реквизиты значениями по умолчанию.
		ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(Комплектация, глЗначениеПеременной("глТекущийПользователь"),,,,);
		ОбщегоНазначения.ЗаполнитьОбязательныеРеквизитыШапкиНовогоДокумента(Комплектация, глЗначениеПеременной("глТекущийПользователь"));
		
		Комплектация.ВидОперации = Перечисления.ВидыОперацийКомплектацияНоменклатуры.Разукомплектация;
		ЗаполнитьЗначенияСвойств(Комплектация,СтрокаТЧ);
		Комплектация.Склад = Источник.СкладОрдер;
		
		Если ПрименятьНовыйМеханизмУчетаВозврата Тогда //разукомплектовуем со склада возврат на склад ГП
			Комплектация.Склад = Источник.СкладОрдер;
			Комплектация.СкладМатериалов = Константы.umk_СкладПродукции.Получить();
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Комплектация.Подразделение)  Тогда
		  Комплектация.Подразделение = Подразделение;
		КонецЕсли; 
		
		Комплектация.Дата =  ?(ПрименятьНовыйМеханизмУчетаВозврата,
		НачалоДня(Источник.Дата) + 86460, //Следующим днем в 00-01-00
		НачалоДня(Источник.Дата) + 39601);
		
		НоваяСтрока = Комплектация.Комплектующие.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТЧ,,"ХарактеристикаНоменклатуры");
		НоваяСтрока.ДоляСтоимости = 1;
		Комплектация.ЗаполнитьСчетаУчетаВСтрокеТабЧасти(НоваяСтрока, "КомплектацияНоменклатуры" , Истина, Истина);
		Комплектация.НалоговоеНазначение = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Облагаемая;
		Комплектация.Комментарий = "##СозданАвтоматически##";
		Попытка 
			Комплектация.Записать(РежимЗаписиДокумента.Проведение)
		Исключение
			Сообщить(ОписаниеОшибки());
			Комплектация.Записать(РежимЗаписиДокумента.Запись)
		КонецПопытки;
		
		МассивДокументов.Добавить(Комплектация.Ссылка);
		
	КонецЦикла;
	
	//Списание
	Если Не ТаблицаДляСписания.Количество() = 0 Тогда
		
		Списание = Документы.СписаниеТоваров.СоздатьДокумент();
		// Заполнить реквизиты значениями по умолчанию.
		ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(Списание, глЗначениеПеременной("глТекущийПользователь"),,,,);
		ОбщегоНазначения.ЗаполнитьОбязательныеРеквизитыШапкиНовогоДокумента(Списание, глЗначениеПеременной("глТекущийПользователь"));
		Списание.Комментарий = "##СозданАвтоматически##";
		Списание.Склад = Источник.СкладОрдер;
		Списание.Дата  = Источник.Дата;
		Списание.СчетДт = ПланыСчетов.Хозрасчетный.ОбщепроизводственныеРасходы;
		Списание.СубконтоДт1 = Константы.umk_ОсновноеПодразделениеОрганизации.Получить();
		Списание.СубконтоДт2 = СтатьяЗатрат;
		Списание.umk_Основание = Источник.Ссылка;
		Списание.мУчетнаяПолитикаНУ = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(Списание.Дата, Ложь, Списание.Организация, "Нал");
		ЗаплолнитьТЧТовары(Списание.Товары, ТаблицаДляСписания);
		Попытка 
			Списание.Записать(РежимЗаписиДокумента.Проведение)
		Исключение
			Сообщить(ОписаниеОшибки());
			Списание.Записать(РежимЗаписиДокумента.Запись)
		КонецПопытки;
		
		МассивДокументов.Добавить(Списание.Ссылка);
		
	КонецЕсли;
		
		Для каждого Документ  Из МассивДокументов  Цикл
			Запись = РегистрыСведений.ДокументыВозвратТоваров.СоздатьМенеджерЗаписи();
			Запись.ВозвратТовара = Источник.Ссылка;
			Запись.ЗависимыйДокумент = Документ;
			Запись.Записать(Истина);
		КонецЦикла;
		
		
	КорректирвкаДат(Источник, Отказ,ПрименятьНовыйМеханизмУчетаВозврата);
		
КонецПроцедуры

Процедура КорректирвкаДат(Источник, Отказ, ПрименятьНовыйМеханизмУчетаВозврата)
	
	//Проверим соответствие дат документов
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДокументыВозвратТоваров.ВозвратТовара,
	|	ДокументыВозвратТоваров.ЗависимыйДокумент
	|ИЗ
	|	РегистрСведений.ДокументыВозвратТоваров КАК ДокументыВозвратТоваров
	|ГДЕ
	|	ДокументыВозвратТоваров.ВозвратТовара = &ВозвратТовара";
	
	Запрос.УстановитьПараметр("ВозвратТовара", Источник.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Не НачалоДня(Выборка.ВозвратТовара.Дата) = 
			?(ПрименятьНовыйМеханизмУчетаВозврата, НачалоДня(Выборка.ЗависимыйДокумент.Дата-60*60*24)
			,НачалоДня(Выборка.ЗависимыйДокумент.Дата)) Тогда
			РежимЗаписи = ?(Выборка.ЗависимыйДокумент.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись);
			Попытка
				Документ = Выборка.ЗависимыйДокумент.ПолучитьОбъект();
				Документ.Дата = ?(ПрименятьНовыйМеханизмУчетаВозврата,
				НачалоДня(Выборка.ВозвратТовара.Дата) + 86460, //Следующим днем в 00-01-00
				Выборка.ВозвратТовара.Дата);
				Документ.Записать(РежимЗаписи);
			Исключение
				Отказ = Истина;
			КонецПопытки;
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры


//Отмена проведения
//
Процедура ВозвратТовараОтменаПроведенияСписаниеКомплектациюОбработкаУдаленияПроведения(Источник, Отказ) Экспорт
	
	Если Источник.НеСоздаватьДокументыСписания Тогда
		Возврат
	КонецЕсли; 

	ПрименятьМеханизм = Константы.ФормироватьДокументыВозврата.Получить();
	
	Если Не ЗначениеЗаполнено(ПрименятьМеханизм) Тогда
		Возврат
	КонецЕсли;
	
	Если Источник.Дата < ПрименятьМеханизм Тогда
		Возврат
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДокументыВозвратТоваров.ЗависимыйДокумент КАК Ссылка
	|ИЗ
	|	РегистрСведений.ДокументыВозвратТоваров КАК ДокументыВозвратТоваров
	|ГДЕ
	|	ДокументыВозвратТоваров.ВозвратТовара = &ВозвратТовара
	|	И ДокументыВозвратТоваров.ЗависимыйДокумент.Проведен = ИСТИНА";
	
	Запрос.УстановитьПараметр("ВозвратТовара",  Источник.ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Документ = Выборка.Ссылка.ПолучитьОбъект();
		Документ.ПометкаУдаления = Источник.ПометкаУдаления;
		Попытка
			Документ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаплолнитьТЧТовары(Товары, ТаблицаИсточник)
	
	Для Каждого СтрокаТЧ Из ТаблицаИсточник Цикл
		НоваяСтрока = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
		СтрокаТЧ.НалоговоеНазначение = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Облагаемая;
	КонецЦикла;
	
КонецПроцедуры

функция ПодлежитРазукомплектации(Объект,Выборка)
	
	НовыйМеханизмУчетаВозвратаДата = Константы.НовыйМеханизмУчетаВозврата.Получить();
	
	Если ЗначениеЗаполнено(Выборка.ДокументПартии) Тогда
		
		//Если применяем новый мехнизм, то разукомплектовуем всю продукцию
		Если ЗначениеЗаполнено(НовыйМеханизмУчетаВозвратаДата) И  Объект.Дата >= НовыйМеханизмУчетаВозвратаДата Тогда
			Возврат Истина
		КонецЕсли;
		
		Если (КонецДня(Объект.Дата) - НачалоДня(Выборка.ДокументПартии.Дата)) / 86400 <= Выборка.Номенклатура.umk_СрокГодности
			Тогда
			Возврат Истина
		Иначе
			Возврат Ложь
		КонецЕсли;
		
	Иначе
		Сообщить("В строке: " + (Выборка.НомерСтроки) + " для товара " + Строка(Выборка.Номенклатура) + " на заполнен документ партии.");
		Возврат Ложь
	КонецЕсли
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область Загрузки_mxl_7_7

Функция ПолучитьГруппуХарактеристики(КодГруппы,НаименованиеГруппы)
	
	ГруппаСсылка = Справочники.umk_ГруппыХарактеристик.НайтиПоКоду(КодГруппы);
	
	Если ГруппаСсылка.Пустая() Тогда 
		ГруппаХарактеристик = Справочники.umk_ГруппыХарактеристик.СоздатьЭлемент();
		ГруппаХарактеристик.Наименование = НаименованиеГруппы;
		ГруппаХарактеристик.Код = КодГруппы;
		ГруппаХарактеристик.Записать();
		ГруппаСсылка = ГруппаХарактеристик.Ссылка;
	Иначе
		Если Не ГруппаСсылка.Наименование = НаименованиеГруппы Тогда // Обновим наименование
			ГруппаХарактеристик = ГруппаСсылка.ПолучитьОбъект();
			ГруппаХарактеристик.Наименование = НаименованиеГруппы;
			ГруппаХарактеристик.Записать();
			ГруппаСсылка = ГруппаХарактеристик.Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ГруппаСсылка
	
КонецФункции

Процедура ЗаписатьХарактеристикуДляпечати(ХарактеристикаНоменклатуры, НаименованиеДляПечатиУпак, Период)  Экспорт
	
	//Исключим Вак и Газ, характерно для ВН 
	Если ХарактеристикаНоменклатуры.Наименование = "Вак" Или
		ХарактеристикаНоменклатуры.Наименование = "Газ" Тогда
		Возврат
	КонецЕсли;
	
	// Проверим наличие существующей
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХарактеристикаДляПечати.НаименованиеДляПечати
		|ИЗ
		|	РегистрСведений.umk_ХарактеристикаДляПечати.СрезПоследних(&Период, ХарактеристикаНоменклатуры = &Характеристика) КАК ХарактеристикаДляПечати
		|ГДЕ
		|	ХарактеристикаДляПечати.НаименованиеДляПечати = &НаименованиеДляПечати";
	
	Запрос.УстановитьПараметр("НаименованиеДляПечати", НаименованиеДляПечатиУпак);
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Характеристика", ХарактеристикаНоменклатуры);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат
	Иначе // Если название не совпали то создаем	
		Запись = РегистрыСведений.umk_ХарактеристикаДляПечати.СоздатьМенеджерЗаписи();
		Запись.Период = Период;
		Запись.ХарактеристикаНоменклатуры = ХарактеристикаНоменклатуры;
		Запись.НаименованиеДляПечати = НаименованиеДляПечатиУпак;
		Запись.Записать(Истина);
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьХарактеристику(ТипДок, Период, СтрокаТабличнойЧасти, ВидУпаковки, КодУпаковки, НаименованиеУпак,
	КодГруппыУпаковок,НаименованиеГруппыУпаковок, НаименованиеДляПечатиУпак) Экспорт
	
	Если Не КодУпаковки = ""  И Не КодУпаковки = 0 //26.11.20 замена
		//Если Не ВидУпаковки = "Нет" И Не ВидУпаковки = "" //НаименованиеУпак = "Нет" 
		И ЗначениеЗаполнено(СтрокаТабличнойЧасти.Номенклатура) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХарактеристикиНоменклатуры.Ссылка КАК Упаковка
		|ИЗ
		|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|ГДЕ
		|	ХарактеристикиНоменклатуры.umk_КодУпаковки = &КодУпаковки
		|	И НЕ ХарактеристикиНоменклатуры.umk_КодУпаковки = 0
		|	И ХарактеристикиНоменклатуры.Владелец = &Владелец
		|	И ХарактеристикиНоменклатуры.ПометкаУдаления = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("КодУпаковки", КодУпаковки);
		Запрос.УстановитьПараметр("Владелец", СтрокаТабличнойЧасти.Номенклатура);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		// Упаковка как характеристика
		Если Выборка.Следующий() Тогда
			СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры = Выборка.Упаковка;
			Если НЕ СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры.Наименование = НаименованиеУпак
				Тогда // Обновим наименование характеристики
				Упаковка = Выборка.Упаковка.ПолучитьОбъект();
				Упаковка.Наименование = НаименованиеУпак;
				Упаковка.Записать();
			КонецЕсли;
			
		Иначе
			Упаковка = Справочники.ХарактеристикиНоменклатуры.СоздатьЭлемент();
			Упаковка.Наименование = НаименованиеУпак;
			Упаковка.umk_КодУпаковки = КодУпаковки;
			Упаковка.umk_ГруппаХарактеристики = ПолучитьГруппуХарактеристики(КодГруппыУпаковок,НаименованиеГруппыУпаковок);
			Упаковка.Владелец = СтрокаТабличнойЧасти.Номенклатура; 
			ЗаписатьЗначенияСвойств(Упаковка.Наименование);
			Попытка
				Упаковка.Записать();
			Исключение
				Сообщить(ОписаниеОшибки() + " "  + "Упаковка " + НаименованиеУпак + " не записана.");
			КонецПопытки;
			СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры = Упаковка.Ссылка;
		КонецЕсли;
		
		
		СтрокаТабличнойЧасти.umk_УпаковкаНаПечать = НаименованиеДляПечатиУпак;
		
		// Если Документ Возврат покупателя, то проверим сначала наличие характеристики в самой Расходной накладной
		// Это временно, пока не уйдут старые характеристики. Ключем будет НаименованиеДляПечатиУпак
		Если ТипДок = "ВН" Тогда
			ХарактеристикаРТиУ = НайтиХарактеристикуРТиУ(СтрокаТабличнойЧасти.ДокументПартии,СтрокаТабличнойЧасти.Номенклатура,
			НаименованиеДляПечатиУпак);
			
			Если ЗначениеЗаполнено(ХарактеристикаРТиУ) Тогда											  
				СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры = ХарактеристикаРТиУ; 
			КонецЕсли;
		КонецЕсли;
		
		// Запишем характеристику для печати
		Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры) Тогда
			ЗаписатьХарактеристикуДляпечати(СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры, НаименованиеДляПечатиУпак, Период);
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

//Только для документа Возврат покупателя
//НаименованиеДляПечатиУпак будет ключем связи
Функция НайтиХарактеристикуРТиУ(ДокументПартии, Номенклатура, УпаковкаНаПечать)
	
	ПустаяХарактеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	
	Если Не ЗначениеЗаполнено(ДокументПартии) Или  Не ТипЗнч(ДокументПартии) = Тип("ДокументСсылка.РеализацияТоваровУслуг")
		Тогда
		Возврат ПустаяХарактеристика
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслугТовары.ХарактеристикаНоменклатуры КАК Характеристика
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|ГДЕ
		|	РеализацияТоваровУслугТовары.Ссылка = &Ссылка
		|	И РеализацияТоваровУслугТовары.umk_УпаковкаНаПечать = &УпаковкаНаПечать
		|	И РеализацияТоваровУслугТовары.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Ссылка", ДокументПартии);
	Запрос.УстановитьПараметр("УпаковкаНаПечать", УпаковкаНаПечать);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Характеристика
	Иначе
		Возврат ПустаяХарактеристика	
	КонецЕсли;
	 	
	
КонецФункции

Процедура ЗаписатьЗначенияСвойств(НаименованиеУпак)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НаименованиеУпак",НаименованиеУпак);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ХарактеристикиНоменклатуры.Наименование
		|ИЗ
		|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|ГДЕ
		|	ХарактеристикиНоменклатуры.Наименование = &НаименованиеУпак";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат   // Если уже есть, то не создаем. 
	Иначе
		Значение = Справочники.ЗначенияСвойствОбъектов.СоздатьЭлемент();
		Значение.Наименование = НаименованиеУпак;
		Значение.Владелец = Константы.umk_СвойствоОбъекта.Получить();
		Значение.Записать();
		
	КонецЕсли;
			
КонецПроцедуры

//Номенклатура по коду синхронизации 7.7
Функция НоменклатураПоКодуСинхронизации(КодСинхронизации, Период = Неопределено) Экспорт
	
	Если Период = Неопределено Тогда
		Период = ТекущаяДата();
	КонецЕсли; 
	
	Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДопРеквизитыНоменклатуры.Номенклатура
	|ИЗ
	|	РегистрСведений.umk_ДопРеквизитыНоменклатуры КАК ДопРеквизитыНоменклатуры
	|ГДЕ
	|	ДопРеквизитыНоменклатуры.Период <= &Период
	|	И ДопРеквизитыНоменклатуры.КодСинхронизации = &КодСинхронизации
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДопРеквизитыНоменклатуры.Период УБЫВ";
	
	Запрос.УстановитьПараметр("КодСинхронизации", КодСинхронизации);
	Запрос.УстановитьПараметр("Период", Период);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Номенклатура = Выборка.Номенклатура;
	КонецЕсли;
	
	Возврат Номенклатура
	 	

КонецФункции // Поиск номенклатуры по коду синхронизации 7.7()

//Возвращает код синхронизации номенклатуры с производственной базой на дату 
Функция КодСинхронизацииПоНоменклатуре(Номенклатура, Период = Неопределено) Экспорт
	
	КодСинхронизации = "";
	
	Если Период = Неопределено Тогда
		Период = ТекущаяДата();
	КонецЕсли; 
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	umk_ДопРеквизитыНоменклатурыСрезПоследних.Номенклатура,
	|	umk_ДопРеквизитыНоменклатурыСрезПоследних.КодСинхронизации
	|ИЗ
	|	РегистрСведений.umk_ДопРеквизитыНоменклатуры.СрезПоследних(&Период, Номенклатура = &Номенклатура) КАК umk_ДопРеквизитыНоменклатурыСрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	umk_ДопРеквизитыНоменклатурыСрезПоследних.Период УБЫВ";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Период", Период);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		КодСинхронизации = Выборка.КодСинхронизации;
	КонецЕсли;
	
	Возврат КодСинхронизации	
КонецФункции
 
#КонецОбласти

#Область Отчетов

Функция ПолучитьКонкатенациюРегионов (СсылкаНаОбъект) Экспорт
	
	Направления = "";
	ПерваяСтрока = Истина;
	
	Маршруты = СсылкаНаОбъект.Маршруты;
	
	Для Каждого Строка Из Маршруты Цикл
		
		Направления = Направления + ?(ПерваяСтрока,"",", ") + Строка.Регион;
		ПерваяСтрока = Ложь;
	КонецЦикла;
	
	Возврат Направления;
	
КонецФункции

#КонецОбласти

#Область ПечатьХарактеристики

Функция ПолучитьХарактеристикуДляПечати(Характеристика, Период) Экспорт
	
	Если Период = Неопределено
		Тогда
		Возврат ""
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	umk_ХарактеристикаДляПечатиСрезПоследних.НаименованиеДляПечати КАК Наименование,
		|	umk_ХарактеристикаДляПечатиСрезПоследних.Период
		|ИЗ
		|	РегистрСведений.umk_ХарактеристикаДляПечати.СрезПоследних(&Период, ХарактеристикаНоменклатуры = &Характеристика) КАК umk_ХарактеристикаДляПечатиСрезПоследних
		|
		|УПОРЯДОЧИТЬ ПО
		|	umk_ХарактеристикаДляПечатиСрезПоследних.Период УБЫВ";
	
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Наименование
	Иначе
		Возврат ""	
	КонецЕсли;
	
КонецФункции

//Возвращает данные из РС по номенклатуре МЕДОК
Функция ПолучитьНоменклатуруМЕДОК(СтруктураСтроки) Экспорт
	
	СтруктураРеквизитов = Новый Структура();
	
	Если Не СтруктураСтроки.Свойство("ТипДокумента") Тогда
		 ТипДокумента = Перечисления.ТипДокументаМедок.НН
	 Иначе
		 ТипДокумента = СтруктураСтроки.ТипДокумента;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НаименованиеТоваровМЕДОК.НаименованиеТовара,
		|	НаименованиеТоваровМЕДОК.Цена,
		|	НаименованиеТоваровМЕДОК.КодУКТЗЕД
		|ИЗ
		|	РегистрСведений.umk_НаименованиеТоваровМЕДОК КАК НаименованиеТоваровМЕДОК
		|ГДЕ
		|	НаименованиеТоваровМЕДОК.НомерДок = &НомерДок
		|	И НаименованиеТоваровМЕДОК.ДатаДок = &ДатаДок
		|	И НаименованиеТоваровМЕДОК.НомерСтрокиНН = &НомерСтрокиНН";
	
	Запрос.УстановитьПараметр("ДатаДок", СтруктураСтроки.Дата);
	Запрос.УстановитьПараметр("НомерДок", СтруктураСтроки.Номер);
	Запрос.УстановитьПараметр("НомерСтрокиНН", СтруктураСтроки.НомерСтрокиНН);
	//Запрос.УстановитьПараметр("ТипДокумента", ТипДокумента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Для Каждого Колонка Из РезультатЗапроса.Колонки Цикл
		СтруктураРеквизитов.Вставить(Колонка.Имя, "");
	КонецЦикла;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураРеквизитов,Выборка);
	КонецЕсли;
	
	Возврат СтруктураРеквизитов
	
КонецФункции

#КонецОбласти

#Область ДинамическиеСписки

Функция УдалитьОтбор(СписокОтборов, ИмяПоля = "") Экспорт
	Если ПустаяСтрока(ИмяПоля) Тогда
		СписокОтборов.Элементы.Очистить();
		Возврат Истина;
	КонецЕсли;
	Поле = Новый ПолеКомпоновкиДанных(ИмяПоля);
	ОтборУдален = Ложь;
	Для каждого ЭлементОтбора Из СписокОтборов.Элементы Цикл
		Если ЭлементОтбора.Использование И ЭлементОтбора.ЛевоеЗначение = Поле Тогда
			СписокОтборов.Элементы.Удалить(ЭлементОтбора);
			ОтборУдален = Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат ОтборУдален;
КонецФункции
	
#КонецОбласти

#Область РегламентныхЗаданий

Процедура ПровестиОтложенныеДокументыРТиУ() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.umk_ОтложенноеПроведение = ИСТИНА
		|	И РеализацияТоваровУслуг.ПометкаУдаления = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Попытка
			ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ДокументОбъект.umk_ОтложенноеПроведение = Ложь;
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
		КонецПопытки;	
	КонецЦикла;
	
КонецПроцедуры // ПровестиОтложенныеДокументыРТиУ()

#КонецОбласти
