Перем ПерваяЗапись;

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Если ВидОперации = Перечисления.umk_ВидыОперацийАнализовРеализации.Перемещение
		Тогда
		
		Если ЗначениеЗаполнено(ДокПеремещение) Тогда
			 Перемещение = ДокПеремещение.ПолучитьОбъект(); 
			 Перемещение.Записать(РежимЗаписиДокумента.Проведение);
		КонеЦЕсли;
		
	КонецЕсли;
	
	Если ВидОперации = Перечисления.umk_ВидыОперацийАнализовРеализации.ДоОприходование
		Тогда
		
		ТаблицаОПЗ = Новый ТаблицаЗначений;
		ТаблицаОПЗ.Колонки.Добавить("ОПЗ");
		
		Для Каждого СтрокаТовары Из Товары Цикл
			Если Не ЗначениеЗаполнено(СтрокаТовары.ПриходнаяНакладная) Тогда
				//Сообщить(СтрокаТовары.Продукция)
				Продолжить;
			КонецЕсли;
			
			ДокПоступление  = СтрокаТовары.ПриходнаяНакладная.ПолучитьОбъект();
			
			ПараметрыПоиска = Новый Структура("Номенклатура", СтрокаТовары.Продукция); 
			НайденныеСтроки = ДокПоступление.Продукция.НайтиСтроки(ПараметрыПоиска);
			
			Для Каждого Строка Из НайденныеСтроки Цикл
				
				Строка.Количество =  Строка.Количество + СтрокаТовары.КвоДобавитьПН;
				Строка.КоличествоДоп =  Строка.КоличествоДоп + СтрокаТовары.КвоДобавитьПН;
				Строка.АнализРеализации =  СокрЛП(Строка.АнализРеализации) + СокрЛП(Номер)+ " ("+ Дата + ")" +  ", ";			
				Сообщить("ОПЗ - " + Строка(ДокПоступление) + " ТМЦ: " 
				+ СтрокаТовары.Продукция + " Изменено кво-доб: " 
				+ СтрокаТовары.КвоДобавитьПН);
				ДокПоступление.Записать(РежимЗаписиДокумента.Запись);
				
				НоваяСтрока = ТаблицаОПЗ.Добавить();
				НоваяСтрока.ОПЗ = ДокПоступление.Ссылка;
				
			КонецЦикла;
			
		КонецЦикла;
		
		ТаблицаОПЗ.Свернуть("ОПЗ");
		
		Для Каждого СтрокаОПЗ Из ТаблицаОПЗ Цикл
			
			Документ = СтрокаОПЗ.ОПЗ.ПолучитьОбъект();
			Документ.Записать(РежимЗаписиДокумента.Проведение);
			
		КонецЦикла;
		
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроведения()

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Если ВидОперации = Перечисления.umk_ВидыОперацийАнализовРеализации.Перемещение
		Тогда
		
		Если ЗначениеЗаполнено(ДокПеремещение) Тогда
			 Перемещение = ДокПеремещение.ПолучитьОбъект(); 
			 Перемещение.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		КонеЦЕсли;
		
	КонецЕсли;
	
	Если ВидОперации = Перечисления.umk_ВидыОперацийАнализовРеализации.ДоОприходование
		Тогда
		
		ТаблицаОПЗ = Новый ТаблицаЗначений;
		ТаблицаОПЗ.Колонки.Добавить("ОПЗ");

		Для Каждого СтрокаТовары Из Товары Цикл
			Если Не ЗначениеЗаполнено(СтрокаТовары.ПриходнаяНакладная) Тогда
				Продолжить;
			КонецЕсли;
			
			ДокПоступление  = СтрокаТовары.ПриходнаяНакладная.ПолучитьОбъект();
			
			ПараметрыПоиска = Новый Структура("Номенклатура", СтрокаТовары.Продукция); 
			НайденныеСтроки = ДокПоступление.Продукция.НайтиСтроки(ПараметрыПоиска);
			
			Для Каждого Строка Из НайденныеСтроки Цикл
				
					Строка.Количество =  Строка.Количество - СтрокаТовары.КвоДобавитьПН;
					Если  Строка.Количество = 0 Тогда
						Сообщить("Документ " + Строка(ДокПоступление) + ", в стоке №" + Строка(Строка.НомерСтроки) + " для " + Строка(Строка.Номенклатура) + " количество равно 0.", СтатусСообщения.ОченьВажное);
					КонецЕсли;
					//Строка.Количество = ?(Строка.Количество = 0, КратностьКутера(Строка.Номенклатура, ДокПоступление.Дата), Строка.Количество);
					//Строка.КоличествоДоп =  Строка.КоличествоДоп - СтрокаТовары.КвоДобавитьПН;
					//--- Почистить этот анализ из списка	
					СтрокаЧистить = СокрЛП(Номер)+ " ("+ Дата + ")" +  ", ";
					Строка.АнализРеализации = СтрЗаменить(Строка.АнализРеализации, СтрокаЧистить, "");			
					ДокПоступление.Записать(РежимЗаписиДокумента.Запись);
					Сообщить("Очищена ОПЗ - " + ДокПоступление + " ТМЦ: " 
					+ СтрокаТовары.Продукция + "  удалено кво-доб: "
					+ СтрокаТовары.КвоДобавитьПН);
					
					НоваяСтрока = ТаблицаОПЗ.Добавить();
     				НоваяСтрока.ОПЗ = ДокПоступление.Ссылка;

					
			КонецЦикла;
			
		КонецЦикла;
		
		ТаблицаОПЗ.Свернуть("ОПЗ");
		
		Для Каждого СтрокаОПЗ Из ТаблицаОПЗ Цикл
			
			Документ = СтрокаОПЗ.ОПЗ.ПолучитьОбъект();
			Документ.Записать(РежимЗаписиДокумента.Проведение);
			
		КонецЦикла;
	
	КонецЕсли;	
	
КонецПроцедуры

Функция КратностьКутера(Номенклатура, Период)
	
	КратностьКутера = 0.001;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Объект", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	umk_ДопРеквизитыНоменклатурыСрезПоследних.Выход
		|ИЗ
		|	РегистрСведений.umk_ДопРеквизитыНоменклатуры.СрезПоследних(&Период, Номенклатура = &Объект) КАК umk_ДопРеквизитыНоменклатурыСрезПоследних";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		    КратностьКутера = Выборка.Выход * Номенклатура.umk_КратностьКутера; 
	КонецЕсли;

	Возврат КратностьКутера
	
КонецФункции

Процедура ПриКопировании()
	
   ДокПеремещение = Документы.ПеремещениеТоваров.ПустаяСсылка();	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ПерваяЗапись Тогда
		Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			Отказ = Проведен; // Повторное проведенин
		КонецЕсли;
	КонецЕсли;
	ПерваяЗапись = Ложь;
КонецПроцедуры

ПерваяЗапись = Истина;