
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьПараметрыСписков();
	Элементы.Товары.Обновить();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	УстановитьПараметрыСписков();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовПодвалаФормы
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗапасы
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьДокументКомплектация(Команда)
	
	ДанныеСтроки = Элементы.Комплектации.ТекущиеДанные;
	
	Если ДанныеСтроки = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	ОткрытьФорму("Документ.КомплектацияНоменклатуры.Форма.ФормаДокумента",Новый Структура("Ключ", ДанныеСтроки.Комплектация));
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДокументСписанияКомплекты(Команда)
	
	ДанныеСтроки = Элементы.Комплектации.ТекущиеДанные;
	
	Если ДанныеСтроки = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	ОткрытьФорму("Документ.СписаниеТоваров.Форма.ФормаДокумента",Новый Структура("Ключ", ДанныеСтроки.ДокументСписания));
	
КонецПроцедуры


&НаКлиенте
Процедура ОткрытьДокументСписания(Команда)
	
	ДанныеСтроки = Элементы.Товары.ТекущиеДанные;
	
	Если ДанныеСтроки = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	ОткрытьФорму("Документ.СписаниеТоваров.Форма.ФормаДокумента",Новый Структура("Ключ", ДанныеСтроки.ДокументСписания));

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДокументВозврат(Команда)
	
	ДанныеСтроки = Элементы.Товары.ТекущиеДанные;
	
	Если ДанныеСтроки = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	ОткрытьФорму("Документ.ВозвратТоваровОтПокупателя.Форма.ФормаДокумента",Новый Структура("Ключ", ДанныеСтроки.ВозвратТовара));
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьПараметрыСписков()
	
	//Товары
	Товары.Параметры.УстановитьЗначениеПараметра("НачалоПериода", Период.ДатаНачала);
	Товары.Параметры.УстановитьЗначениеПараметра("ОкончаниеПериода", Период.ДатаОкончания);
	
КонецПроцедуры

&НаКлиенте
Процедура РазукомплектоватьНаСервере(МассивДанных)
	
	ДанныеРазукомплектации = Обработки.ОбработкаСписанныхТоваровИзВозвратныхНакладных.РазукомплектоватьТоварныеПозиции(МассивДанных);
	Комплектации.Очистить();
	
	Для Каждого СтуктураДанных Из ДанныеРазукомплектации.МассивКомплектов Цикл
		НоваяСтрока = Комплектации.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтуктураДанных);
	КонецЦикла;
	
	Элементы.Товары.Обновить();
	
	ОткрытьФорму("Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента",Новый Структура("Ключ", ДанныеРазукомплектации.РеализацияТоваров));
	
КонецПроцедуры

&НаКлиенте
Процедура Разукомплектовать(Команда)
	
	МассивДанных = Новый  Массив;
	
	Для Каждого ВыделеннаяСтрока Из Элементы.Товары.ВыделенныеСтроки Цикл
		
		ДанныеСтроки = Элементы.Товары.ДанныеСтроки(ВыделеннаяСтрока);
		
		Если ДанныеСтроки=Неопределено Тогда
			Продолжить;
		КонецЕсли;

		Данные = Новый Структура("ДокументСписания, ВозвратТовара, Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, Коэффициент, СчетУчетаБУ, Количество, Склад, Дата");
		ЗаполнитьЗначенияСвойств(Данные, ДанныеСтроки);
		МассивДанных.Добавить(Данные);
		
	КонецЦикла;
	
	РазукомплектоватьНаСервере(МассивДанных);
	
КонецПроцедуры


#КонецОбласти

#Область РаботаСПодбором
#КонецОбласти

#Область УправлениеВнешнимВидомФормы
#КонецОбласти

#Область ЗаполнениеОбъектов
#КонецОбласти

#Область ОбработчикиБиблиотек
#КонецОбласти


