
//Устанавливает отбор в форме списка по организации из параметров сеанса.
//**********************************************************************
//форма - формаОбъект
//ИмяСписка - Имя элемента формы.
Процедура УстановитьОтборПоОрганизацииВФормеСписка(Форма, ИмяСписка) Экспорт
	
	ОрганизацияОтбор = umk_ПолныеПрава.ЗначениеОрганизацииДляОтбора();
	
	Если ЗначениеЗаполнено(ОрганизацияОтбор) Тогда
		Форма[ИмяСписка].Отбор.Организация.Установить(ОрганизацияОтбор);
		Форма.ЭлементыФормы[ИмяСписка].НастройкаОтбора["Организация"].Доступность = Ложь;	
	КонецЕсли;
	
КонецПроцедуры


