
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_РеализацияТоваровУслуг_НакладнаяУМК";

	ПечатьНакладной(ТабДокумент, ПараметрКоманды);

	ТабДокумент.ОтображатьСетку = Ложь;
	ТабДокумент.Защита = Истина;
	ТабДокумент.ТолькоПросмотр = Ложь;
	ТабДокумент.ОтображатьЗаголовки = Ложь;
	ТабДокумент.Показать();
	
КонецПроцедуры

&НаСервере
Процедура ПечатьНакладной(ТабДокумент, ПараметрКоманды)
	Документы.РеализацияТоваровУслуг.ПечатьНакладной(ТабДокумент, ПараметрКоманды);
КонецПроцедуры
