
Функция ВернутьВыборкуДокументов(ИмяДокумента, НачалоПериода = Неопределено, ОкончаниеПериода = Неопределено) Экспорт
	
	Возврат umk_Доработки.ПолучитьВыборкуДокументов(ИмяДокумента, НачалоПериода, ОкончаниеПериода);
	
КонецФункции

Функция ВернутьВыборкуСправочников(ИмяСправочника) Экспорт
	
	Возврат umk_Доработки.ПолучитьВыборкуСправочников(ИмяСправочника);

КонецФункции

Функция ВернутьСчетаУчетаНоменклатуры(Номенклатура) Экспорт
	
	Возврат umk_Доработки.ПолучитьСчетУчетаНоменклатуры(Номенклатура);

КонецФункции

Функция ВернутьЦеныНоменклатуры(Номенклатура = Неопределено, Период = Неопределено, ТипЦен = Неопределено) Экспорт
	
	Возврат umk_Доработки.ПолучитьЦеныНоменклатуры(Номенклатура, Период, ТипЦен);
	
КонецФункции

Функция ВернутьТаблицуОстатков(Период, СтрокаСчетов) Экспорт
	
	Возврат umk_Доработки.ПолучитьТаблицуОстатков(Период, СтрокаСчетов)
	
КонецФункции

Функция ВернутьЗначениеКонтактаКонтрагента(Контрагент,ВидКИ) Экспорт
	
	Возврат umk_Доработки.ПолучитьЗначениеКонтактаКонтрагента(Контрагент,ВидКИ);
	
КонецФункции

