
Перем мВалютаРегламентированногоУчета Экспорт;
Перем мУдалятьДвижения;

Перем мУчетнаяПолитикаБУ Экспорт;
Перем мУчетнаяПолитикаНУ Экспорт;
Перем мИспользоватьОборотнуюНоменклатуру Экспорт;
Перем мРазделятьПоСтавкамНДС Экспорт;

Перем ВестиУчетПоДопРазрезамРегл;
Перем ВестиСкладскойУчетБУ;

Перем мТекущийВидСклада Экспорт;



////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

#Если Клиент Тогда
		
// Функция формирует табличный документ с печатной формой накладной,
// разработанной методистами
//
// Возвращаемое значение:
//  Табличный документ - печатная форма накладной
//
Функция ПечатьДокумента()
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПутевойЛист";

	
    Макет = ПолучитьМакет("ПутевойЛист");
 	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПутевойЛист.Дата,
		|	ПутевойЛист.Спидометр,
		|	ПутевойЛист.Автомобиль.НаименованиеПолное КАК Автомобиль,
		|	ПутевойЛист.ДатаВыезда,
		|	ПутевойЛист.ВремяВыезда,
		|	ПутевойЛист.Водитель.ФизЛицо.Ссылка КАК Водитель1,
		|	ПутевойЛист.Водитель2.Физлицо.Ссылка КАК Водитель2,
		|	ПутевойЛист.ТМЦ КАК Горючее,
		|	ПутевойЛист.КвоЗаправлено + ПутевойЛист.КвоЗаправленоА КАК КвоЗаправлено,
		|	ПутевойЛист.КвоКуплено + ПутевойЛист.КвоКупленоА КАК КвоКуплено,
		|	ПутевойЛист.КвоГорючего,
		|	ПутевойЛист.Организация.НаименованиеПолное КАК Организация,
		|	ПутевойЛист.Организация.Ссылка,
		|	ПутевойЛист.КвоЗаправленоА,
		|	ПутевойЛист.КвоКупленоА
		|ИЗ
		|	Документ.ПутевойЛист КАК ПутевойЛист
		|ГДЕ
		|	ПутевойЛист.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Выборка.Следующий();
	
	Шапка = Макет.ПолучитьОбласть("Шапка");
	Шапка.Параметры.Заполнить(Выборка);
	
	Водитель_ = "";
	
	Если ЗначениеЗаполнено(Выборка.Водитель1) Тогда
		
		ДанныеФЛ = ОбщегоНазначения.ДанныеФизЛица(Выборка.ОрганизацияСсылка, Выборка.Водитель1, Выборка.Дата);

		Водитель_ = Водитель_ + ДанныеФЛ.Представление + " №" + 
		ПолучитьНомерДокумента(Выборка.Водитель1, Перечисления.umk_ВидыДокументов.ВП);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Выборка.Водитель2) Тогда
		
		ДанныеФЛ = ОбщегоНазначения.ДанныеФизЛица(Выборка.ОрганизацияСсылка, Выборка.Водитель2, Выборка.Дата);
		
		Водитель_ = Водитель_ + ", " + ДанныеФЛ.Представление + " №" + 
		ПолучитьНомерДокумента(Выборка.Водитель2, Перечисления.umk_ВидыДокументов.ВП);
	КонецЕсли;
	
	Шапка.Параметры.Водитель = Водитель_;
	
	ДатаВремяВыезда = Выборка.ДатаВыезда + 
	(Выборка.ВремяВыезда - НачалоДня(Выборка.ВремяВыезда));
	
	Шапка.Параметры.ДатаВремяВыезда = ДатаВремяВыезда;
	
	//КоличествоГСМ = ОстатокГорючего() + Выборка.КвоЗаправлено + Выборка.КвоКуплено - Выборка.КвоГорючего;  // тут ???
	КоличествоГСМ = Выборка.КвоЗаправлено + Выборка.КвоКуплено;
	
	Шапка.Параметры.КоличествоГСМ = КоличествоГСМ;
	
	ТабДокумент.Вывести(Шапка);
	
	Регион = Макет.ПолучитьОбласть("Регион");
	
	Регион.Параметры.Заполнить(Выборка);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПутевойЛистМаршруты.Регион,
		|	ПутевойЛистМаршруты.КМ,
		|	ПутевойЛистМаршруты.ВесГруза / 1000 КАК ВесГруза
		|ИЗ
		|	Документ.ПутевойЛист.Маршруты КАК ПутевойЛистМаршруты
		|ГДЕ
		|	ПутевойЛистМаршруты.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить();
	
	ТаблицаПоРегионам = Результат.Выгрузить();
	Регион.Параметры.ИтогКМ = ТаблицаПоРегионам.Итог("КМ");
	Регион.Параметры.ВесГруза = ТаблицаПоРегионам.Итог("ВесГруза"); 
	
	ВыборкаПоРегионам = Результат.Выбрать();
	
	Регионы = "";
	
	Пока ВыборкаПоРегионам.Следующий() Цикл
		Регионы = Регионы + ?(ВыборкаПоРегионам.Регион = "","","-") + 
		            СокрЛП(ВыборкаПоРегионам.Регион.Наименование);
	КонецЦикла;
	
	Регион.Параметры.Регионы = Регионы;
	
	ТабДокумент.Вывести(Регион);
	ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	Страница2 = Макет.ПолучитьОбласть("Страница2");
	
	Страница2.Параметры.Заполнить(Выборка);
    Страница2.Параметры.ИтогКМ = ТаблицаПоРегионам.Итог("КМ");
	
	ТабДокумент.Вывести(Страница2);

	
	Возврат ТабДокумент
	
КонецФункции // ПечатьДокумента()

Функция ПолучитьНомерДокумента(ФизЛицо, ВидДокумента)
	 	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	umk_НомераДокументов.Номер
		|ИЗ
		|	РегистрСведений.umk_НомераДокументов КАК umk_НомераДокументов
		|ГДЕ
		|	umk_НомераДокументов.ФизЛицо = &ФизЛицо
		|	И umk_НомераДокументов.ВидыДокументов = &ВидыДокументов";
	
	Запрос.УстановитьПараметр("ВидыДокументов", ВидДокумента);
	Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Выборка.Следующий();
	
	Возврат Выборка.Номер
	
КонецФункции

Функция ОстатокГорючего(Номенклатура) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХозрасчетныйОстатки.КоличествоОстаток
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(
		|			&Дата,
		|			Счет В ИЕРАРХИИ (&Счет),
		|			,
		|			Субконто1 = &Номенклатура" + 
		?(ЗначениеЗаполнено(Склад)," И Субконто2 = &Склад", "") +
        ?(ЗначениеЗаполнено(Партия) И 
		      НЕ Партия = "Партия по умолчанию" ," И Субконто3 = &Партия","") + " ) КАК ХозрасчетныйОстатки";
	
	Запрос.УстановитьПараметр("Дата", КонецДня(Дата));
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Партия", Партия);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Счет", ПланыСчетов.Хозрасчетный.ПроизводственныеЗапасы);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.КоличествоОстаток
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
	
	// Получить экземпляр документа на печать
	Если ИмяМакета = "ПутевойЛист" Тогда
		ТабДокумент = ПечатьДокумента();
	КонецЕсли;
		
	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект), Ссылка);

КонецПроцедуры // Печать

#КонецЕсли

// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	СтруктураМакетов = Новый Структура();
	
	СтруктураМакетов.Вставить("ПутевойЛист"    , "Путевой лист");
	
	Возврат СтруктураМакетов;
	
КонецФункции // ПолучитьСтруктуруПечатныхФорм()

/////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Выгружает результат запроса в табличную часть, добавляет ей необходимые колонки для проведения.
//
// Параметры: 
//  РезультатЗапросаПоТоварам - результат запроса по табличной части "Товары",
//  СтруктураШапкиДокумента   - выборка по результату запроса по шапке документа.
//
// Возвращаемое значение:
//  Сформированная таблица значений.
//
Функция ПодготовитьТаблицуТоваров(СтруктураШапкиДокумента)

	ТаблицаТоваров = Новый ТаблицаЗначений;
	ТаблицаТоваров.Колонки.Добавить("НомерСтроки1");
	ТаблицаТоваров.Колонки.Добавить("Номенклатура");
	ТаблицаТоваров.Колонки.Добавить("ЕдиницаИзмерения");
	ТаблицаТоваров.Колонки.Добавить("Услуга");
	ТаблицаТоваров.Колонки.Добавить("Набор");
	ТаблицаТоваров.Колонки.Добавить("Комплект");
	ТаблицаТоваров.Колонки.Добавить("Количество");
	ТаблицаТоваров.Колонки.Добавить("Цена");
	ТаблицаТоваров.Колонки.Добавить("Сумма");
	ТаблицаТоваров.Колонки.Добавить("НомерСтроки");
	ТаблицаТоваров.Колонки.Добавить("Качество");
	ТаблицаТоваров.Колонки.Добавить("ХарактеристикаНоменклатуры");
	ТаблицаТоваров.Колонки.Добавить("СерияНоменклатуры");
	ТаблицаТоваров.Колонки.Добавить("ЗаказПартии");
	ТаблицаТоваров.Колонки.Добавить("ДокументРезерва");
	ТаблицаТоваров.Колонки.Добавить("ЗаказПокупателя");
	ТаблицаТоваров.Колонки.Добавить("БланкСтрогогоУчета");
	ТаблицаТоваров.Колонки.Добавить("СтавкаНДСВРознице");
	ТаблицаТоваров.Колонки.Добавить("СчетУчетаБУ");
	ТаблицаТоваров.Колонки.Добавить("НоменклатурнаяГруппа");
	ТаблицаТоваров.Колонки.Добавить("Склад");
	ТаблицаТоваров.Колонки.Добавить("ВидСклада");
	ТаблицаТоваров.Колонки.Добавить("НалоговоеНазначение");
	ТаблицаТоваров.Колонки.Добавить("ВидДеятельностиНДС");
	ТаблицаТоваров.Колонки.Добавить("СписыватьТолькоПоЗаказуРегл");
	
	Если ЗначениеЗаполнено(ТМЦ) Тогда
		
		ДобавитьСтрокуТоваров(ТаблицаТоваров, ТМЦ,КвоГорючего,Партия, 1);
				
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТМЦА) Тогда
		
		ДобавитьСтрокуТоваров(ТаблицаТоваров, ТМЦА, КвоАГорючего, ПартияА, 2);
		
	КонецЕсли;
	

	ПодготовитьТаблицуТоваровРегл(ТаблицаТоваров, СтруктураШапкиДокумента);
	ПодготовитьТаблицуТоваровУпр(ТаблицаТоваров, СтруктураШапкиДокумента);

	ТаблицаТоваров.Колонки.Добавить("СуммаПродажная", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15, 2));

	ЕстьРозничныйСклад = УправлениеРозничнойТорговлей.ОпределитьНаличиеРозничногоСклада(ТаблицаТоваров, "Склад", "ВидСклада");
	
	Если ЕстьРозничныйСклад 
		И НЕ СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийСписаниеТоваров.Оборудование Тогда
		ТаблицаПоЦенам = УправлениеРозничнойТорговлей.СформироватьЗапросПоПродажнымЦенам(Дата, ТаблицаТоваров.ВыгрузитьКолонку("Склад"),
		                 ТаблицаТоваров.ВыгрузитьКолонку("Номенклатура")).Выгрузить();

		УправлениеРозничнойТорговлей.ЗаполнитьКолонкуСуммаПродажная(ТаблицаТоваров, ТаблицаПоЦенам, "ВидСклада");
	КонецЕсли;
	
	
 	Возврат ТаблицаТоваров;

КонецФункции // ПодготовитьТаблицуТоваров()

Процедура ДобавитьСтрокуТоваров(ТаблицаТоваров, Номенклатура, Количество, Партия, НомерСтроки)
	
	НоваяСтрока = ТаблицаТоваров.Добавить();
	НоваяСтрока.НомерСтроки1 = НомерСтроки;
	НоваяСтрока.Номенклатура = Номенклатура;
	НоваяСтрока.ЕдиницаИзмерения = Номенклатура.ЕдиницаХраненияОстатков;
	НоваяСтрока.Услуга = Ложь;
	НоваяСтрока.Набор = Ложь;
	НоваяСтрока.Комплект = Ложь;
	НоваяСтрока.Количество = Количество;
	НоваяСтрока.Цена = 0;
	НоваяСтрока.Сумма = 0;
	НоваяСтрока.НомерСтроки = НомерСтроки;
	НоваяСтрока.Качество = Справочники.Качество.Новый;
	НоваяСтрока.ХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	НоваяСтрока.СерияНоменклатуры = Справочники.СерииНоменклатуры.ПустаяСсылка();
	НоваяСтрока.ЗаказПартии = Документы.ЗаказПокупателя.ПустаяСсылка();
	НоваяСтрока.ДокументРезерва = Документы.ЗаказПокупателя.ПустаяСсылка();
	НоваяСтрока.ЗаказПокупателя = Документы.ЗаказПокупателя.ПустаяСсылка();
	НоваяСтрока.БланкСтрогогоУчета = Ложь;
	НоваяСтрока.СтавкаНДСВРознице = Неопределено;
	
	СчетаУчета          = БухгалтерскийУчет.ПолучитьСчетаУчетаНоменклатуры(Организация, Номенклатура, Склад);
	
	НоваяСтрока.СчетУчетаБУ = СчетаУчета.СчетУчетаБУ;
	НоваяСтрока.НоменклатурнаяГруппа = Номенклатура.НоменклатурнаяГруппа;
	НоваяСтрока.Склад = Склад;
	НоваяСтрока.ВидСклада = Склад.ВидСклада;
	НоваяСтрока.НалоговоеНазначение = СчетаУчета.НалоговоеНазначение;
	НоваяСтрока.ВидДеятельностиНДС = Перечисления.ВидыДеятельностиНДС.Облагаемая;
	НоваяСтрока.СписыватьТолькоПоЗаказуРегл = Ложь;

	
КонецПроцедуры


Процедура ПодготовитьТаблицуТоваровУпр(ТаблицаТоваров, СтруктураШапкиДокумента)

КонецПроцедуры

Процедура ПодготовитьТаблицуТоваровРегл(ТаблицаТоваров, СтруктураШапкиДокумента)


	ТаблицаТоваров.Колонки.Добавить("ДокументОприходования");
	ТаблицаТоваров.Колонки.Добавить("Регистратор");
	ТаблицаТоваров.Колонки.Добавить("Организация");
	ТаблицаТоваров.Колонки.Добавить("ДоговорКонтрагента");
	
	ТаблицаТоваров.Колонки.Добавить("КорСчетСписанияБУ");
	ТаблицаТоваров.Колонки.Добавить("КорСубконтоСписанияБУ1");
	ТаблицаТоваров.Колонки.Добавить("КорСубконтоСписанияБУ2");
	ТаблицаТоваров.Колонки.Добавить("КорСубконтоСписанияБУ3");
	
	ТаблицаТоваров.ЗаполнитьЗначения(СтруктураШапкиДокумента.СчетДт, 		"КорСчетСписанияБУ");
	ТаблицаТоваров.ЗаполнитьЗначения(СтруктураШапкиДокумента.СубконтоДт1, 	"КорСубконтоСписанияБУ1");
	ТаблицаТоваров.ЗаполнитьЗначения(СтруктураШапкиДокумента.СубконтоДт2, 	"КорСубконтоСписанияБУ2");
	ТаблицаТоваров.ЗаполнитьЗначения(СтруктураШапкиДокумента.СубконтоДт3, 	"КорСубконтоСписанияБУ3");
	
	ТаблицаТоваров.ЗаполнитьЗначения(ЭтотОбъект,                          		"Регистратор");
	ТаблицаТоваров.ЗаполнитьЗначения(СтруктураШапкиДокумента.Организация, 		"Организация");
	ТаблицаТоваров.ЗаполнитьЗначения(Неопределено,                        		"ДоговорКонтрагента");
	
	ТаблицаТоваров.Колонки.Добавить("НалоговоеНазначениеНовое");
	ТаблицаТоваров.Колонки.Добавить("ХарактерЗатрат");
	ТаблицаТоваров.ЗаполнитьЗначения(СтруктураШапкиДокумента.НалоговоеНазначениеДоходовИЗатрат, 	"НалоговоеНазначениеНовое");
	Для Каждого Строка Из ТаблицаТоваров Цикл
		
		// заполним ХарактерЗатрат, НалоговоеНазначениеНовое
		НалоговыйУчет.ОпределениеАналитикиНалоговогоУчетаВПроводкахДляЗатрат(Строка, Строка.КорСчетСписанияБУ, Строка.ХарактерЗатрат,
														       	Строка.НалоговоеНазначениеНовое, ,                                                                
																Строка.НалоговоеНазначение, Строка.НалоговоеНазначениеНовое, "КорСубконтоСписанияБУ", Ложь, Ложь, Дата
																,,СтруктураШапкиДокумента.ЕстьНДС
																);
		
	КонецЦикла;
	
КонецПроцедуры

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверяется также правильность заполнения реквизитов ссылочных полей документа.
// Проверка выполняется по объекту и по выборке из результата запроса по шапке.
//
// Параметры: 
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении,
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок)

	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = 
	Новый Структура("Организация, Склад");

	Если  СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		
		СтруктураОбязательныхПолей.Вставить("СчетДт");
		
	КонецЕсли;	
	
	// Документ должен принадлежать хотя бы к одному виду учета (управленческий, бухгалтерский, налоговый)
	ОбщегоНазначения.ПроверитьПринадлежностьКВидамУчета(СтруктураШапкиДокумента, Отказ, Заголовок);

	// Вызовем общую процедуру для проверки проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
		
КонецПроцедуры // ПроверитьЗаполнениеШапки()

Процедура ПроверитьЗаполнениеТабличнойЧастиТоварыПоСтрочно(ТаблицаПоТоварам, СтруктураШапкиДокумента, Отказ, Заголовок, СтруктураОбязательныхПолей)

	// нельзя по НДС указывать нехоз. деятельность, а по НП - хоз. деятельность
	Для каждого СтрокаТЧ Из ТаблицаПоТоварам Цикл

		СтрокаНачалаСообщенияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='В строке номер ""%1"" табличной части ""Товары"": ';uk='У рядку номер ""%1"" табличної частини ""Товари"": '"), СокрЛП(СтрокаТЧ.НомерСтроки));

		Если НЕ Отказ  
			И  СтруктураШапкиДокумента.ЕстьНДС 
			И  СтруктураШапкиДокумента.ЕстьНалогНаПрибыльДо2015 Тогда
			
			НехозДеятельностьНДС = (СтрокаТЧ.НалоговоеНазначение = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность);
			НехозДеятельностьНКУ = (НалоговоеНазначениеДоходовИЗатрат = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность);
			
			Если НЕ СтрокаТЧ.НалоговоеНазначение = НалоговоеНазначениеДоходовИЗатрат
				И НехозДеятельностьНДС <> НехозДеятельностьНКУ Тогда 
				СтрокаСообщения = СтрокаНачалаСообщенияОбОшибке + НСтр("ru=' ошибочно указано нехозяйственное налоговое назначение (НДС) и одновременно хозяйственную деятельность по затратам (и наоборот)!';uk=' помилково зазначено негосподарське податкове призначення (ПДВ) і одночасно господарську діяльність по витратам (та навпаки)!'");
				ОбщегоНазначения.СообщитьОбОшибке(СтрокаСообщения);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиТовары

Процедура ПроверитьЗаполнениеТЧПриСписанииНаОЗП(ТаблицаПоТоварам, ИмяТЧ,СтруктураШапкиДокумента, Отказ, Заголовок)

	ХарактерЗатрат = УправлениеПроизводством.ПолучитьХарактерЗатратПоСчетуЗатрат(СтруктураШапкиДокумента.СчетДт,,Дата);
	
	Если НЕ ХарактерЗатрат = "ОПЗ" Тогда
		Возврат;
	КонецЕсли;
	
	СтрокиНехоз = ТаблицаПоТоварам.НайтиСтроки(Новый Структура("НалоговоеНазначение", Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность));
	Для каждого СтрокаНехоз Из СтрокиНехоз Цикл
		
		НомерСтроки = ТаблицаПоТоварам.Индекс(СтрокаНехоз) + 1;
		
		СтрокаНачалаСообщенияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='В строке номер ""%1"" табличной части ""%2"": ';uk='У рядку номер ""%1"" табличної частини ""%2"": '"), СокрЛП(НомерСтроки), ИмяТЧ);
		СтрокаСообщения = СтрокаНачалаСообщенияОбОшибке + НСтр("ru = ' указано нехозяйственное налоговое назначение. Списание на счет ОПЗ - невозможно!'; uk = ' зазначене негосподарське податкове призначення. Списання на рахунок ЗВВ - неможливе!'");	
		
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаСообщения, Отказ, Заголовок);
		
	КонецЦикла;

КонецПроцедуры

// Проверяет правильность заполнения строк табличной части "Бланки".
//
// Параметры:
// Параметры: 
//  ТаблицаПоБланкам        - таблица значений, содержащая данные для проведения и проверки ТЧ Товары
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении.
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиБланкиСтрогогоУчета(ТаблицаПоБланкам, СтруктураШапкиДокумента, Отказ, Заголовок)

	ИмяТабличнойЧасти = "БланкиСтрогогоУчета";

	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура("Номенклатура, Количество");
	
	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		СтруктураОбязательныхПолей.Вставить("СчетУчетаБУ");
		СтруктураОбязательныхПолей.Вставить("СчетУчетаЗабалансовыйБУ");
			
		Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыльДо2015 
			ИЛИ СтруктураШапкиДокумента.ЕстьНДС Тогда
			СтруктураОбязательныхПолей.Вставить("НалоговоеНазначение");  
		КонецЕсли;
	КонецЕсли;

	// Теперь позовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "БланкиСтрогогоУчета",СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	// Здесь наборов быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетНаборов(ЭтотОбъект, "БланкиСтрогогоУчета", ТаблицаПоБланкам, Отказ, Заголовок);

	// Здесь НЕ бланков быть не должно.	
	УправлениеЗапасами.ПроверитьЧтоНетНЕБланковСтрогогоУчета(ЭтотОбъект, "БланкиСтрогогоУчета", ТаблицаПоБланкам, Отказ, Заголовок);
	
	ПроверитьЗаполнениеТЧПриСписанииНаОЗП(ТаблицаПоБланкам, "Бланки", СтруктураШапкиДокумента, Отказ, Заголовок);

КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиТовары()

// По результату запроса по шапке документа формируем движения по регистрам.
//
// Параметры: 
//  РежимПроведения           - режим проведения документа (оперативный или неоперативный),
//  СтруктураШапкиДокумента   - выборка из результата запроса по шапке документа,
//  ТаблицаПоТоварам          - таблица значений, содержащая данные для проведения и проверки ТЧ Товары
//  ТаблицаПоТаре             - таблица значений, содержащая данные для проведения и проверки ТЧ "Возвратная тара",
//  Отказ                     - флаг отказа в проведении,
//  Заголовок                 - строка, заголовок сообщения об ошибке проведения.
//
Процедура ДвиженияПоРегистрам(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, Отказ, Заголовок);
	
	
	// Движения по перемещенным товарам
	// 19.02.19 - уберем, т.к. перемещение сделаем документом Перемещение товаров.
	//Если ЗначениеЗаполнено(КвоЗаправлено) ИЛИ ЗначениеЗаполнено(КвоЗаправленоА) Тогда
	//	ТаблицаПоТоварамПеремещенным = ПодготовитьТаблицуПоТоварамПеремещенным (); 
	//	ДвиженияПоПеремещеннымТоварам(РежимПроведения, ТаблицаПоТоварамПеремещенным, СтруктураШапкиДокумента, Отказ, Заголовок);
	//КонецЕсли;
	//
	
	// Движения по подотчетному лицу
	Если ЗначениеЗаполнено(КвоКуплено) Или ЗначениеЗаполнено(КвоКупленоА) Тогда
		
		ТаблицаПоТоварамПодотчетногоЛица = ПодготовитьТаблицуПоТоварамПодотчетногоЛица(); 
		ДвиженияПоРегистрамПодотчетногоЛица(РежимПроведения, СтруктураШапкиДокумента, 
	                ТаблицаПоТоварамПодотчетногоЛица,
	                Отказ, Заголовок);
		
	КонецЕсли;
	
	// Движения по списанным товарам	

	ДвиженияПоРегистрамУпр(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, Отказ, Заголовок);
	ДвиженияПоТоварамОрганизаций(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, Отказ, Заголовок);
	ДвиженияПоСписаннымТоварам(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам,Отказ, Заголовок);

	ДвиженияПоРегистрамРегл(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, Отказ, Заголовок);
	
	// Проводить по партиям сразу нужно если установлен параметр
	// учетной политики СписыватьПартииПриПроведенииДокументов
	ПроводитьПоПартиям = РегистрыСведений.УчетнаяПолитика.ПолучитьПоследнее(Дата).СписыватьПартииПриПроведенииДокументов;

	Если ТаблицаПоТоварам.Количество()  >0 Тогда

		// Зарегистрируем в последовательности УУ
		Если ОтражатьВУправленческомУчете Тогда
			ЗаписьРегистрации = ПринадлежностьПоследовательностям.ПартионныйУчет.Добавить();
			ЗаписьРегистрации.Период      = Дата;
		КонецЕсли;
	КонецЕсли;

	Если ПроводитьПоПартиям Тогда

		УправлениеЗапасамиПартионныйУчет.ДвижениеПартийТоваров(Ссылка, Движения.СписанныеТовары.Выгрузить());

	Иначе

		// В неоперативном режиме границы последовательностей сдвигаются назад, если они позже документа.
		Если РежимПроведения = РежимПроведенияДокумента.Неоперативный Тогда
			УправлениеЗапасамиПартионныйУчет.СдвигГраницыПоследовательностиПартионногоУчетаНазад(Дата, Ссылка, Организация);
		КонецЕсли;

	КонецЕсли;
		

КонецПроцедуры // ДвиженияПоРегистрам()

#Область ДвиженияПоПеремещениям

Функция ПодготовитьТаблицуПоТоварамПеремещенным()
	
	
	ТаблицаТоваров = Новый ТаблицаЗначений();
	
	ТаблицаТоваров.Колонки.Добавить("БланкСтрогогоУчета");
	ТаблицаТоваров.Колонки.Добавить("ВестиПартионныйУчетПоСериям");
	ТаблицаТоваров.Колонки.Добавить("ВидЗаказаПокупателя");
	ТаблицаТоваров.Колонки.Добавить("ВидОперации");
	ТаблицаТоваров.Колонки.Добавить("ВнутреннийЗаказ");
	ТаблицаТоваров.Колонки.Добавить("ДоговорКонтрагента");
	ТаблицаТоваров.Колонки.Добавить("ДокументРезерва");
	ТаблицаТоваров.Колонки.Добавить("ЕдиницаИзмерения");
	ТаблицаТоваров.Колонки.Добавить("ЗаказПокупателя");
	ТаблицаТоваров.Колонки.Добавить("Качество");
	ТаблицаТоваров.Колонки.Добавить("Количество");
	ТаблицаТоваров.Колонки.Добавить("Комплект");
	ТаблицаТоваров.Колонки.Добавить("КорСубконтоСписанияБУ1");
	ТаблицаТоваров.Колонки.Добавить("КорСубконтоСписанияБУ2");
	ТаблицаТоваров.Колонки.Добавить("КорСубконтоСписанияБУ3");
	ТаблицаТоваров.Колонки.Добавить("КорСчетСписанияБУ");
	ТаблицаТоваров.Колонки.Добавить("НалоговоеНазначение");
	ТаблицаТоваров.Колонки.Добавить("НовыйСчетУчетаБУ");
	ТаблицаТоваров.Колонки.Добавить("НовыйСчетУчетаБУЗабалансовый");
	ТаблицаТоваров.Колонки.Добавить("Номенклатура");
	ТаблицаТоваров.Колонки.Добавить("НоменклатурнаяПозиция");
	ТаблицаТоваров.Колонки.Добавить("НомерСтроки");
	ТаблицаТоваров.Колонки.Добавить("ОбособленныйУчетТоваровПоЗаказамПокупателей");
	ТаблицаТоваров.Колонки.Добавить("Организация");
	ТаблицаТоваров.Колонки.Добавить("РезервБезПраваПродажи");
	ТаблицаТоваров.Колонки.Добавить("СерияНоменклатуры");
	ТаблицаТоваров.Колонки.Добавить("Склад");
	ТаблицаТоваров.Колонки.Добавить("СкладВнутреннегоЗаказа");
	ТаблицаТоваров.Колонки.Добавить("СкладЗаказаПокупателя");
	ТаблицаТоваров.Колонки.Добавить("СкладНовый");
	ТаблицаТоваров.Колонки.Добавить("СтавкаНДСВРознице");
	ТаблицаТоваров.Колонки.Добавить("СуммаВРознице");
	ТаблицаТоваров.Колонки.Добавить("СчетУчетаБУ");
	ТаблицаТоваров.Колонки.Добавить("СчетУчетаБУЗабалансовый");
	ТаблицаТоваров.Колонки.Добавить("Услуга");
	ТаблицаТоваров.Колонки.Добавить("ХарактеристикаНоменклатуры");
	ТаблицаТоваров.Колонки.Добавить("Цена");
	
	
	
	
	
	
	// для проведения по регл. учету
	ТаблицаТоваров.Колонки.Добавить("ДокументОприходования");
	ТаблицаТоваров.Колонки.Добавить("Регистратор");
	ТаблицаТоваров.Колонки.Добавить("СписыватьТолькоПоЗаказуРегл");

	ТаблицаТоваров.ЗаполнитьЗначения(ЭтотОбъект,   "Регистратор");
	ТаблицаТоваров.ЗаполнитьЗначения(Истина,       "СписыватьТолькоПоЗаказуРегл");

	ТаблицаТоваров.Колонки.Добавить("НалоговоеНазначениеНовое", Новый ОписаниеТипов("СправочникСсылка.НалоговыеНазначенияАктивовИЗатрат"));
	
	
	ТаблицаТоваров.Колонки.Добавить("СуммаПродажная", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15, 2));
	
	ВспомогатТаблица = Новый ТаблицаЗначений();
	ВспомогатТаблица.Колонки.Добавить("Номенклатура");
	ВспомогатТаблица.Колонки.Добавить("Количество");
	
	Если ЗначениеЗаполнено(КвоЗаправлено)
		Тогда
		НоваяСтрока = ВспомогатТаблица.Добавить();
		НоваяСтрока.Количество = КвоЗаправлено;
		НоваяСтрока.Номенклатура = ТМЦ;
	КонецЕсли;
	
	
	Если ЗначениеЗаполнено(КвоЗаправленоА)
		Тогда
		НоваяСтрока = ВспомогатТаблица.Добавить();
		НоваяСтрока.Количество = КвоЗаправленоА;
		НоваяСтрока.Номенклатура = ТМЦА;
	КонецЕсли;

	
	    n = 1;
	Для Каждого Строка из ВспомогатТаблица Цикл	
		
		НоваяСтрока = ТаблицаТоваров.Добавить();
		НоваяСтрока.НомерСтроки = n; 
		НоваяСтрока.Номенклатура = Строка.Номенклатура;
		КорСубконтоСписанияБУ1 = Строка.Номенклатура;
		НоваяСтрока.ЕдиницаИзмерения = Строка.Номенклатура.ЕдиницаХраненияОстатков;
		НоваяСтрока.Услуга = Ложь;
		НоваяСтрока.Комплект = Ложь;
		НоваяСтрока.БланкСтрогогоУчета = Ложь;
		НоваяСтрока.Количество = Строка.Количество;
		НоваяСтрока.Цена = 0;   
		НоваяСтрока.Качество = Справочники.Качество.Новый; 
		НоваяСтрока.ХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка(); 
		НоваяСтрока.СерияНоменклатуры = Справочники.СерииНоменклатуры.ПустаяСсылка(); 
		НоваяСтрока.ЗаказПокупателя = Документы.ЗаказПокупателя.ПустаяСсылка();

		СчетаУчета          = БухгалтерскийУчет.ПолучитьСчетаУчетаНоменклатуры(Организация, Строка.Номенклатура, Склад);
		
		НоваяСтрока.СчетУчетаБУ = СчетаУчета.СчетУчетаБУ;  
		НоваяСтрока.НовыйСчетУчетаБУ = СчетаУчета.СчетУчетаБУ;  
		НоваяСтрока.КорСчетСписанияБУ = СчетаУчета.СчетУчетаБУ;
		НоваяСтрока.ВестиПартионныйУчетПоСериям = Ложь;
		НоваяСтрока.СчетУчетаБУЗабалансовый = Ложь;
		НоваяСтрока.НовыйСчетУчетаБУЗабалансовый = Ложь;
		НоваяСтрока.Организация = Организация;
		НоваяСтрока.Склад = СкладПрих;
		НоваяСтрока.СкладНовый = Склад;
		НоваяСтрока.КорСубконтоСписанияБУ2 = Склад;
		
		НоваяСтрока.НалоговоеНазначение = СчетаУчета.НалоговоеНазначение; 
		НоваяСтрока.СписыватьТолькоПоЗаказуРегл = Ложь;

		
		n = n + 1; 
		
	КонецЦикла;
	
	ТаблицаТоваров.ЗагрузитьКолонку(ТаблицаТоваров.ВыгрузитьКолонку("НалоговоеНазначение") , "НалоговоеНазначениеНовое");
	ТаблицаТоваров.ЗаполнитьЗначения(ЭтотОбъект,                          		"Регистратор");

	
    Возврат ТаблицаТоваров	
	
	
КонецФункции

Процедура ДвиженияПоПеремещеннымТоварам(РежимПроведения, ТаблицаПоТоварам, СтруктураШапкиДокумента, Отказ, Заголовок)
	
	//ДвиженияПоРегиструТоварыОрганизацийПеремещение(РежимПроведения, СтруктураШапкиДокумента,ТаблицаПоТоварам, Отказ, Заголовок);
	//ДвиженияПоРегистрамРеглПеремещение(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, Отказ, Заголовок);
	//
	//// Отражение в партионном учете
	//Если СтруктураШапкиДокумента.ВестиПартионныйУчетПоСкладам Тогда
	//	
	//	ДвиженияПоРегиструСписанныеТоварыПеремещение(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, Отказ, Заголовок);
	//	
	//	ТаблицаДвиженийПоСписаннымТоварам = Движения.СписанныеТовары.Выгрузить();
	//	Если ТаблицаДвиженийПоСписаннымТоварам.Количество()>0 Тогда
	//		
	//		// Зарегистрируем в пследовательности
	//		ЗаписьРегистрации = ПринадлежностьПоследовательностям.ПартионныйУчет.Добавить();
	//		ЗаписьРегистрации.Период = Дата; 
	//		
	//		// Проводить по партиям сразу нужно если установлен параметр
	//		// учетной политики СписыватьПартииПриПроведенииДокументов
	//		ПроводитьПоПартиям = РегистрыСведений.УчетнаяПолитика.ПолучитьПоследнее(Дата).СписыватьПартииПриПроведенииДокументов;

	//		Если ПроводитьПоПартиям Тогда
	//			
	//			УправлениеЗапасамиПартионныйУчет.ДвижениеПартийТоваров(Ссылка, ТаблицаДвиженийПоСписаннымТоварам);
	//			
	//		Иначе
	//			
	//			// В неоперативном режиме границы последовательностей сдвигаются назад, если они позже документа.
	//			Если РежимПроведения = РежимПроведенияДокумента.Неоперативный Тогда
	//				УправлениеЗапасамиПартионныйУчет.СдвигГраницыПоследовательностиПартионногоУчетаНазад(Дата, Ссылка, Организация)
	//			КонецЕсли;
	//			
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЕсли;

	//
КонецПроцедуры

Процедура ДвиженияПоРегиструТоварыОрганизацийПеремещение(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, Отказ, Заголовок)
							  
	Если Не СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		Возврат;
	КонецЕсли;
								  
	// ТОВАРЫ ПО РЕГИСТРУ ТоварыОрганизаций. 
	НаборДвижений = Движения.ТоварыОрганизаций;

	// Получим таблицу значений, совпадающую со струкутрой набора записей регистра.
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();

	// Заполним таблицу движений.
	ТаблицаДвижений.ЗаполнитьЗначения(Справочники.Качество.Новый, "Качество");
	
	//Если НЕ СтруктураШапкиДокумента.СуммоваяРозницаОтправитель Тогда
		
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоТоварам, ТаблицаДвижений);	
	
	//КонецЕсли;
	

	// Недостающие поля (качество заполнили в "ПередЗаписью" документа).
	ТаблицаДвижений.ЗаполнитьЗначения(Организация, "Организация");
	ТаблицаДвижений.ЗаполнитьЗначения(Неопределено,"Комиссионер");
	ТаблицаДвижений.ЗаполнитьЗначения(Неопределено, "ХарактеристикаНоменклатуры");
	ТаблицаДвижений.ЗаполнитьЗначения(Неопределено, "СерияНоменклатуры");
	ТаблицаДвижений.ЗаполнитьЗначения(Неопределено, "Качество");
	ТаблицаДвижений.ЗаполнитьЗначения(СкладПрих, "Склад");
	
	
	НаборДвижений.мПериод            = Дата;
	НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;

	// Проверка осатков при оперативном проведении.
	Если РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда
		НаборДвижений.КонтрольОстатков(ЭтотОбъект, "Товары", СтруктураШапкиДокумента, Отказ, Заголовок);
			НаборДвижений.КонтрольОстатков(ЭтотОбъект, "ВозвратнаяТара", СтруктураШапкиДокумента, Отказ, Заголовок);
		НаборДвижений.КонтрольОстатков(ЭтотОбъект, "БланкиСтрогогоУчета", СтруктураШапкиДокумента, Отказ, Заголовок);
	КонецЕсли;

	Если Не Отказ Тогда
		Движения.ТоварыОрганизаций.ВыполнитьРасход();
	КонецЕсли;
	
	ТаблицаДвижений.Очистить();
	
	КопияТаблицыПоТоварам = ТаблицаПоТоварам.Скопировать();
		
	КопияТаблицыПоТоварам.Колонки.СчетУчетаБУ.Имя = "СтарыйСчетУчетаБУ";
	
	КопияТаблицыПоТоварам.Колонки.НовыйСчетУчетаБУ.Имя = "СчетУчетаБУ";
		
	// Заполним таблицу движений.
	
	ТаблицаДвижений.ЗаполнитьЗначения(Справочники.Качество.Новый, "Качество");
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(КопияТаблицыПоТоварам, ТаблицаДвижений);


	// Недостающие поля (качество заполнили в "ПередЗаписью" документа).
	ТаблицаДвижений.ЗаполнитьЗначения(Организация, "Организация");
	ТаблицаДвижений.ЗаполнитьЗначения(Неопределено,"Комиссионер");
	
	
	ТаблицаДвижений.ЗаполнитьЗначения(Неопределено, "ХарактеристикаНоменклатуры");
	ТаблицаДвижений.ЗаполнитьЗначения(Неопределено, "СерияНоменклатуры");
	ТаблицаДвижений.ЗаполнитьЗначения(Неопределено, "Качество");
	
	ТаблицаДвижений.ЗаполнитьЗначения(Склад, "Склад");
	
	
	НаборДвижений.мПериод            = Дата;
	НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;
	
	Если Не Отказ Тогда
		Движения.ТоварыОрганизаций.ВыполнитьПриход();
	КонецЕсли;
	
КонецПроцедуры

Процедура ДвиженияПоРегиструСписанныеТоварыПеремещение(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварамИсходная, Отказ, Заголовок)

	// ТОВАРЫ ПО РЕГИСТРУ СписанныеТовары.
	Если Не СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда
		Возврат;
	КонецЕсли;
	
	//НомерСтрокиРегистра = 0;
	//Если НЕ СтруктураШапкиДокумента.СуммоваяРозницаОтправитель Тогда
	//	НаборДвижений = Движения.СписанныеТовары;

	//	// Получим таблицу значений, совпадающую со струкутрой набора записей регистра.
	//	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();

	//	// Заполним таблицу движений.
	//	
	//	ТаблицаПоТоварам = ТаблицаПоТоварамИсходная.Скопировать();

	//	// Удалим строки с документами резерва по ордерам
	//	НомерСтр=0;
	//	Пока НомерСтр<ТаблицаПоТоварам.Количество() Цикл
	//		Если ТаблицаПоТоварам[НомерСтр].РезервБезПраваПродажи=Истина Тогда
	//			ТаблицаПоТоварам.Удалить(НомерСтр);
	//		Иначе
	//			НомерСтр=НомерСтр+1;
	//		КонецЕсли;
	//	КонецЦикла;

	//	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоТоварам, ТаблицаДвижений);
	//	
	//	Для Каждого Строка Из ТаблицаПоТоварам Цикл
	//		
	//		Движение = ТаблицаДвижений[ТаблицаПоТоварам.Индекс(Строка)];
	//		
	//		Если Строка.ОбособленныйУчетТоваровПоЗаказамПокупателей=Истина 
	//			ИЛИ Строка.ВидЗаказаПокупателя = Перечисления.ВидыОперацийЗаказПокупателя.Переработка
	//            Тогда         
	//            Движение.ЗаказПартии = Строка.ДокументРезерва;
	//			Движение.ЗаказСписания = Строка.ДокументРезерва;
	//		КонецЕсли;
	//					
	//	КонецЦикла;
	//	
	//	ТаблицаДвижений.ЗаполнитьЗначения(Истина, "СписыватьТолькоПоЗаказу");
	//	
	//	// Недостающие поля.
	//	Для каждого Строка Из ТаблицаДвижений Цикл
	//		
	//		НомерСтрокиРегистра = НомерСтрокиРегистра+1;
	//		Строка.НомерСтрокиДокумента = НомерСтрокиРегистра;
	//		Строка.ВидТабличнойЧасти = Перечисления.ВидыТабличныхЧастей.Товары;
	//	
	//	КонецЦикла;

	//	ТаблицаДвижений.ЗаполнитьЗначения(СкладПрих,"СкладОтправитель");
	//	ТаблицаДвижений.ЗаполнитьЗначения(Склад,"СкладПолучатель");

	//	ТаблицаДвижений.ЗаполнитьЗначения(Дата,"Период");
	//	ТаблицаДвижений.ЗаполнитьЗначения(Ссылка,"Регистратор");
	//	ТаблицаДвижений.ЗаполнитьЗначения(Истина,"Активность");

	//	
	//		ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.СтатусыПартийТоваров.Купленный,"ДопустимыйСтатус1");
	//		ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.СтатусыПартийТоваров.Продукция,"ДопустимыйСтатус2");
	//		ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.СтатусыПартийТоваров.ВПереработку,"ДопустимыйСтатус3");
	//		
	//	ТаблицаДвижений.ЗаполнитьЗначения(Подразделение,"Подразделение");

	//	ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.КодыОперацийПартииТоваров.ПеремещениеМеждуСкладами,"КодОперацииПартииТоваров");

	//	// Если Партионный учет по складам  в упр учете
	//	Если СтруктураШапкиДокумента.ВестиПартионныйУчетПоСкладам Тогда
	//		ТаблицаДвижений.ЗаполнитьЗначения(ОтражатьВУправленческомУчете,"ОтражатьВУправленческомУчете");
	//	КонецЕсли;

	//	

	//	НаборДвижений.мПериод            = Дата;
	//	НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;

	//	Если Не Отказ Тогда
	//		Движения.СписанныеТовары.ВыполнитьДвижения();
	//	КонецЕсли;
	//	
	//КонецЕсли;
	//
	//
	//// Если Партионный учет по складам  в упр учете
	//Если СтруктураШапкиДокумента.ВестиПартионныйУчетПоСкладам Тогда
	//	ТаблицаДвижений.ЗаполнитьЗначения(ОтражатьВУправленческомУчете,"ОтражатьВУправленческомУчете");
	//КонецЕсли;

	//
	//НаборДвижений.мПериод          = Дата;
	//НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;

	//Если Не Отказ Тогда
	//	Движения.СписанныеТовары.ВыполнитьДвижения();
	//КонецЕсли;
	//
	//Если Движения.СписанныеТовары.Модифицированность() Тогда
	//    Движения.СписанныеТовары.Записать(Истина);
	//КонецЕсли;
	//
КонецПроцедуры

Процедура ДвиженияПоРегистрамРеглПеремещение(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, Отказ, Заголовок)
	
	Если Не СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
	
		Возврат;	
	
	КонецЕсли;
		
	УправлениеЗапасамиПартионныйУчет.ДвижениеПартийТоваров(Ссылка, ТаблицаПоТоварам, , Ложь, СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете, , , Отказ, ,"Перемещение ТМЦ");				
				
	
КонецПроцедуры

#КонецОбласти

#Область ДвижениеПоПодотчетномуЛицу

Функция ПодготовитьТаблицуПоТоварамПодотчетногоЛица();
	
	ТаблицаТоваров = Новый ТаблицаЗначений();
	
	ТаблицаТоваров.Колонки.Добавить("БезПраваПродажи");
	ТаблицаТоваров.Колонки.Добавить("БланкСтрогогоУчета");
	ТаблицаТоваров.Колонки.Добавить("ВедениеВзаиморасчетов");
	ТаблицаТоваров.Колонки.Добавить("ВестиПартионныйУчетПоСериям");
	ТаблицаТоваров.Колонки.Добавить("ВестиПоДокументамРасчетовСКонтрагентомРегл");
	ТаблицаТоваров.Колонки.Добавить("ВидДеятельностиНДС");
	ТаблицаТоваров.Колонки.Добавить("ВидСклада");
	ТаблицаТоваров.Колонки.Добавить("Внешнеэкономический");
	ТаблицаТоваров.Колонки.Добавить("ДоговорКонтрагента");
	ТаблицаТоваров.Колонки.Добавить("ДокументПолучения");
	ТаблицаТоваров.Колонки.Добавить("ЕдиницаИзмерения");
	ТаблицаТоваров.Колонки.Добавить("Заказ");
	ТаблицаТоваров.Колонки.Добавить("Количество");
	ТаблицаТоваров.Колонки.Добавить("Комплект");
	ТаблицаТоваров.Колонки.Добавить("Контрагент");
	ТаблицаТоваров.Колонки.Добавить("НДС");
	ТаблицаТоваров.Колонки.Добавить("Набор");
	ТаблицаТоваров.Колонки.Добавить("НалоговоеНазначение");
	ТаблицаТоваров.Колонки.Добавить("НеОтноситьНаЗатратыПоНУ");
	ТаблицаТоваров.Колонки.Добавить("Номенклатура");
	ТаблицаТоваров.Колонки.Добавить("НоменклатурнаяПозиция");
	ТаблицаТоваров.Колонки.Добавить("НомерСтроки");
	ТаблицаТоваров.Колонки.Добавить("ОбособленныйУчетТоваровПоЗаказамПокупателей");
	ТаблицаТоваров.Колонки.Добавить("ОрганизацияДокументаПолучения");
	ТаблицаТоваров.Колонки.Добавить("ПриходныйОрдерСклад");
	ТаблицаТоваров.Колонки.Добавить("Сделка");
	ТаблицаТоваров.Колонки.Добавить("СделкаОрганизация");
	ТаблицаТоваров.Колонки.Добавить("СерияНоменклатуры");
	ТаблицаТоваров.Колонки.Добавить("Склад");
	ТаблицаТоваров.Колонки.Добавить("СкладЗаказаПокупателя");
	ТаблицаТоваров.Колонки.Добавить("СложныйНалоговыйУчет");
	ТаблицаТоваров.Колонки.Добавить("СтавкаНДС");
	ТаблицаТоваров.Колонки.Добавить("СтатьяДекларацииПоЕдиномуНалогу");
	ТаблицаТоваров.Колонки.Добавить("Сумма");
	ТаблицаТоваров.Колонки.Добавить("СуммаНДСПропорциональноКредит");
	ТаблицаТоваров.Колонки.Добавить("СчетУчетаБУ");
	ТаблицаТоваров.Колонки.Добавить("СчетУчетаБУЗаб");
	ТаблицаТоваров.Колонки.Добавить("СчетУчетаНДС");
	ТаблицаТоваров.Колонки.Добавить("Услуга");
	ТаблицаТоваров.Колонки.Добавить("ХарактеристикаНоменклатуры");
	ТаблицаТоваров.Колонки.Добавить("Амортизируется");
	ТаблицаТоваров.Колонки.Добавить("ДляХозяйственнойДеятельности");
	ТаблицаТоваров.Колонки.Добавить("ПроводкиСуммаБезНДСРегл");
	ТаблицаТоваров.Колонки.Добавить("ПроводкиСуммаНДСРегл");
	ТаблицаТоваров.Колонки.Добавить("СписыватьТолькоПоЗаказуРегл");
	

	
	ВспомогатТаблица = Новый ТаблицаЗначений();
	
	ВспомогатТаблица.Колонки.Добавить("Номенклатура");
	ВспомогатТаблица.Колонки.Добавить("Количество");
	ВспомогатТаблица.Колонки.Добавить("Сумма");
    ВспомогатТаблица.Колонки.Добавить("НДС");
	ВспомогатТаблица.Колонки.Добавить("СтавкаНДС");
	ВспомогатТаблица.Колонки.Добавить("Склад");
	
	
	Если ЗначениеЗаполнено(КвоКуплено)
		Тогда
		
		НоваяСтрока = ВспомогатТаблица.Добавить();
		НоваяСтрока.Количество = КвоКуплено;
		НоваяСтрока.Номенклатура = ТМЦ;
		НоваяСтрока.Сумма = СуммаПокупки; 
		НоваяСтрока.НДС = НДС; 
		НоваяСтрока.СтавкаНДС = ВидНДС;
		НоваяСтрока.Склад = Склад;
		
	КонецЕсли;
	
	
	Если ЗначениеЗаполнено(КвоКупленоА)
		Тогда
		
		НоваяСтрока = ВспомогатТаблица.Добавить();
		НоваяСтрока.Количество = КвоКупленоА;
		НоваяСтрока.Номенклатура = ТМЦА;
		НоваяСтрока.Сумма = СуммаПокупкиА; 
		НоваяСтрока.НДС = НДСА; 
		НоваяСтрока.СтавкаНДС = ВидНДС;
		НоваяСтрока.Склад = Склад;

	КонецЕсли;

	
	n = 1;
	Для Каждого Строка из ВспомогатТаблица Цикл	
		
		НоваяСтрока = ТаблицаТоваров.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Строка);
		
		НоваяСтрока.НомерСтроки = n;
		НоваяСтрока.НоменклатурнаяПозиция = Справочники.НоменклатурныеПозиции.ПустаяСсылка();
		НоваяСтрока.Амортизируется	= Ложь;	
		НоваяСтрока.БланкСтрогогоУчета = Ложь;	
		НоваяСтрока.ВестиПартионныйУчетПоСериям = Ложь;
		НоваяСтрока.ВидДеятельностиНДС	= Перечисления.ВидыДеятельностиНДС.Облагаемая;
		НоваяСтрока.ВидСклада =	Склад.ВидСклада;	
		НоваяСтрока.Внешнеэкономический = Ложь;	
		НоваяСтрока.ДляХозяйственнойДеятельности = Истина;	
		НоваяСтрока.ЕдиницаИзмерения = Строка.Номенклатура.ЕдиницаХраненияОстатков;
		НоваяСтрока.Комплект = Ложь;	
		НоваяСтрока.Набор = Ложь;
		НоваяСтрока.НеОтноситьНаЗатратыПоНУ = Ложь;	
		НоваяСтрока.СложныйНалоговыйУчет = Ложь;
		
		СчетаУчета = БухгалтерскийУчет.ПолучитьСчетаУчетаНоменклатуры(Организация, Строка.Номенклатура, Строка.Склад);
		
		НоваяСтрока.СчетУчетаБУ = СчетаУчета.СчетУчетаБУ;	
		НоваяСтрока.СчетУчетаБУЗаб = Ложь;	
		НоваяСтрока.СчетУчетаНДС = ПланыСчетов.Хозрасчетный.НалоговыйКредитНеподтвержденный;
		НоваяСтрока.НалоговоеНазначение = СчетаУчета.НалоговоеНазначение;
		НоваяСтрока.Услуга = Ложь;	
		НоваяСтрока.ПроводкиСуммаБезНДСРегл =  НоваяСтрока.Сумма -НоваяСтрока.НДС;
		НоваяСтрока.ПроводкиСуммаНДСРегл = НоваяСтрока.НДС;
		НоваяСтрока.СписыватьТолькоПоЗаказуРегл = Ложь;		
		
		n = 1;
		
	КонецЦикла;
	
	Возврат ТаблицаТоваров;
	
	
КонецФункции // По товарам подотчетного лица

Процедура ДвиженияПоРегистрамПодотчетногоЛица(РежимПроведения, СтруктураШапкиДокумента, 
	                ТаблицаПоТоварам,
	                Отказ, Заголовок);

	ДвиженияПоРегиструТоварыОрганизацийПодотчетногоЛица(РежимПроведения, СтруктураШапкиДокумента,
	                ТаблицаПоТоварам,
	                Отказ, Заголовок);
			
	ДвиженияПоРегистрамБухгалтерииПодотчетногоЛица(РежимПроведения, СтруктураШапкиДокумента, 
	                        ТаблицаПоТоварам,
	                        Отказ, Заголовок);
												
	
КонецПроцедуры // ДвиженияПоРегистрам()
						
			
Процедура ДвиженияПоРегиструТоварыОрганизацийПодотчетногоЛица(РежимПроведения, СтруктураШапкиДокумента, 
	ТаблицаПоТоварам, Отказ, Заголовок);
	
	Если Не СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		Возврат;
	КонецЕсли;

	// ТОВАРЫ И ТАРА ПО РЕГИСТРУ ТоварыОрганизаций.
	НаборДвижений = Движения.ТоварыОрганизаций;
		
	// Получим таблицу значений, совпадающую со струкутрой набора записей регистра.
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
		
	// Заполним таблицу движений.
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоТоварам, ТаблицаДвижений);
	ТаблицаДвижений.ЗаполнитьЗначения(Справочники.Качество.Новый, "Качество");
		
	// Недостающие поля.
	ТаблицаДвижений.ЗаполнитьЗначения(Организация, "Организация");
	ТаблицаДвижений.ЗаполнитьЗначения(Неопределено,"Комиссионер");
	
	ТаблицаДвижений.ЗаполнитьЗначения(Неопределено, "ХарактеристикаНоменклатуры");
	ТаблицаДвижений.ЗаполнитьЗначения(Неопределено, "СерияНоменклатуры");
	ТаблицаДвижений.ЗаполнитьЗначения(Неопределено, "Качество");
	
	НаборДвижений.мПериод            = Дата;
	НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;
		
	Если Не Отказ Тогда
		Движения.ТоварыОрганизаций.ВыполнитьПриход();
	КонецЕсли;
	
КонецПроцедуры
						
Процедура ДвиженияПоРегистрамБухгалтерииПодотчетногоЛица(РежимПроведения, СтруктураШапкиДокумента, 
		                          ТаблицаПоТоварам, Отказ, Заголовок);

	Если НЕ СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
	    // документ не отражается в регл. учете
		Возврат;	
	
	КонецЕсли;							  
								  
	ВалютаРег = мВалютаРегламентированногоУчета;

	// Формирование проводок.
	ПроводкиБУ = Движения.Хозрасчетный;
	
    СчетРасчетовСПодотчетником = ПланыСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицамиВНациональнойВалюте;

	ДатаДок      = Дата;
		
	// Проводки по товарам
	Для каждого СтрокаТаблицы Из ТаблицаПоТоварам Цикл

		Проводка = ПроводкиБУ.Добавить();

		Проводка.Период      = ДатаДок;
		Проводка.Организация = СтруктураШапкиДокумента.Организация;
		Проводка.Содержание  = "Оприходованы ТМЦ";

		Проводка.СчетДт      = СтрокаТаблицы.СчетУчетаБУ;
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,"Номенклатура", СтрокаТаблицы.Номенклатура,Истина, Заголовок);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,"НоменклатурныеПозиции", СтрокаТаблицы.НоменклатурнаяПозиция);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,"Склады",       СтрокаТаблицы.Склад);
		
		Проводка.НалоговоеНазначениеДт = СтрокаТаблицы.НалоговоеНазначение;
		
			
		Проводка.КоличествоДт = СтрокаТаблицы.Количество;

		Проводка.Сумма = СтрокаТаблицы.ПроводкиСуммаБезНДСРегл;

		Проводка.СчетКт = СчетРасчетовСПодотчетником;
		Проводка.СубконтоКт.РаботникиОрганизаций = Водитель.ФизЛицо;


		// Проводки по НДС
		Если СтрокаТаблицы.ПроводкиСуммаНДСРегл<>0 Тогда

			Проводка = ПроводкиБУ.Добавить();

			Проводка.Период      = Дата;
			Проводка.Организация = СтруктураШапкиДокумента.Организация;

			Проводка.СчетДт      = СтрокаТаблицы.СчетУчетаНДС;
			//ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,"Контрагенты",        СтрокаТаблицы.Контрагент  , Истина, Заголовок);
			//ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,"Договоры",        	 СтрокаТаблицы.ДоговорКонтрагента  , Истина, Заголовок);
			//ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,"ДокументыРасчетовСКонтрагентами", НалоговыйУчет.ОпределитьСделкуНалоговыйУчет(СтрокаТаблицы, Ссылка, СтрокаТаблицы.Сделка));
			
			Проводка.СчетКт      = СчетРасчетовСПодотчетником;
			Проводка.СубконтоКт.РаботникиОрганизаций  = Водитель.ФизЛицо;
			
			Проводка.Сумма       = СтрокаТаблицы.ПроводкиСуммаНДСРегл;
			Проводка.Содержание  = "НДС (товары)";

		КонецЕсли;
		
		КонецЦикла;
	
КонецПроцедуры // ДвиженияПоРегистрамБухгалтерии()
								
#КонецОбласти


Процедура ДвиженияПоРегистрамУпр(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, Отказ, Заголовок)

КонецПроцедуры

Функция  УдалитьСтрокиНеТребующиеСписаниеИзТоваровКПередаче(ТабТовары)
	ТабРезерв = ТабТовары.Скопировать();
	
	Сч = 0;
	Пока Сч < ТабРезерв.Количество() Цикл
		СтрокаТаблицы = ТабРезерв.Получить(Сч);
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДокументРезерва) 
		 ИЛИ (ТипЗнч(СтрокаТаблицы.ДокументРезерва) <> Тип("ДокументСсылка.РеализацияТоваровУслуг")
			   И ТипЗнч(СтрокаТаблицы.ДокументРезерва) <> Тип("ДокументСсылка.ПеремещениеТоваров"))Тогда
			ТабРезерв.Удалить(СтрокаТаблицы);
		Иначе
			Сч = Сч + 1;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТабРезерв;

КонецФункции

Процедура ДвиженияПоТоварамОрганизаций(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, Отказ, Заголовок)

	Если НЕ СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		Возврат;
	КонецЕсли;
	
	Если СтруктураШапкиДокумента.СуммоваяРозница Тогда
		Возврат;
	КонецЕсли;
	
	// ТОВАРЫ ПО РЕГИСТРУ ТоварыОрганизаций.
	НаборДвижений = Движения.ТоварыОрганизаций;

	// Получим таблицу значений, совпадающую со струкутрой набора записей регистра.
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();

	// Заполним таблицу движений.
	ТаблицаДвижений.ЗаполнитьЗначения(Справочники.Качество.Новый, "Качество");
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоТоварам, ТаблицаДвижений);

	// Недостающие поля.
	ТаблицаДвижений.ЗаполнитьЗначения(Организация, "Организация");
	ТаблицаДвижений.ЗаполнитьЗначения(Неопределено,"Комиссионер");
	ТаблицаДвижений.ЗаполнитьЗначения(СтруктураШапкиДокумента.Склад, "Склад");

	Если Не ВестиУчетПоДопРазрезамРегл Тогда
		ТаблицаДвижений.ЗаполнитьЗначения(Неопределено, "ХарактеристикаНоменклатуры");
		ТаблицаДвижений.ЗаполнитьЗначения(Неопределено, "СерияНоменклатуры");
		ТаблицаДвижений.ЗаполнитьЗначения(Неопределено, "Качество");
	КонецЕсли;
		
	Если Не ВестиСкладскойУчетБУ Тогда
		ТаблицаДвижений.ЗаполнитьЗначения(Неопределено, "Склад");
	КонецЕсли;
	
	НаборДвижений.мПериод          = Дата;
	НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;

	// Проверка осатков при оперативном проведении.
	Если РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда
		//НаборДвижений.КонтрольОстатков(ЭтотОбъект, "Товары", СтруктураШапкиДокумента, Отказ, Заголовок);
	КонецЕсли;

	Если Не Отказ Тогда
		Движения.ТоварыОрганизаций.ВыполнитьРасход();
	КонецЕсли;
	
КонецПроцедуры

Процедура ДвиженияПоСписаннымТоварам(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, Отказ, Заголовок)

	Если Не СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда
		Возврат;
	КонецЕсли;
	
	
	
КонецПроцедуры

Процедура ДвиженияПоРегистрамРегл(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам,  Отказ, Заголовок)
	
	Если НЕ СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		Возврат;	
	КонецЕсли;
	
	ПроводкиБУ   = Движения.Хозрасчетный;
	
	Граница = Новый Граница(Ссылка.Дата,ВидГраницы.Включая);			
	УправлениеЗапасамиПартионныйУчет.ДвижениеПартийТоваров(Ссылка, ТаблицаПоТоварам, , Ложь, СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете, , , Отказ,,,,Истина);	
			
		
КонецПроцедуры

////////////////////////////////////////////////Движения по товарам перемещенным////////////////////////////////////////// 

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события "ОбработкаЗаполнения".
//
Процедура ОбработкаЗаполнения(Основание)

КонецПроцедуры // ОбработкаЗаполнения()

Процедура ПриКопировании(ОбъектКопирования)
	 ПеремещениеЗапр = Документы.ПеремещениеТоваров.ПустаяСсылка();
КонецПроцедуры

// Процедура вызывается перед записью документа 
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	СоздатьДокументПеремещение(Отказ, РежимЗаписи);

	мУдалятьДвижения = НЕ ЭтоНовый();
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
КонецПроцедуры // ПередЗаписью

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	
	// Дерево значений, содержащее имена необходимых полей в запросе по шапке.
	Перем ДеревоПолейЗапросаПоШапке;
	
	// Выполним проверку реквизитов необхоимых для проведения
	ТекстОшибки = "";
	ВыполнитьПроверкуРеквизитов(Отказ, ТекстОшибки);
	
	#Если Клиент Тогда
		Если Отказ Тогда
			Текст = "Ошибка проведения документа. " + ТекстОшибки;
		    Сообщить(Текст, СтатусСообщения.Важное);
		КонецЕсли;
	#КонецЕсли	


	Если мУдалятьДвижения Тогда
		ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;

	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(СтруктураШапкиДокумента);
	
	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда		
		ПроверкаАктуальностиУчета(СтруктураШапкиДокумента, Заголовок);
	КонецЕсли;

	// Заполним по шапке документа дерево параметров, нужных при проведении.
	ДеревоПолейЗапросаПоШапке = ОбщегоНазначения.СформироватьДеревоПолейЗапросаПоШапке();
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Константы",        "ВалютаУправленческогоУчета",                 "ВалютаУправленческогоУчета");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Константы",        "КурсВалютыУправленческогоУчета",             "КурсВалютыУправленческогоУчета");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "УчетнаяПолитика" , "ВестиПартионныйУчетПоСкладам",               "ВестиПартионныйУчетПоСкладам");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Склад",            "ВидСклада",                                  "ВидСклада");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Склад",            "СуммовойУчет",                      		 "СуммоваяРозница");

	// Сформируем запрос на дополнительные параметры, нужные при проведении, по данным шапки документа
	СтруктураШапкиДокумента = УправлениеЗапасами.СформироватьЗапросПоДеревуПолей(ЭтотОбъект, ДеревоПолейЗапросаПоШапке, СтруктураШапкиДокумента, мВалютаРегламентированногоУчета);

	// Получим данные учетной политики
	ПодготовитьПараметрыУчетнойПолитики(СтруктураШапкиДокумента, Отказ, Заголовок);

	// Проверим правильность заполнения шапки документа
	ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок);

	// Подготовим таблицы для проведения.
	ТаблицаПоТоварам = ПодготовитьТаблицуТоваров(СтруктураШапкиДокумента);
	

	// Движения по документу
	Если Не Отказ Тогда
		ДвиженияПоРегистрам(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам,  Отказ, Заголовок);
	КонецЕсли;
	
	Движения.Хозрасчетный.ВыполнитьДействияПередЗаписьюДвижений();
	
	// Движения по регистру Показания Спидометра
	ПоказанияСпидометра = Движения.umk_ПоказанияСпидометраАвто;
	Движение = ПоказанияСпидометра.Добавить();
	Движение.Период = Дата;
	Движение.ОсновноеСредство = Автомобиль;
	Движение.ПоказаниеСпидометра = СпидометрПр; // по приезду
	Движение.Регистратор = Ссылка;
	Движение.Активность = Истина;
	
	Движения.Хозрасчетный.Записывать = Истина;
	Движения.ТоварыОрганизаций.Записывать = Истина;
	Движения.СписанныеТовары.Записывать = Истина;
	Движения.ПартииТоваровНаСкладах.Записывать = Истина;	
	Движения.umk_ПоказанияСпидометраАвто.Записывать = Истина;
	
КонецПроцедуры // ОбработкаПроведения()

// Выполним проверку реквизитов необхоимых для проведения
Процедура ВыполнитьПроверкуРеквизитов(Отказ, Текст)
	
	Текст = "";
	
	ТМЦ_  =  ЗначениеЗаполнено(ТМЦ);
	ТМЦА_ =  ЗначениеЗаполнено(ТМЦА);
	
	КвоГорючего_  = ЗначениеЗаполнено(КвоГорючего);
	КвоАГорючего_ = ЗначениеЗаполнено(КвоАГорючего);
	
	КвоЗаправлено_  = ЗначениеЗаполнено(КвоЗаправлено);
	КвоЗаправленоА_ = ЗначениеЗаполнено(КвоЗаправленоА);
	
	СкладПрих_ = ЗначениеЗаполнено(СкладПрих);
	
	КвоКуплено_  = ЗначениеЗаполнено(КвоКуплено);
	КвоКупленоА_ = ЗначениеЗаполнено(КвоКупленоА);
	
	СуммаПокупки_ = ЗначениеЗаполнено(СуммаПокупки);
	СуммаПокупкиА_ = ЗначениеЗаполнено(СуммаПокупкиА);
		
	Если  (КвоГорючего_ 
		ИЛИ КвоЗаправлено_  
		ИЛИ КвоКуплено_) И
		ТМЦ_ = Ложь
		Тогда
		Отказ = Истина;
		Текст = "Не заполнен реквизит ""Топливо"" .";
		Возврат;
	КонецЕсли;
	
	Если  (КвоАГорючего_ 
		ИЛИ КвоЗаправленоА_  
		ИЛИ КвоКупленоА_) И
		ТМЦА_ = Ложь
		Тогда
		Отказ = Истина;
		Текст = "Не заполнен реквизит ""Топливо альт."" .";
		Возврат;
	КонецЕсли;
	
	Если  (КвоЗаправлено_ 
		ИЛИ КвоЗаправленоА_) И
		СкладПрих_ = Ложь
		Тогда
		Отказ = Истина;
		Текст = "Не заполнен реквизит ""Склад прихода"" .";
		Возврат;
	КонецЕсли;
	
	Если  КвоКуплено_  И
		СуммаПокупки_ = Ложь
		Тогда
		Отказ = Истина;
		Текст = "Не заполнен реквизит ""Сумма"" .";
		Возврат;
	КонецЕсли;
	
	Если  КвоКупленоА_  И
		СуммаПокупкиА_ = Ложь
		Тогда
		Отказ = Истина;
		Текст = "Не заполнен реквизит ""Сумма альт."" .";
		Возврат;
	КонецЕсли;
	
	Если НЕ ТМЦ_
		И НЕ ТМЦА_
		Тогда
		Отказ = Истина;
		Текст = "Не заполнены реквизиты ""Топливо"" .";
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Заправка ГСМ
Процедура СоздатьДокументПеремещение(Отказ, РежимЗаписи) Экспорт
		
	Если (НЕ ЗначениеЗаполнено(КвоЗаправлено) ИЛИ  НЕ ЗначениеЗаполнено(КвоЗаправленоА)) // Убрали топливо. Уберем перемещение.
		И ЗначениеЗаполнено(ПеремещениеЗапр) Тогда 
		
		ПеремещениеОбъект = ПеремещениеЗапр.ПолучитьОбъект();
		ПеремещениеОбъект.Товары.Очистить();
		
		Попытка
			ПеремещениеОбъект.Записать(РежимЗаписи);
		Исключение
			Сообщить("Не удалось записать документ Перемещение товаров.", СтатусСообщения.Важное);
			Отказ = Истина;
		КонецПопытки;
	КонецЕсли;
	
	// Создадим перемещение.
	
	Если ЗначениеЗаполнено(КвоЗаправлено) ИЛИ  ЗначениеЗаполнено(КвоЗаправленоА) Тогда 
		
		Если НЕ ЗначениеЗаполнено(ПеремещениеЗапр) Тогда
			ПеремещениеОбъект = Документы.ПеремещениеТоваров.СоздатьДокумент();
		Иначе
			ПеремещениеОбъект = ПеремещениеЗапр.ПолучитьОбъект();
		КонецЕсли;	
		
		ПеремещениеОбъект.Дата = НачалоДня(Дата);
		
		// Заполнить реквизиты значениями по умолчанию.
		ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ПеремещениеОбъект, глЗначениеПеременной("глТекущийПользователь"));
		ОбщегоНазначения.ЗаполнитьОбязательныеРеквизитыШапкиНовогоДокумента(ПеремещениеОбъект, глЗначениеПеременной("глТекущийПользователь"));
		ПеремещениеОбъект.ВидОперации      = Перечисления.ВидыОперацийПеремещениеТоваров.ТоварыПродукция;
		
		ПеремещениеОбъект.СкладОтправитель = СкладПрих;
		ПеремещениеОбъект.СкладПолучатель  = Склад;
		ПеремещениеОбъект.Комментарий = "##Путевой лист. Заправка ГСМ.##";
		ПеремещениеОбъект.Товары.Очистить();
		
		Если ЗначениеЗаполнено(КвоЗаправлено) тогда
			ДобавитьСтрокуВПеремещение(ПеремещениеОбъект, КвоЗаправлено, ТМЦ);	
		КонецЕсли;
		
		Если ЗначениеЗаполнено(КвоЗаправленоА) тогда
			ДобавитьСтрокуВПеремещение(ПеремещениеОбъект, КвоЗаправленоА, ТМЦА)
		КонецЕсли;
			
	
	Попытка
		ПеремещениеОбъект.Записать(РежимЗаписи);
		ПеремещениеЗапр = ПеремещениеОбъект.Ссылка;
	Исключение
		Сообщить("Не удалось записать документ Перемещение товаров.", СтатусСообщения.Важное);
		Отказ = Истина;
	КонецПопытки;
	
	КонецЕсли;

		
КонецПроцедуры

Процедура ДобавитьСтрокуВПеремещение(ПеремещениеОбъект, Количество, Номенклатура)
	
	СтрокаТабличнойЧасти = ПеремещениеОбъект.Товары.Добавить();
	СтрокаТабличнойЧасти.Номенклатура = Номенклатура;
	СтрокаТабличнойЧасти.Количество = Количество;
	// Выполнить общие действия для всех документов при изменении номенклатуры.
	ОбработкаТабличныхЧастей.ПриИзмененииНоменклатурыТабЧасти(СтрокаТабличнойЧасти, ПеремещениеОбъект);
	
	// Берем из самого реквизита Номенклатура
	СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтрокаТабличнойЧасти.Номенклатура.ЕдиницаХраненияОстатков;
	СтрокаТабличнойЧасти.Коэффициент      = СтрокаТабличнойЧасти.ЕдиницаИзмерения.Коэффициент;
	
	ОбработкаТабличныхЧастей.ЗаполнитьЕдиницуМестТабЧасти(СтрокаТабличнойЧасти, ПеремещениеОбъект);
	СтрокаТабличнойЧасти.Качество = Справочники.Качество.Новый;
    	
	ПеремещениеОбъект.ЗаполнитьСчетаУчетаВСтрокеТабЧасти(СтрокаТабличнойЧасти, "Товары", ПеремещениеОбъект.ОтражатьВБухгалтерскомУчете, ПеремещениеОбъект.ОтражатьВБухгалтерскомУчете);
	СтрокаТабличнойЧасти.НалоговоеНазначение = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Облагаемая;
	
КонецПроцедуры

// Процедура определяет параметры учетной политики
//
Процедура ПодготовитьПараметрыУчетнойПолитики(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	УчетнаяПолитикаНеЗадана = Ложь;
	мУчетнаяПолитикаБУ = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(Ссылка.Дата, УчетнаяПолитикаНеЗадана, Ссылка.Организация, "Бух");

	УчетнаяПолитикаНеЗадана = Ложь;
	мУчетнаяПолитикаНУ = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(Ссылка.Дата, УчетнаяПолитикаНеЗадана, Ссылка.Организация, "Нал");
		
	СтруктураШапкиДокумента.Вставить("ЕстьНалогНаПрибыльДо2015", мУчетнаяПолитикаНУ.ЕстьНалогНаПрибыльДо2015);
	СтруктураШапкиДокумента.Вставить("ЕстьНДС", 			мУчетнаяПолитикаНУ.ЕстьНДС);
	
КонецПроцедуры // ПодготовитьПараметрыУчетнойПолитики()

Процедура ПроверкаАктуальностиУчета(СтруктураШапкиДокумента, Заголовок)
	
	Если Константы.НеИспользоватьДатуАктуальностиУчета.Получить() ИЛИ НЕ Константы.ИнформироватьЕслиУчетНеАктуален.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	МассивРазделовУчета = Новый Массив;
	// в каких видах учета должен отражаться документ
	МассивРазделовУчета.Добавить(Перечисления.РазделыУчета.ОценкаМПЗ);
	ОбщегоНазначения.СообщитьОНеактуальностиУчета(СтруктураШапкиДокумента, МассивРазделовУчета, Заголовок);

КонецПроцедуры

Процедура ОбновитьПараметрыУчетнойПолитики(Дата,Организация, СообщатьОбОшибке = Истина) Экспорт 
	
	УчетнаяПолитикаНеЗадана = Ложь;
	мУчетнаяПолитикаБУ = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(Ссылка.Дата, УчетнаяПолитикаНеЗадана, Ссылка.Организация, "Бух", СообщатьОбОшибке);

	УчетнаяПолитикаНеЗадана = Ложь;
	мУчетнаяПолитикаНУ = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(Ссылка.Дата, УчетнаяПолитикаНеЗадана, Ссылка.Организация, "Нал", СообщатьОбОшибке);

	БУ = ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ.ПолучитьОбъект();
	мИспользоватьОборотнуюНоменклатуру = ?(БУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура, "ВидСубконто") = Неопределено, Ложь, Истина);
	мРазделятьПоСтавкамНДС  = ?(БУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтавкиНДС, "ВидСубконто") = Неопределено, Ложь, Истина);

	БУ = ПланыСчетов.Хозрасчетный.ТоварыНаСкладе.ПолучитьОбъект();

	ВестиСкладскойУчетБУ  = ?(БУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Склады, "ВидСубконто") = Неопределено, Ложь, Истина);
	ВестиУчетПоДопРазрезамРегл  = ?(БУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеПозиции, "ВидСубконто") = Неопределено, Ложь, Истина);

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);

КонецПроцедуры

мВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");

ОбновитьПараметрыУчетнойПолитики(Ссылка.Дата,Ссылка.Организация, Ложь);
