
Перем мВалютаРегламентированногоУчета Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

#Если Клиент Тогда	
// Функция формирует табличный документ с печатной формой накладной,
// разработанной методистами
//
// Возвращаемое значение:
//  Табличный документ - печатная форма накладной
//
Функция ПечатьДокумента()
	
	ТабДокумент = Новый ТабличныйДокумент; 
	
	Возврат ТабДокумент;

КонецФункции // ПечатьДокумента()

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
	
	// Получить экземпляр документа на печать
	Если ИмяМакета = "ПланПродаж" Тогда
		ТабДокумент = ПечатьДокумента();	
	КонецЕсли;

	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект), Ссылка);

КонецПроцедуры // Печать
#КонецЕсли

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события "ОбработкаЗаполнения".
//
Процедура ОбработкаЗаполнения(Основание)
	
	Если Не Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(Основание)) ИЛИ Основание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	

	Если ТипЗнч(Основание) = Тип("ДокументСсылка.АнализРеализации")  Тогда

		Если Не Основание.ВидОперации = Перечисления.umk_ВидыОперацийАнализовРеализации.Перемещение
			Тогда
			Возврат
		КонецЕсли;
		
		// Заполним реквизиты из стандартного набора по документу основанию.
		ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание);

		ЗаполнитьПоДокументуАнализРеализации(Основание);
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаЗаполнения()

// Заполняет документ на основании Анализа реализации
Процедура ЗаполнитьПоДокументуАнализРеализации(Основание)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Основание",Основание);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АнализРеализацииТовары.Продукция КАК Номенклатура,
		|	АнализРеализацииТовары.Продукция.ЕдиницаХраненияОстатков КАК ЕдиницаИзмерения,
		|	АнализРеализацииТовары.Продукция.ЕдиницаХраненияОстатков.Коэффициент КАК Коэффициент,
		|	АнализРеализацииТовары.КвоПереместить КАК Количество,
		|	АнализРеализацииТовары.КвоПереместить КАК Остаток,
		|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20) КАК СтавкаНДС
		|ИЗ
		|	Документ.АнализРеализации.Товары КАК АнализРеализацииТовары
		|ГДЕ
		|	АнализРеализацииТовары.Ссылка = &Основание
		|	И АнализРеализацииТовары.КвоПереместить <> 0";
	
	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	ТаблицаРезультат.Колонки.Добавить("СлучайныйПорядок");
	НачальноеЧисло = 0;
	
	Для Каждого СтрокаТабл Из ТаблицаРезультат Цикл
		ГенираторЧисел = Новый ГенераторСлучайныхЧисел(НачальноеЧисло);
		СтрокаТабл.СлучайныйПорядок = 	ГенираторЧисел.СлучайноеЧисло();	
		НачальноеЧисло = НачальноеЧисло + 1;
	КонецЦикла;
	
	ТаблицаРезультат.Сортировать("СлучайныйПорядок");
	
	Товары.Загрузить(ТаблицаРезультат);
	
КонецПроцедуры

// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	СтруктураМакетов = Новый Структура();
	
	СтруктураМакетов.Вставить("ПланПродажКасса"    , "План продаж касса");
	
	Возврат СтруктураМакетов;
	
КонецФункции // ПолучитьСтруктуруПечатныхФорм()

Процедура СформироватьЧеки() Экспорт
	
	МассивЧеков = МассивСлучайныхЧеков();
	
	Для Каждого  Счетчик  Из МассивЧеков Цикл
		ИмяКолонки = "н" + Строка(Счетчик);
		Если Товары.Итог(ИмяКолонки) = 0 Тогда
			Продолжить
		Иначе //Создадим документ
			ЧекККМ = Документы.ЧекККМ.СоздатьДокумент();
			ЧекККМ.Дата = Дата;
			// Заполнить реквизиты значениями по умолчанию.
			ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЧекККМ, глЗначениеПеременной("глТекущийПользователь"), мВалютаРегламентированногоУчета, "Продажа");
			ЧекККМ.ТипЦен = ТипЦен;
			СтрокаОплаты = ЧекККМ.Оплата.Добавить();
			СтрокаОплаты.ВидОплаты = Справочники.ВидыОплатЧекаККМ.Наличные;
			Для Каждого СтрокаТовары Из Товары Цикл
				Если СтрокаТовары[ИмяКолонки] = 0 Тогда
					Продолжить
				КонецЕсли;
				НоваяСтрока =  ЧекККМ.Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТовары, "Номенклатура,ХарактеристикаНоменклатуры,ЕдиницаИзмерения, Цена");
				НоваяСтрока.Количество = СтрокаТовары[ИмяКолонки];
				НоваяСтрока.Коэффициент = 1;
				ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(НоваяСтрока, ЧекККМ);
			КонецЦикла;
			СтрокаОплаты.Сумма = ЧекККМ.Товары.Итог("Сумма");
			ЧекККМ.Записать(РежимЗаписиДокумента.Запись);
			Распределено[Счетчик-1].СуммаЧека = СтрокаОплаты.Сумма;	
		КонецЕсли;
	КонецЦикла;   
	
КонецПроцедуры

Функция МассивСлучайныхЧеков()
	
	ТаблицаЧеков = Новый ТаблицаЗначений;
	ТаблицаЧеков.Колонки.Добавить("НомерЧека");
	ТаблицаЧеков.Колонки.Добавить("СлучайныйПорядок");
	
	ГенираторЧисел = Новый ГенераторСлучайныхЧисел();
	
	Для Каждого СтрокаТЧ Из Распределено Цикл
		СлучайныйПорядок = 	ГенираторЧисел.СлучайноеЧисло(1,101);
		НоваяСтрока =  ТаблицаЧеков.Добавить();
		НоваяСтрока.НомерЧека = СтрокаТЧ.НомерСтроки;
		НоваяСтрока.СлучайныйПорядок = СлучайныйПорядок;
	КонецЦикла;
	
	ТаблицаЧеков.Сортировать("СлучайныйПорядок");
	
	Возврат ТаблицаЧеков.ВыгрузитьКолонку("НомерЧека");
	
КонецФункции

мВалютаРегламентированногоУчета   = глЗначениеПеременной("ВалютаРегламентированногоУчета");
