
Процедура УстановитьПлановыеЦены()Экспорт
	
	НачатьТранзакцию();
	
	// Таблица мат. затрат
	Запрос = Новый Запрос("ВЫБРАТЬ
		|	ВложенныйЗапрос.Ссылка КАК Ссылка,
		|	ВложенныйЗапрос.Продукция,
		|	ВложенныйЗапрос.КоличествоПродукции,
		|	ВЫБОР
		|		КОГДА ВложенныйЗапрос.КоличествоПродукции = 0
		|			ТОГДА 0
		|		ИНАЧЕ СУММА(ХозрасчетныйОборотыДтКт.СуммаОборот) / ВложенныйЗапрос.КоличествоПродукции
		|	КОНЕЦ КАК Цена,
		|	ХозрасчетныйОборотыДтКт.СуммаОборот КАК СуммаОборот
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(&ДатаНачала, &ДатаОкончания, Регистратор, СчетДт В ИЕРАРХИИ (&Счет23), , , , ) КАК ХозрасчетныйОборотыДтКт
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ТребованиеНакладная.umk_Продукция КАК Продукция,
		|			ТребованиеНакладная.umk_КоличествоПродукции КАК КоличествоПродукции,
		|			ТребованиеНакладная.Ссылка КАК Ссылка
		|		ИЗ
		|			Документ.ТребованиеНакладная КАК ТребованиеНакладная
		|		ГДЕ
		|			ТребованиеНакладная.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|			И ТребованиеНакладная.Проведен = ИСТИНА) КАК ВложенныйЗапрос
		|		ПО ХозрасчетныйОборотыДтКт.Регистратор = ВложенныйЗапрос.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.Продукция,
		|	ВложенныйЗапрос.КоличествоПродукции,
		|	ВложенныйЗапрос.Ссылка,
		|	ХозрасчетныйОборотыДтКт.СуммаОборот
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка");
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаОкончания));
	Запрос.УстановитьПараметр("Счет23", ПланыСчетов.Хозрасчетный.Производство);
	
	ТаблицаМатЗатрат = Запрос.Выполнить().Выгрузить();
	
	// Установим фактические цены Для Выпуска продукции
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ОтчетПроизводстваЗаСмену.Ссылка
		|ИЗ
		|	Документ.ОтчетПроизводстваЗаСмену КАК ОтчетПроизводстваЗаСмену
		|ГДЕ
		|	ОтчетПроизводстваЗаСмену.ПометкаУдаления = ЛОЖЬ
		|	И ОтчетПроизводстваЗаСмену.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания");
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаОкончания));
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Продукция = ДокОбъект.Продукция;
		
		УстановитьЦену(Продукция, ТаблицаМатЗатрат, Выборка.Ссылка);
		
		РежимЗаписи = ?(ДокОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись);
		
		ДокОбъект.Записать(РежимЗаписи);
		
		Состояние(ДокОбъект.ссылка);
		
	КонецЦикла;
	
	#Если Клиент Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Ответ = Вопрос("Сохранить изменения документов в базе?", Режим, 0);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			ЗафиксироватьТранзакцию();
		Иначе
			ОтменитьТранзакцию();
		КонецЕсли;
	#Иначе
		ЗафиксироватьТранзакцию();
	#КонецЕсли

	
КонецПроцедуры

Процедура УстановитьЦену(Продукция, ТаблицаМатЗатрат, Ссылка)
	
	Стоимость_91_на_кг = ПолучитьСтоимостьОПРНаЕдПродукции();
	
	Для Каждого СтрокаТЧ Из Продукция Цикл
		
		Параметры = Новый Структура("Продукция", СтрокаТЧ.Номенклатура);
		СтрокиПоиска = ТаблицаМатЗатрат.НайтиСтроки(Параметры);
		
		Если СтрокиПоиска.Количество() = 0 Тогда
			Сообщить("Не найдена стоимость для продукции: " + Строка(СтрокаТЧ.Номенклатура) + " в строке: " +  Строка(СтрокаТЧ.НомерСтроки) +
			" документа: " + Строка(Ссылка), СтатусСообщения.Важное);
			Продолжить;
		КонецЕсли;
			
		СтрокаТЧ.ПлановаяСтоимость =  СтрокиПоиска[0].Цена;
		СтрокаТЧ.ПлановаяСтоимостьУпр = СтрокиПоиска[0].Цена;
		
		СтрокаТЧ.СуммаПлановая = СтрокаТЧ.Количество * (СтрокаТЧ.ПлановаяСтоимость + ?(СтрокаТЧ.Счет = ПланыСчетов.Хозрасчетный.Полуфабрикаты
		Или СтрокаТЧ.Счет = ПланыСчетов.Хозрасчетный.СырьеИМатериалы , 0, Стоимость_91_на_кг));
		СтрокаТЧ.СуммаПлановаяУпр = СтрокаТЧ.Количество * (СтрокаТЧ.ПлановаяСтоимость + ?(СтрокаТЧ.Счет = ПланыСчетов.Хозрасчетный.Полуфабрикаты
		Или СтрокаТЧ.Счет = ПланыСчетов.Хозрасчетный.СырьеИМатериалы , 0, Стоимость_91_на_кг));
				
	КонецЦикла;
	
	
КонецПроцедуры

Функция ПолучитьСтоимостьОПРНаЕдПродукции()
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХозрасчетныйОборотыДтКт.СуммаОборот,
		|	ВЫБОР
		|		КОГДА ВложенныйЗапрос.umk_КоличествоПродукции = 0
		|			ТОГДА 0
		|		ИНАЧЕ ХозрасчетныйОборотыДтКт.СуммаОборот / ВложенныйЗапрос.umk_КоличествоПродукции
		|	КОНЕЦ КАК ОпрНаЕд,
		|	ВложенныйЗапрос.umk_КоличествоПродукции КАК umk_КоличествоПродукции
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(&НачалоПериода, &ОкончаниеПериода, Месяц, СчетДт = &Счет91, , НЕ СчетКт = &Счет91, , ) КАК ХозрасчетныйОборотыДтКт,
		|	(ВЫБРАТЬ
		|		СУММА(ТребованиеНакладная.umk_КоличествоПродукции) КАК umk_КоличествоПродукции
		|	ИЗ
		|		Документ.ТребованиеНакладная КАК ТребованиеНакладная
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СчетаУчетаНоменклатуры КАК СчетаУчетаНоменклатуры
		|			ПО ТребованиеНакладная.umk_Продукция = СчетаУчетаНоменклатуры.Номенклатура
		|	ГДЕ
		|		ТребованиеНакладная.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода
		|		И ТребованиеНакладная.Проведен = ИСТИНА
		|		И НЕ СчетаУчетаНоменклатуры.СчетУчетаБУ = &СчетУчетаБУ_25) КАК ВложенныйЗапрос
		|
		|СГРУППИРОВАТЬ ПО
		|	ХозрасчетныйОборотыДтКт.СуммаОборот,
		|	ВЫБОР
		|		КОГДА ВложенныйЗапрос.umk_КоличествоПродукции = 0
		|			ТОГДА 0
		|		ИНАЧЕ ХозрасчетныйОборотыДтКт.СуммаОборот / ВложенныйЗапрос.umk_КоличествоПродукции
		|	КОНЕЦ,
		|	ВложенныйЗапрос.umk_КоличествоПродукции";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ДатаНачала));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецМесяца(ДатаНачала));
	Запрос.УстановитьПараметр("Счет91", ПланыСчетов.Хозрасчетный.ОбщепроизводственныеРасходы);
	Запрос.УстановитьПараметр("СчетУчетаБУ_25", ПланыСчетов.Хозрасчетный.Полуфабрикаты);

	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.ОпрНаЕд
	
	
КонецФункции


