Перем мСписокВозможныхРеквизитов Экспорт;
Перем мРеквизитыКонтрольУникальности Экспорт;

Перем мЭтоНеНовый;

// Обработчик события элемента ПриКопировании
//
Процедура ПриКопировании(ОбъектКопирования)
	
	Если Не ЭтоГруппа Тогда
		
		ЕдиницаХраненияОстатков = Неопределено;
		ЕдиницаДляОтчетов       = Неопределено;
		ЕдиницаИзмеренияМест    = Неопределено;
		ОсновноеИзображение     = Неопределено;
		НоменклатураГТД         = Неопределено;
		
		// + Таргони Т.О. - 19.09.2018
		НоменклатурнаяГруппа    = Неопределено;
		// - Таргони Т.О. - 19.09.2018
		
	КонецЕсли;
	
	// + umk Получим структуру счетов учета объекта копирования, поместим в хранилище
	СтруктураСчетовОбъектаКопирования = БухгалтерскийУчет.ПолучитьСчетаУчетаНоменклатуры(,ОбъектКопирования.Ссылка);
	umk_ХранилищеСчетовУчета = Новый ХранилищеЗначения(СтруктураСчетовОбъектаКопирования);
	// - umk
	
КонецПроцедуры

// Обработчик события ПередЗаписью формы.
//
Процедура ПередЗаписью(Отказ)
		
	Если мЭтоНеНовый = Неопределено Тогда
		мЭтоНеНовый = Не ЭтоНовый();
	КонецЕсли;

	Если Не ОбменДанными.Загрузка И Не ЭтоГруппа Тогда
		Если Не Услуга И НЕ ЗначениеЗаполнено(БазоваяЕдиницаИзмерения) Тогда
			#Если Клиент Тогда
			РаботаСДиалогами.СообщитьПользователюНезаполненРеквизит(Ссылка, "базовая единица");
			#КонецЕсли
			Отказ = Истина;
		Иначе
			// Надо проверить владельца единицы хранения остатков.
			Если ЗначениеЗаполнено(ЕдиницаХраненияОстатков)
			   И ЕдиницаХраненияОстатков.Владелец <> Ссылка Тогда
				ТекстСообщения = "У единицы хранения остатков номенклатуры """ + СокрЛП(Ссылка) + """ неверно указан владелец!";
				ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ);
			КонецЕсли;
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(ЕдиницаДляОтчетов) Тогда
			ЕдиницаДляОтчетов = ЕдиницаХраненияОстатков;
		КонецЕсли;
		
		// + Таргони Т.О. - 19.09.2018
		мНоменклатурнаяГруппа = ПолучитьНоменклатурнуюГруппу();
		// - Таргони Т.О. - 19.09.2018

		// Надо проверить владельца единицы для отчетов.
		Если ЗначениеЗаполнено(ЕдиницаДляОтчетов)
		   И ЕдиницаДляОтчетов.Владелец <> Ссылка Тогда
			ТекстСообщения = "У единицы для отчетов номенклатуры """ + СокрЛП(Ссылка) + """ неверно указан владелец!";
			ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ);
		КонецЕсли;

		Если мЭтоНеНовый Тогда
			СуществуютСсылки = Неопределено;

			Если Не Услуга И Ссылка.ЕдиницаХраненияОстатков <> ЕдиницаХраненияОстатков И ПолныеПрава.Номенклатура_СуществуютСсылки(Ссылка, СуществуютСсылки) Тогда
				ТекстСообщения = "Единица """ + СокрЛП(Ссылка.ЕдиницаХраненияОстатков) + """ является единицей хранения остатков для """ + Наименование + """
				|и уже участвует в товародвижении. 
				|Изменить эту единицу уже нельзя!";
				ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ);
			КонецЕсли;

			Если (Услуга <> Ссылка.Услуга Или Комплект <> Ссылка.Комплект Или Набор <> Ссылка.Набор)
			   И ПолныеПрава.Номенклатура_СуществуютСсылки(Ссылка, СуществуютСсылки) Тогда
				ТекстСообщения = "Номенклатура """ + СокрЛП(Ссылка) + """ участвует в товародвижении.
				|Нельзя изменить тип номенклатуры (Услуга, товар, набор-комплект), если позиция номенклатуры участвует в товародвижении!";
				ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ);
			КонецЕсли;

			Если Не ВестиУчетПоСериям И Ссылка.ВестиУчетПоСериям И ПолныеПрава.Номенклатура_СуществуютСсылкиНаСерииВРегистрахНакопления(Ссылка) Тогда
				ТекстСообщения = "Номенклатура """ + СокрЛП(Ссылка) + """ участвует в товародвижении.
				|признак учета по сериям не может быть изменен!";
				ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ);
			КонецЕсли;
			
			// + Таргони Т.О. - 19.09.2018  // + umk Malakhov A.S. - 15.02.19 поправил 
			Если Наименование <> НоменклатурнаяГруппа.Наименование И ЗначениеЗаполнено(НоменклатурнаяГруппа) Тогда
				НоменклатурнаяГруппаОбъект 				= НоменклатурнаяГруппа.ПолучитьОбъект();
				НоменклатурнаяГруппаОбъект.Наименование = Наименование;
				НоменклатурнаяГруппаОбъект.Записать();
			КонецЕсли;
			// - Таргони Т.О. - 19.09.2018
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(ВидНоменклатуры) Тогда
			#Если Клиент Тогда
			РаботаСДиалогами.СообщитьПользователюНезаполненРеквизит(Ссылка, "вид номенклатуры");
			#КонецЕсли
			Отказ = Истина;
		КонецЕсли;
		
		// + Таргони Т.О. - 19.09.2018
		Если Не ЗначениеЗаполнено(НоменклатурнаяГруппа) Тогда
			Если Не ЗначениеЗаполнено(мНоменклатурнаяГруппа) Тогда 
				НоменклатурнаяГруппаОбъект 							= Справочники.НоменклатурныеГруппы.СоздатьЭлемент();
				НоменклатурнаяГруппаОбъект.Наименование 			= Наименование;
				НоменклатурнаяГруппаОбъект.БазоваяЕдиницаИзмерения 	= БазоваяЕдиницаИзмерения;
				НоменклатурнаяГруппаОбъект.ЕдиницаХраненияОстатков 	= ЕдиницаХраненияОстатков;
				НоменклатурнаяГруппаОбъект.СтавкаНДС 				= СтавкаНДС;
				// + umk Malakhov A.S. 
				НоменклатурнаяГруппаОбъект.НалоговоеНазначениеВПроизводстве = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Облагаемая;
				// - umk Malakhov A.S.
				НоменклатурнаяГруппаОбъект.Записать();
				
				мНоменклатурнаяГруппа = НоменклатурнаяГруппаОбъект.Ссылка;
				КонецЕсли;
			
			НоменклатурнаяГруппа 		= мНоменклатурнаяГруппа;
			НоменклатурнаяГруппаЗатрат 	= мНоменклатурнаяГруппа;
		КонецЕсли;
		// - Таргони Т.О. - 19.09.2018

	КонецЕсли;

КонецПроцедуры // ПередЗаписью()

// + Таргони Т.О. - 19.09.2018
Функция ПолучитьНоменклатурнуюГруппу()
	
	Результат = Справочники.НоменклатурныеГруппы.ПустаяСсылка(); 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НоменклатурныеГруппы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.НоменклатурныеГруппы КАК НоменклатурныеГруппы
	|ГДЕ
	|	НЕ НоменклатурныеГруппы.ПометкаУдаления
	|	И НЕ НоменклатурныеГруппы.ЭтоГруппа
	|	И НоменклатурныеГруппы.Наименование = &Наименование
	|";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Результат = Выборка.Ссылка;
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции
// - Таргони Т.О. - 19.09.2018

Процедура ПриЗаписи()
	
	// + umk При копировании номенклатуры копируем счета учета
	Если Не ЭтоГруппа Тогда
		СтруктураСчетов = umk_ХранилищеСчетовУчета.Получить();
		Если Не СтруктураСчетов = Неопределено Тогда
			ЗаписьСчетовБУ = РегистрыСведений.СчетаУчетаНоменклатуры.СоздатьМенеджерЗаписи();
			ЗаписьСчетовБУ.Номенклатура = Ссылка;
			ЗаполнитьЗначенияСвойств(ЗаписьСчетовБУ,СтруктураСчетов,,"Номенклатура");
			ЗаписьСчетовБУ.Записать(Ложь);
			umk_ХранилищеСчетовУчета = Неопределено;
		КонецЕсли;
		Результат =  РегистрыСведений.umk_ДопРеквизитыНоменклатуры.ПолучитьВыборкуПериодическихРеквизитов(Ссылка);
		Выборка = Результат.Выбрать();
		Если Выборка.Следующий() Тогда
			КодСинхронизации = Выборка.КодСинхронизации
		Иначе
			КодСинхронизации = ""
		КонецЕсли;
		РегистрыСведений.КодыСинхронизацииУНФ.ОбновитьКодСинхронизации(Ссылка, КодСинхронизации);
	КонецЕсли;
    // - umk

КонецПроцедуры
