Функция ПолучитьВыборкуПериодическихРеквизитов(Номенклатура, Период = Неопределено) Экспорт
	
	Если Период = Неопределено Тогда
		Период = ТекущаяДата();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Объект", Номенклатура);
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДопРеквизитыНоменклатурыСрезПоследних.Период КАК ПериодНабораЗаписей,
		|	ДопРеквизитыНоменклатурыСрезПоследних.Номенклатура,
		|	ДопРеквизитыНоменклатурыСрезПоследних.БлокироватьВыписку,
		|	ДопРеквизитыНоменклатурыСрезПоследних.БлокироватьПроизводство,
		|	ДопРеквизитыНоменклатурыСрезПоследних.Выход,
		|	ДопРеквизитыНоменклатурыСрезПоследних.ВидДокументаУК,
		|	ДопРеквизитыНоменклатурыСрезПоследних.ВидДокументаУК1,
		|	ДопРеквизитыНоменклатурыСрезПоследних.ВидДокументаУК2,
		|	ДопРеквизитыНоменклатурыСрезПоследних.ЕстьКодС,
		|	ДопРеквизитыНоменклатурыСрезПоследних.НомерУК,
		|	ДопРеквизитыНоменклатурыСрезПоследних.НомерУК1,
		|	ДопРеквизитыНоменклатурыСрезПоследних.НомерУК2,
		|	ДопРеквизитыНоменклатурыСрезПоследних.ДатаУК,
		|	ДопРеквизитыНоменклатурыСрезПоследних.ДатаУК1,
		|	ДопРеквизитыНоменклатурыСрезПоследних.ДатаУК2,
		|	ДопРеквизитыНоменклатурыСрезПоследних.КонечныйСрок,
		|	ДопРеквизитыНоменклатурыСрезПоследних.КонечныйСрок1,
		|	ДопРеквизитыНоменклатурыСрезПоследних.КонечныйСрок2,
		|	ДопРеквизитыНоменклатурыСрезПоследних.ПримСтр,
		|	ДопРеквизитыНоменклатурыСрезПоследних.ПримСтр1,
		|	ДопРеквизитыНоменклатурыСрезПоследних.ПримСтр2,
		|	ДопРеквизитыНоменклатурыСрезПоследних.КодСинхронизации КАК КодСинхронизации
		|ИЗ
		|	РегистрСведений.umk_ДопРеквизитыНоменклатуры.СрезПоследних(&Период, Номенклатура = &Объект) КАК ДопРеквизитыНоменклатурыСрезПоследних";
	
	Возврат Запрос.Выполнить();

КонецФункции
