#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	мВалютаРегламентированногоУчета   = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	мУказаниеСкладовВТЧ = Ложь;
	ЦенаВключаетНДС = Объект.СуммаВключаетНДС;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда // проверить объект на то, что он еще не внесен в ИБ

		Объект.ВидПоступления = Неопределено;
		ДокументОбъект = РеквизитФормыВЗначение("Объект");
		Объект.АвторасчетНДС = Истина;
		
		// Заполнить реквизиты значениями по умолчанию.
		ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ДокументОбъект, глЗначениеПеременной("глТекущийПользователь"), мВалютаРегламентированногоУчета, "Продажа");
		ОбщегоНазначения.ЗаполнитьОбязательныеРеквизитыШапкиНовогоДокумента(ДокументОбъект, глЗначениеПеременной("глТекущийПользователь"));

		ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
		
		Если ЗначениеЗаполнено(Параметры.Основание)
		   И ТипЗнч(Параметры.Основание) = Тип("ДокументСсылка.ПриходныйОрдерНаТовары") Тогда
			Объект.ОтражатьВУправленческомУчете = Истина;
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
			
			СчетаУчета = УправлениеВзаиморасчетами.ПолучитьСчетаРасчетовСКонтрагентом(Объект.Организация, Объект.Контрагент, Объект.ДоговорКонтрагента);
			
			Если Объект.ДоговорКонтрагента.ВидДоговора      = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером Тогда
				Объект.СчетУчетаРасчетовСКонтрагентом       = СчетаУчета.СчетРасчетовПокупателя;
			ИначеЕсли Объект.ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.Бартерный Тогда
				Объект.СчетУчетаРасчетовСКонтрагентом = СчетаУчета.СчетРасчетовПокупателяПриБартере;
			Иначе
				Объект.СчетУчетаРасчетовСКонтрагентом = СчетаУчета.СчетРасчетовПокупателя;
			КонецЕсли;
			
			Объект.СчетУчетаРасчетовПоАвансам     	= Объект.СчетУчетаРасчетовСКонтрагентом;
			
			Объект.СчетУчетаРасчетовПоТаре          = СчетаУчета.СчетУчетаТарыПокупателя;
			Объект.СчетУчетаРасчетовПоТареПоАвансам = Объект.СчетУчетаРасчетовПоТаре;
			
			Объект.СчетУчетаНДС 					= СчетаУчета.СчетУчетаНДСПродаж;
			Объект.СчетУчетаНДСПодтвержденный = СчетаУчета.СчетУчетаНДСПродажПодтвержденный;
			
		КонецЕсли;	
		
	Иначе
		
		//НастройкаПравДоступа.ОпределитьДоступностьВозможностьИзмененияДокументаПоДатеЗапрета(ДокументОбъект, ЭтаФорма);
		
	КонецЕсли;
	
	ОбновитьИтогиСервер();
	
КонецПроцедуры

#КонецОбласти

#Область КомандыФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	КонтрагентПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
	Объект.ДоговорКонтрагента = ЗаполнениеДокументов.ПолучитьДоговорПоОрганизацииИКонтрагенту(Объект.Организация, Объект.Контрагент);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	
	ОбновитьИтогиСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаВключаетНДСПриИзменении(Элемент)
	ПересчитатьЦенуСуммуПоНалогам();
	ОбновитьИтогиСервер();
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗапасы

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	
	СтруктрураСтрокиТЧ = СтруктрураСтрокиТЧ();
	
	ЗаполнитьЗначенияСвойств(СтруктрураСтрокиТЧ, СтрокаТабличнойЧасти);
	ТоварыНоменклатураПриИзмененииНаСервере(СтруктрураСтрокиТЧ);
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти,СтруктрураСтрокиТЧ);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыХарактеристикаНоменклатурыПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	
	СтруктрураСтрокиТЧ = СтруктрураСтрокиТЧ();
	
	ЗаполнитьЗначенияСвойств(СтруктрураСтрокиТЧ, СтрокаТабличнойЧасти);
	ТоварыКоличествоПриИзмененииСервер(СтруктрураСтрокиТЧ);
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти,СтруктрураСтрокиТЧ);
	
КонецПроцедуры

Процедура ТоварыКоличествоПриИзмененииСервер(СтруктрураСтрокиТЧ)
	
	РассчитатьСуммуТабЧастиСервер(СтруктрураСтрокиТЧ);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	
	СтруктрураСтрокиТЧ = СтруктрураСтрокиТЧ();
	
	ЗаполнитьЗначенияСвойств(СтруктрураСтрокиТЧ, СтрокаТабличнойЧасти);
	ТоварыЦенаПриИзмененииСервер(СтруктрураСтрокиТЧ);
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти,СтруктрураСтрокиТЧ);
		
КонецПроцедуры

&НаСервере
Процедура ТоварыЦенаПриИзмененииСервер(СтруктрураСтрокиТЧ)
	
	РассчитатьСуммуТабЧастиСервер(СтруктрураСтрокиТЧ);
	
КонецПроцедуры

&НаСервере
Процедура ТоварыНоменклатураПриИзмененииНаСервере(СтрокаТабличнойЧасти)
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДопПараметры = Новый Структура("ДоговорКонтрагента",Объект.ДоговорКонтрагента);
	ИмяТабЧасти = "Товары";
		
	// Выполнить общие действия для всех документов при изменении номенклатуры.
	ОбработкаТабличныхЧастейСервер.ПриИзмененииНоменклатурыТабЧасти(СтрокаТабличнойЧасти,"Товары");

	// Заполняем реквизиты табличной части.
	ОбработкаТабличныхЧастейСервер.ЗаполнитьСтавкуНДСТабЧасти(СтрокаТабличнойЧасти,"Товары", ДопПараметры, "Реализация"); 
	ОбработкаТабличныхЧастейСервер.ЗаполнитьЕдиницуЦенуПродажиТабЧасти(СтрокаТабличнойЧасти, "Товары", ДопПараметры, мВалютаРегламентированногоУчета); 


	// Рассчитываем реквизиты табличной части.
	ОбработкаТабличныхЧастейСервер.РассчитатьСуммуТабЧасти(СтрокаТабличнойЧасти,"Товары", ДопПараметры);
	ОбработкаТабличныхЧастейСервер.РассчитатьСуммуНДСТабЧасти(СтрокаТабличнойЧасти,"Товары", ДопПараметры);
	
	СчетаУчета     = БухгалтерскийУчет.ПолучитьСчетаУчетаНоменклатуры(Объект.Организация, СтрокаТабличнойЧасти.Номенклатура, ?(мУказаниеСкладовВТЧ, 
																												СтрокаТабличнойЧасти.Склад, 
																												?(ТипЗнч(Объект.СкладОрдер) = Тип("ДокументСсылка.ПриходныйОрдерНаТовары"), 
																														Объект.СкладОрдер.Склад, 
																														Объект.СкладОрдер)));
	
																														
	МетаданныеДока = ДокументОбъект.Метаданные();
	
	ЗаполнитьСчетаБУ(СтрокаТабличнойЧасти, ИмяТабЧасти, СчетаУчета, Объект.ОтражатьВБухгалтерскомУчете, МетаданныеДока);
	ЗаполнитьСчетаНУ(СтрокаТабличнойЧасти, ИмяТабЧасти, СчетаУчета, Объект.ОтражатьВБухгалтерскомУчете, МетаданныеДока);
																													
	УчетСерийныхНомеров.ПроверитьСерийныеНомера(СтрокаТабличнойЧасти, ДокументОбъект);
	
	// Ввод состава набора
	УправлениеЗапасами.ДобавитьСоставНабора(СтрокаТабличнойЧасти, ДокументОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	
	СтруктрураСтрокиТЧ = СтруктрураСтрокиТЧ();
	
	ЗаполнитьЗначенияСвойств(СтруктрураСтрокиТЧ, СтрокаТабличнойЧасти);
	ТоварыСуммаПриИзмененииСервер(СтруктрураСтрокиТЧ);
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти,СтруктрураСтрокиТЧ);
	
КонецПроцедуры

&НаСервере
Процедура ТоварыСуммаПриИзмененииСервер(СтруктрураСтрокиТЧ)
	
	ДопПараметры = Новый Структура("УчитыватьНДС,СуммаВключаетНДС",Объект.УчитыватьНДС, Объект.СуммаВключаетНДС);
	
	// Выполнить общие действия для всех документов при изменении Суммы.
	ОбработкаТабличныхЧастейСервер.ПриИзмененииСуммыТабЧасти(СтруктрураСтрокиТЧ,"Товары", ДопПараметры, глЗначениеПеременной("глТекущийПользователь"));
	
	// Рассчитать реквизиты табличной части.
	ОбработкаТабличныхЧастейСервер.РассчитатьСуммуНДСТабЧасти(СтруктрураСтрокиТЧ,"Товары", ДопПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСтавкаНДСПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	
	СтруктрураСтрокиТЧ = СтруктрураСтрокиТЧ();
	
	ЗаполнитьЗначенияСвойств(СтруктрураСтрокиТЧ, СтрокаТабличнойЧасти);
	ТоварыСтавкаНДСПриИзмененииСервер(СтруктрураСтрокиТЧ);
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти,СтруктрураСтрокиТЧ);
	

КонецПроцедуры

&НаСервере
Процедура ТоварыСтавкаНДСПриИзмененииСервер(СтруктрураСтрокиТЧ)
	
	ДопПараметры = Новый Структура("УчитыватьНДС,СуммаВключаетНДС",Объект.УчитыватьНДС, Объект.СуммаВключаетНДС);

	 // Рассчитать реквизиты табличной части.
	ОбработкаТабличныхЧастейСервер.РассчитатьСуммуНДСТабЧасти(СтруктрураСтрокиТЧ,"Товары", ДопПараметры);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьИтогиСервер()
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	
	// При изменении данных обновим суммы в подвале.
	ИтогоСНДС    = ОбщегоНазначения.ФорматСумм(УчетНДС.ПолучитьСуммуДокументаСНДС(ДокументОбъект, "Товары"));
	НДС = ОбщегоНазначения.ФорматСумм(Объект.Товары.Итог("СуммаНДС"));
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьЦенуСуммуПоНалогам()
	
	СуммаВключаетНДС = Объект.СуммаВключаетНДС;
	УчитыватьНДС = Объект.УчитыватьНДС;
	
	Для Каждого СтрокаТабличнойЧасти Из Объект.Товары Цикл
		
		// Инициализация переменных
		НадоВключитьНДС  = Ложь;
		НадоИсключитьНДС = Ложь;
		НоваяЦена		= СтрокаТабличнойЧасти.Цена;
		СтавкаНДС        = ПолучитьСтавкуНДСЧислом(СтрокаТабличнойЧасти.СтавкаНДС);
		
		Если УчитыватьНДС Тогда
			Если СуммаВключаетНДС
				И (НЕ ЦенаВключаетНДС) Тогда
				
				// Надо добавлять НДС       
				НадоВключитьНДС = Истина;
			ИначеЕсли (НЕ СуммаВключаетНДС)
				И ЦенаВключаетНДС  Тогда
				
				// Надо исключать НДС       
				НадоИсключитьНДС = Истина;
			КонецЕсли;
		Иначе
			Если ЦенаВключаетНДС Тогда
				// Надо исключать НДС
				НадоИсключитьНДС = Истина;
			КонецЕсли; 
		КонецЕсли;
				
		Если НадоИсключитьНДС Тогда
			НоваяЦена = (НоваяЦена * 100) / (100 + СтавкаНДС);
		КонецЕсли;
		
		Если НадоВключитьНДС Тогда
			НоваяЦена = (НоваяЦена * (100 + СтавкаНДС)) / 100;
		КонецЕсли;
		
		СтрокаТабличнойЧасти.Цена = НоваяЦена;
		
		// Рассчитать реквизиты табличной части.
		СтруктрураСтрокиТЧ = СтруктрураСтрокиТЧ();
		ЗаполнитьЗначенияСвойств(СтруктрураСтрокиТЧ, СтрокаТабличнойЧасти);
		РассчитатьСуммуТабЧастиСервер(СтруктрураСтрокиТЧ);
		ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти,СтруктрураСтрокиТЧ);
			
	КонецЦикла;
	
	ЦенаВключаетНДС = СуммаВключаетНДС;
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьСуммуТабЧастиСервер(СтруктрураСтрокиТЧ)
	
	ДопПараметры = Новый Структура("УчитыватьНДС,СуммаВключаетНДС",Объект.УчитыватьНДС, Объект.СуммаВключаетНДС);
	
	ОбработкаТабличныхЧастейСервер.РассчитатьСуммуТабЧасти(СтруктрураСтрокиТЧ,"Товары",ДопПараметры);
	ОбработкаТабличныхЧастейСервер.РассчитатьСуммуНДСТабЧасти(СтруктрураСтрокиТЧ,"Товары", ДопПараметры);
	
	//ОбновитьИтогиСервер();
	
КонецПроцедуры

//Вернуть ставку налога числом
&НаСервере
Функция ПолучитьСтавкуНДСЧислом(СтавкаНДС)
	Возврат УчетНДС.ПолучитьСтавкуНДС(СтавкаНДС)
КонецФункции

&НаСервере
// Заполняет счета БУ в строке табличной части.
//
Процедура ЗаполнитьСчетаБУ(СтрокаТЧ, ИмяТабЧасти, СчетаУчета, ЗаполнятьБУ, МетаданныеДокумента)
	
	Если ЗаполнятьБУ = Истина Тогда
		
		СтрокаТЧ.СчетУчетаБУ = СчетаУчета.СчетУчетаБУ;
		
		Если ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("ПереданныеСчетУчетаБУ", МетаданныеДокумента, ИмяТабЧасти) Тогда
			СтрокаТЧ.ПереданныеСчетУчетаБУ = СчетаУчета.СчетПередачиБУ;
		КонецЕсли;

		Если ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("СхемаРеализации", МетаданныеДокумента, ИмяТабЧасти) Тогда
			СтрокаТЧ.СхемаРеализации = СчетаУчета.СхемаРеализации;
		КонецЕсли;

	ИначеЕсли ЗаполнятьБУ = Ложь Тогда
		
		СтрокаТЧ.СчетУчетаБУ  = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
		
		Если ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("ПереданныеСчетУчетаБУ", МетаданныеДокумента, ИмяТабЧасти) Тогда
			СтрокаТЧ.ПереданныеСчетУчетаБУ = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
		КонецЕсли;

		Если ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("СхемаРеализации", МетаданныеДокумента, ИмяТабЧасти) Тогда
			СтрокаТЧ.СхемаРеализации = Справочники.СхемыРеализации.ПустаяСсылка();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьСчетаБУ

// Заполняет счета НУ в строке табличной части.
//
Процедура ЗаполнитьСчетаНУ(СтрокаТЧ, ИмяТабЧасти, СчетаУчета, ЗаполнятьНУ, МетаданныеДокумента)
	
	Если ЗаполнятьНУ  = Истина Тогда
	
		СтрокаТЧ.НалоговоеНазначение = СчетаУчета.НалоговоеНазначение;
		СтрокаТЧ.НалоговоеНазначениеДоходовИЗатрат = СчетаУчета.НалоговоеНазначениеДоходовИЗатрат;
		
	ИначеЕсли ЗаполнятьНУ = Ложь Тогда
		
		СтрокаТЧ.НалоговоеНазначение = Справочники.НалоговыеНазначенияАктивовИЗатрат.ПустаяСсылка();
		СтрокаТЧ.НалоговоеНазначениеДоходовИЗатрат = Справочники.НалоговыеНазначенияАктивовИЗатрат.ПустаяСсылка();
		
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьСчетаНУ

&НаСервере
Функция СтруктрураСтрокиТЧ()
	
Возврат  Новый Структура("Номенклатура,Количество,ЕдиницаИзмерения,ЕдиницаИзмеренияМест,Коэффициент,Цена,ПроцентСкидкиНаценки,Сумма,СтавкаНДС,СуммаНДС,ХарактеристикаНоменклатуры,
	|СерияНоменклатуры,ДокументПартии,Себестоимость,КоличествоМест,Качество,Склад,ПриходныйОрдер,СчетУчетаБУ,ПереданныеСчетУчетаБУ,
	|СхемаРеализации,НалоговоеНазначение,НоменклатурнаяПозиция,КлючСтроки,ЗаказПокупателя,КлючСвязи,ПроцентАвтоматическихСкидок,УсловиеАвтоматическойСкидки,
	|ЗначениеУсловияАвтоматическойСкидки,СебестоимостьНУ,НалоговоеНазначениеДоходовИЗатрат");
	
КонецФункции

#КонецОбласти

#Область ИмпортаФайлов

&НаКлиенте
Процедура ВыбратьФайлНакладной77(Команда)
	
	АдресВХранилище = "";
	ВыбранноеИмяФайла = "";
	
	Если ПоместитьФайл(АдресВХранилище,,ВыбранноеИмяФайла,,УникальныйИдентификатор) Тогда
		Файл = Новый Файл(ВыбранноеИмяФайла);
		Если НЕ Файл.Расширение = ".mxl" Тогда
			Сообщить("Файл не соответствует расширению "".mxl""");
			Возврат
		КонецЕсли;
		ИмяФайла_накладной77_mxl = Файл.Имя;
		СсылкаНаФайла_накладной77_mxl = АдресВХранилище;
		Модифицированность = Истина;
	Иначе
		Возврат
	КонецЕсли;
	
	Импортирована = Ложь;
	
	ЗагрузитьФайлНакладной77_mxl(".mxl", Импортирована);
	
	Если Импортирована Тогда
		Попытка
			УдалитьФайлы(Файл.ПолноеИмя);
		Исключение
			Сообщить("Возникли проблемы с удалением файла на клиенте.", СтатусСообщения.Важное);
			Возврат;
		КонецПопытки;
	КонецЕсли;
		
	Объект.umk_Импортирована = Импортирована;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьФайлНакладной77_mxl(Расширение, Импортирована)
	
	Если ЭтоАдресВременногоХранилища(СсылкаНаФайла_накладной77_mxl) Тогда
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(СсылкаНаФайла_накладной77_mxl);
		ИмяВременногоФайла	= ПолучитьИмяВременногоФайла(Расширение);
		ДвоичныеДанные.Записать(ИмяВременногоФайла);		
	КонецЕсли;
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.Прочитать(ИмяВременногоФайла, СпособЧтенияЗначенийТабличногоДокумента.Текст);
	
	//Прочитаем шапку таб. док.
	ТипДок = СокрЛП(ТабДок.Область(1, 9).Текст);
	
	Если ТипДок = "РН" Тогда
		Сообщить("Вы пытаетесь импортировать расходную накладную в возвратную?");
		Возврат;		
	КонецЕсли;
	
	ЗагрузитьДанныеТоваров_mxl(ТабДок, ТипДок, Импортирована);
	
	Если Импортирована Тогда
		Попытка
			УдалитьФайлы(ИмяВременногоФайла);
		Исключение
			Сообщить("Возникли проблемы с удалением файла на сервере.", СтатусСообщения.Важное);
			Возврат;
		КонецПопытки;
	КонецЕсли;
	
	ОбновитьИтогиСервер();
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДанныеТоваров_mxl(ТабДок, ТипДок, Импортирована)
	
	Если Не Объект.Товары.Количество() = 0 Тогда
		Объект.Товары.Очистить();
	КонецЕсли;
	
	ПлательщикНДС = Истина;
	Объект.УчитыватьНДС     = Истина;
	Объект.СуммаВключаетНДС = Ложь;
	
	// Заполним склад 
	Если Не ЗначениеЗаполнено(Объект.СкладОрдер) Тогда
		Объект.СкладОрдер = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнойСклад");	
	КонецЕсли;
	
	umk_КатЦенФ2 = ТабДок.Область(1, 3).Текст;  //Зачем?
	Объект.umk_номерФ2 = "" + СокрЛП(ТабДок.Область(1, 4).Текст) + Сред(СокрЛП(ТабДок.Область(1, 5).Текст),4); 
	ТипЦены = Константы.umk_ТипЦеныПриИмпорте.Получить();
	НомерКолЦены = 5;//?(ТипЦены = 1, 5, 4);
	
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		Объект.Организация = Константы.umk_ГоловнаяОрганизация.Получить();
	КонецЕсли;
	
	СхемаНО = ОбщегоНазначения.ПолучитьСхемуНалогообложения(Объект.Дата, Объект.Организация);
	
	Если НЕ СхемаНО.Ссылка = Справочники.СхемыНалогообложения.ЕдиныйНалогИНДС
		И Не СхемаНО.Ссылка = Справочники.СхемыНалогообложения.НалогНаПрибыльИНДС ТОгда
		ПлательщикНДС = Ложь;	
	КонецЕсли;

	
	КодПоЕДРПОУ = СокрЛП(ТабДок.Область(1, 7).Текст);
	
	Если НЕ КодПоЕДРПОУ = "" Тогда
		КонтрагентСсылка = Справочники.Контрагенты.НайтиПоРеквизиту("КодПоЕДРПОУ", КодПоЕДРПОУ);
		Если Не КонтрагентСсылка.Пустая() Тогда
			Объект.Контрагент = КонтрагентСсылка;
			КонтрагентПриИзмененииНаСервере();
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Контрагент) Тогда
		Сообщить("Контрагент по ЕДРПОУ не найден! Установите значение контрагента и повторите загрузку!");
		Возврат
	КонецЕсли;

	
	Инд = 2;
	
	Пока Не СокрЛП(ТабДок.Область(Инд, 1).Текст) = "" Цикл
		
		Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
		
		Код = СокрЛП(ТабДок.Область(Инд, 2).Текст);
		Если Код = "" Тогда
			Сообщить("Не задан код для ТМЦ в строке: " + Строка(Инд - 1));
			Инд = Инд + 1;
			Продолжить;
		КонецЕсли;	
		
		// Найдем документ РТиУ
		НомерРН = ТабДок.Область(Инд, 13).Текст;
		НомерРН = Формат(Сред(НомерРН, 4), "С10");
		
		ДокументРТиУ = Документы.ВозвратТоваровОтПокупателя.ДокументРеализацииПоНомеру77(НомерРН,Объект.Контрагент);
		
		Если ЗначениеЗаполнено(ДокументРТиУ) Тогда //Найдем номенклатуру по коду на дату РТиУ
			Номенклатура =  umk_Доработки.НоменклатураПоКодуСинхронизации(Код, ДокументРТиУ.Дата);
		Иначе // на дату документа
			Номенклатура =  umk_Доработки.НоменклатураПоКодуСинхронизации(Код, Объект.Дата);
		КонецЕсли; 
		
		Если Номенклатура.Пустая() Тогда
			Сообщить("В справочнике номенклатуры не обнаружен элемент: " + ТабДок.Область(Инд,1).Текст + " с кодом: " + Код);
			Инд = Инд + 1;
			Продолжить;
		КонецЕсли;
		
		СтрокаТабличнойЧасти = Объект.Товары.Добавить();
		
		//обработчик события "ПриНачалеРедактирования" 
		СтрокаТабличнойЧасти.Качество = Справочники.Качество.Новый;
		ДокументОбъект = РеквизитФормыВЗначение("Объект");
		СтрокаТабличнойЧасти.КлючСтроки = УправлениеЗапасами.ПолучитьНовыйКлючСтроки(ДокументОбъект);
		//ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
		
		СтрокаТабличнойЧасти.Номенклатура = Номенклатура;
		// Выполнить общие действия для всех документов при изменении номенклатуры.
		ТоварыНоменклатураПриИзмененииНаСервере(СтрокаТабличнойЧасти);
		
		//Упаковка
		ВидУпаковки      = СокрЛП(Строка(ТабДок.Область(Инд, 11).Текст));
		
		НаименованиеУпак = СокрЛП(Строка(ТабДок.Область(Инд, 18).Текст));//Строка(ТабДок.Область(Инд, 11).Текст);
		КодУпаковки      = Число(Строка(ТабДок.Область(Инд, 17).Текст)); 
		
		НаименованиеГруппыУпаковок = СокрЛП(Строка(ТабДок.Область(Инд, 15).Текст));
		КодГруппыУпаковок = СокрЛП(Строка(ТабДок.Область(Инд, 16).Текст));		
		
		
		Если ЗначениеЗаполнено(ДокументРТиУ) Тогда
			
			СтрокаТабличнойЧасти.ДокументПартии = ДокументРТиУ;		
			
		КонецЕсли;
		
		УстановитьНалоговуюНакладную(СтрокаТабличнойЧасти);
		
		// Упаковка		
		НаименованиеДляПечатиУпак =  СокрЛП(ТабДок.Область(Инд, ?(ТипДок = "ВН", 12, 20)).Текст);
		СтрокаТабличнойЧасти.umk_УпаковкаНаПечать = НаименованиеДляПечатиУпак;
		
		//umk_Доработки.СоздатьХарактеристику(ТипДок, Объект.Дата, СтрокаТабличнойЧасти, ВидУпаковки, КодУпаковки, НаименованиеУпак,
		//КодГруппыУпаковок,НаименованиеГруппыУпаковок, НаименованиеДляПечатиУпак);
		
		Если ЗначениеЗаполнено(НаименованиеУпак) ТОгда
			СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.НайтиПоНаименованию(НаименованиеУпак,,,
			СтрокаТабличнойЧасти.Номенклатура);
			Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры) Тогда
				Сообщить("СтрокаСтрока №" + Строка(СтрокаТабличнойЧасти.НомерСтроки) + 
				"Не найдена характеристика " + НаименованиеУпак + " для номенклатуры " 
				+ Строка(СтрокаТабличнойЧасти.Номенклатура));
			КонецЕсли;
		КонецЕсли;
		
		Цена = Число(ТабДок.Область(Инд, НомерКолЦены).Текст);
		СтрокаТабличнойЧасти.Цена = ?(ПлательщикНДС = Истина, Цена/1.2, Цена);
		СтрокаТабличнойЧасти.Количество = Число(ТабДок.Область(Инд, 3).Текст);
		
		
		Если Не ПлательщикНДС Тогда//ТипЦены = 1 Тогда
			СтрокаТабличнойЧасти.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
		КонецЕсли;
		
		// Рассчитать реквизиты табличной части.
		РассчитатьСуммуТабЧастиСервер(СтрокаТабличнойЧасти);
		
		
		Импортирована = Истина;
		
		Инд = Инд + 1;
		
	КонецЦикла;
	

КонецПроцедуры

&НаСервере
Процедура УстановитьНалоговуюНакладную(СтрокаТабличнойЧасти)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НалоговаяНакладная.Ссылка
		|ИЗ
		|	Документ.НалоговаяНакладная КАК НалоговаяНакладная
		|ГДЕ
		|	НалоговаяНакладная.ДокументОснование = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДокументОснование", СтрокаТабличнойЧасти.ДокументПартии);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		СтрокаТабличнойЧасти.umk_НалоговаяНакладная = Выборка.Ссылка;
	Иначе
		СтрокаТабличнойЧасти.umk_НалоговаяНакладная = Документы.НалоговаяНакладная.ПустаяСсылка();
	КонецЕсли;
	 
КонецПроцедуры

#КонецОбласти
