
//Возвращает структуру параметров авто
Функция ПараметрыАвто(Авто) Экспорт
	
	СтруктураАвто = Новый Структура("ВинКод,ГодВыпуска,Длина,Ширина,Высота,Вес,ВесСГрузом");
	
	СтруктураАвто.ВинКод = Авто.ВинКодАвто;
	СтруктураАвто.ГодВыпуска = Год(Авто.ДатаВыпуска);
	СтруктураАвто.Длина = Авто.ДлинаАвто;
	СтруктураАвто.Ширина = Авто.ШиринаАвто;
	СтруктураАвто.Высота = Авто.ВысотаАвто;
	СтруктураАвто.Вес = Авто.ВесАвтоБезГруза;
	СтруктураАвто.ВесСГрузом = Авто.ВесАвтоСГрузом;
	
	Возврат СтруктураАвто
	
КонецФункции