
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	Если НЕ ЗначениеЗаполнено(ПараметрКоманды) Тогда
		Сообщить("Документ не записан, печать невозможна!");
		Возврат;
	КонецЕсли; // документ еще не записан // + claude

	ТабДокумент = ВызватьПечатьДекЛист(ПараметрКоманды, "К");

	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, 1, Ложь, "Дегустационный лист", ПараметрКоманды);

КонецПроцедуры

&НаСервере
Функция ВызватьПечатьДекЛист(СсылкаДокумента, ХвостПодписанта)
	Возврат Документы.ЗаписьЖРОИГП.СформироватьДекЛист(СсылкаДокумента, ХвостПодписанта);
КонецФункции
