//Формирует архивную копию Чека ККМ
//
Процедура УпаковатьВАрхив(ЧекККМ)Экспорт
	
	ЧекККМАрхивСсылка = Документы.ЧекККМАрхив.НайтиПоНомеру(ЧекККМ.Номер, ЧекККМ.Дата);
	
	Если ЗначениеЗаполнено(ЧекККМАрхивСсылка) Тогда
		ЧекККМАрхив =  ЧекККМАрхивСсылка.ПолучитьОбъект();
	Иначе
		ЧекККМАрхив = Документы.ЧекККМАрхив.СоздатьДокумент();	
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЧекККМАрхив, ЧекККМ);
	
	Для Каждого ТабЧасть Из Метаданные.Документы.ЧекККМАрхив.ТабличныеЧасти Цикл
		ЧекККМАрхив[ТабЧасть.Имя].Очистить();
		Для Каждого СтрокаТабЧасть Из ЧекККМ[ТабЧасть.Имя] Цикл
			НоваяСтрока = ЧекККМАрхив[ТабЧасть.Имя].Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТабЧасть);
		КонецЦикла;
	КонецЦикла;
	
	ЧекККМАрхив.Записать(РежимЗаписиДокумента.Запись);
	
	
КонецПроцедуры
