//Получает данные документов клиента из базы 1с77
Функция ПолучитьДанныДокумента(ИмяДокумента, НомерДокумента, ДатаДокумента) Экспорт
	
	HTTP_Structure = ОбщегоНазначенияСерверWEB.ПолучитьHTTPСоединение("1с77_work");
	
	Если HTTP_Structure = Неопределено
		Тогда
		Возврат Неопределено 
	КонецЕсли;
	
	HTTP = HTTP_Structure.HTTP;
	base = HTTP_Structure.СтруктураURI.base;
	
	request = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("/%1/documents/%2/%3/%4",base, ИмяДокумента, НомерДокумента,ДатаДокумента);
	
	http_request = Новый HTTPЗапрос(request);
	
	Попытка
		Результат =  HTTP.Получить(http_request);
	Исключение
		Сообщить("Сервер не отвечает.");		
		Возврат Неопределено
	КонецПопытки;	
	
	Если Не Результат.КодСостояния = 200 Тогда
		Сообщить("Ошибка ответа сервера.");
		Возврат  Неопределено
	КонецЕсли;
	
	response = Результат.ПолучитьТелоКакСтроку();
	
	Если Не ЗначениеЗаполнено(response) Тогда
		Возврат Неопределено
	КонецЕсли;
	
	Если response = "ERROR" Тогда
		Сообщить("Ошибка ответа сервера. ERROR Execute file");
		Возврат  Неопределено
	КонецЕсли;
	
	Возврат response
	
КонецФункции