#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	method = Параметры.method;
	path = Параметры.path;
	
	Период.ДатаНачала = ТекущаяДата();
	Период.ДатаОкончания = ТекущаяДата();
	
	ДатаДокумента = ТекущаяДата();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимость();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПолучитьДанные(Команда)
		
	Закрыть(ПолучитьДанныеНаСервере());
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимость()
	
	Элементы.КодКонтрагентаГруппы.Видимость = method = "GetOrderByClientGroupCode" 
	                                      ИЛИ method = "GetOrderByClientGroupCodePeriod";
										  
	Элементы.ДатаДокумента.Видимость        = method = "GetOrderByClientGroupCode";
	Элементы.НомерДокумента.Видимость       = method = "GetOrderByNumber";
	Элементы.Период.Видимость               = Не method = "GetOrderByClientGroupCode";
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеНаСервере()
	
	Если method = "GetOrderByClientGroupCode" Тогда
		Период.ДатаНачала = ДатаДокумента;
	КонецЕсли;
	
	Возврат controller_api_1c77.ПолучитьДанныДокумента(path,method,НомерДокумента,Период.ДатаНачала,Период.ДатаОкончания,Формат(КодКонтрагентаГруппы,"ЧГ="));
		
КонецФункции

#КонецОбласти
