Перем мВалютаРегламентированногоУчета Экспорт;

Перем мУдалятьДвижения;

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

#Если Клиент Тогда
	
// Функция формирует табличный документ с печатной формой накладной,
// разработанной методистами
//
// Возвращаемое значение:
//  Табличный документ - печатная форма накладной
//
Функция ПечатьДокумента()
	
	ТабДокумент = Новый ТабличныйДокумент;
	Макет = Документы.ЗаказСырья.ПолучитьМакет("МакетДокумент");

	// По шапке
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЗаказСырья.Номер,
	                      |	ЗаказСырья.Дата,
	                      |	ЗаказСырья.КоэффУП,
	                      |	ЗаказСырья.ДатаНачала,
	                      |	ЗаказСырья.ДатаОкончания
	                      |ИЗ
	                      |	Документ.ЗаказСырья КАК ЗаказСырья
	                      |ГДЕ
	                      |	ЗаказСырья.Ссылка = &Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаПоШапке = РезультатЗапроса.Выбрать();
	ВыборкаПоШапке.Следующий();
	
	ОбластьШапки = Макет.ПолучитьОбласть("Заголовок");
    ОбластьШапки.Параметры.Заполнить(ВыборкаПоШапке);	
	ОбластьШапки.Параметры.Дата = Формат(ВыборкаПоШапке.Дата, "ДФ=dd.MM.yyyy"); 
	ОбластьШапки.Параметры.ДатаНачала = Формат(ВыборкаПоШапке.ДатаНачала, "ДФ=dd.MM.yyyy");
	ОбластьШапки.Параметры.ДатаОкончания = Формат(ВыборкаПоШапке.ДатаОкончания, "ДФ=dd.MM.yyyy");
	
	// По табличной части		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказСырьяТовары.НомерСтроки,
		|	ЗаказСырьяТовары.Номенклатура.Наименование + "" "" + ЗаказСырьяТовары.Примечание КАК Номенклатура,
		|	ЗаказСырьяТовары.ЕдиницаИзмерения КАК ЕдИзмер,
		|	ЗаказСырьяТовары.ЗаказОконч КАК ЗаказОкончательный,
		|	ЗаказСырьяТовары.Примечание
		|ИЗ
		|	Документ.ЗаказСырья.Товары КАК ЗаказСырьяТовары
		|ГДЕ
		|	ЗаказСырьяТовары.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");
	
	ТабДокумент.Очистить();
	ТабДокумент.Вывести(ОбластьШапки);
	ТабДокумент.Вывести(ОбластьШапкаТаблицы);
	
	ВыборкаПоСтрокамТовары = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаПоСтрокамТовары.Следующий() Цикл
		ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаПоСтрокамТовары);
		ТабДокумент.Вывести(ОбластьДетальныхЗаписей);
	КонецЦикла;
	
	ТабДокумент.Вывести(ОбластьПодвалТаблицы);
	ТабДокумент.Вывести(ОбластьПодвал);
		
	
	Возврат ТабДокумент;

КонецФункции // ПечатьДокумента()

//Функция формирует по поступлению от контрагентов товаров за период
Функция ПечатьОтчета()
	
	ТабДокумент = Новый ТабличныйДокумент;
	
	СчетаДт = Новый Массив();
	СчетаДт.Добавить(ПланыСчетов.Хозрасчетный.ПроизводственныеЗапасы);
	СчетаДт.Добавить(ПланыСчетов.Хозрасчетный.МалоценныеИБыстроизнашивающиесяПредметы);
	
	
	СчетаКт = Новый Массив();
	СчетаКт.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПоставщикамиИПодрядчиками);
	СчетаКт.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицами);
	
	Макет = Документы.ЗаказСырья.ПолучитьМакет("ОтчетДокумент");
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказСырьяТовары.Номенклатура,
		|	ПРЕДСТАВЛЕНИЕ(ЗаказСырьяТовары.Номенклатура),
		|	СУММА(ЕСТЬNULL(ХозрасчетныйОборотыДтКт.КоличествоОборотДт, 0)) КАК Приход,
		|	ЗаказСырьяТовары.ЗаказОконч,
		|	СУММА(ЕСТЬNULL(ХозрасчетныйОборотыДтКт.КоличествоОборотДт, 0) - ЗаказСырьяТовары.ЗаказОконч) КАК Разница
		|ИЗ
		|	Документ.ЗаказСырья.Товары КАК ЗаказСырьяТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(&НачалоПериода, &ОкончаниеПериода, , СчетДт В ИЕРАРХИИ (&СчетаДт), , СчетКт В ИЕРАРХИИ (&СчетаКт), , ) КАК ХозрасчетныйОборотыДтКт
		|		ПО ЗаказСырьяТовары.Номенклатура = ХозрасчетныйОборотыДтКт.СубконтоДт1
		|ГДЕ
		|	ЗаказСырьяТовары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказСырьяТовары.Номенклатура,
		|	ЗаказСырьяТовары.ЗаказОконч
		|ИТОГИ ПО
		|	ОБЩИЕ";
	
	Запрос.УстановитьПараметр("НачалоПериода", ссылка.ДатаНачала);
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецДня(Ссылка.ДатаОкончания));
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("СчетаДт", СчетаДт);
	Запрос.УстановитьПараметр("СчетаКт", СчетаКт);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьОбщийИтог = Макет.ПолучитьОбласть("ОбщиеИтоги");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");
	
	ТабДокумент.Очистить();
	ОбластьЗаголовок.Параметры.Дата = Формат(Ссылка.Дата, "ДФ='ММММ yyyy ""г.""'");
	ТабДокумент.Вывести(ОбластьЗаголовок);
	ТабДокумент.Вывести(ОбластьШапкаТаблицы);
	
	ВыборкаОбщийИтог = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ВыборкаОбщийИтог.Следующий();		// Общий итог
	ОбластьОбщийИтог.Параметры.Заполнить(ВыборкаОбщийИтог);

	ВыборкаДетальныеЗаписи = ВыборкаОбщийИтог.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
		ТабДокумент.Вывести(ОбластьДетальныхЗаписей);
	КонецЦикла;
	
	ТабДокумент.Вывести(ОбластьОбщийИтог);
	ТабДокумент.Вывести(ОбластьПодвал);
	
	Возврат ТабДокумент
	
КонецФункции

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт

	// Получить экземпляр документа на печать
	Если ИмяМакета = "МакетДокумент" Тогда
		ТабДокумент = ПечатьДокумента()
	ИначеЕсли ИмяМакета = "ОтчетДокумент" Тогда
		табДокумент = ПечатьОтчета()
	КонецЕсли;

	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект), Ссылка);

КонецПроцедуры // Печать

#КонецЕсли
// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	СтруктураМакетов = Новый Структура();
	
	СтруктураМакетов.Вставить("МакетДокумент", "Печать");
	СтруктураМакетов.Вставить("ОтчетДокумент", "Отчет");
	
	Возврат СтруктураМакетов;
	
КонецФункции // ПолучитьСтруктуруПечатныхФорм()

мВалютаРегламентированногоУчета   = глЗначениеПеременной("ВалютаРегламентированногоУчета");
