
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Отбор по Организации по умолчанию
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Организация");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке; 
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный; 
	СписокОрганизаций = Новый СписокЗначений;
	СписокОрганизаций.Добавить(УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация"));
	СписокОрганизаций.Добавить(Справочники.Организации.НайтиПоКоду("100000010"));//временно ФОП Ольховский
	ЭлементОтбора.ПравоеЗначение = СписокОрганизаций;
	
	//Подразделение
	ОсновноеПодразделение = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновноеПодразделение");
	
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Подразделение");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный; 
	ЭлементОтбора.ПравоеЗначение = ОсновноеПодразделение; 
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПечатьТТН(Команда)
	
	ТекущаяСтрока = Элементы.Список.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Сообщить("Строка в списке не выбрана.");
	Иначе
		ОткрытьФорму("Обработка.umk_ПечатьТТН.Форма.ФормаУФ", Новый Структура("Документ", ТекущаяСтрока.Ссылка));
	КонецЕсли;
	
КонецПроцедуры
