	
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ТТН") Тогда
		  УстановитьОтборПоГруппеАвто(Параметры["Организация"], Параметры["Период"])
	КонецЕсли;

КонецПроцедуры

//Отбор по группе при открытии формы
&НаСервере
Процедура УстановитьОтборПоГруппеАвто(Организация, Период)
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	umk_ПараметрыТранспортаСрезПоследних.ОсновноеСредство КАК Ссылка
		|ИЗ
		|	РегистрСведений.umk_ПараметрыТранспорта.СрезПоследних(&Период, ) КАК umk_ПараметрыТранспортаСрезПоследних";
	
	Запрос.УстановитьПараметр("Период", Период);

	МассивСсылок = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	СписокСсылок = Новый СписокЗначений;
	
	Для Каждого ЭлементМассива Из МассивСсылок Цикл
		СписокСсылок.Добавить(ЭлементМассива);	
	КонецЦикла;
		
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке; 
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный; 
	ЭлементОтбора.ПравоеЗначение = СписокСсылок; 
	
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("umk_Организация");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ; 
	ЭлементОтбора.ПравоеЗначение = Организация; 
		
	
	Элементы.Список.Отображение = ОтображениеТаблицы.Список; 
	
КонецПроцедуры

