#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

//Возвращает последнее значение регистра для СрокГодности 
//
Функция ПолучитьСрокГодностиПродукции(Номенклатура, Знач Период = Неопределено) Экспорт
	Перем СрокГодности;
	Период = ?(ЗначениеЗаполнено(Период),Период, ТекущаяДата());
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ 
		|	Настройки.СрокГодности ,
		|	Настройки.Регистратор,
		|	Настройки.Период КАК Период
		|ИЗ
		|	РегистрСведений.umk_НастройкиУдостоверенияКачества.СрезПоследних(&Период, Номенклатура = &Номенклатура) КАК Настройки
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Период", Период);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если  Выборка.Следующий() Тогда
		СрокГодности = Выборка.СрокГодности
	КонецЕсли;
	
	Возврат СрокГодности
	
КонецФункции //ПолучитьТемпературныйРежимПродукции()

#КонецОбласти

#КонецЕсли
