
Функция ПолучитьHTTPСоединение(Ключ) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтруктураURI = Новый Структура("http,port,base,user,password");
	
	//пока берем первые параметры. Временно ...
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("key",Ключ);
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Параметры.http КАК http,
		|	Параметры.port КАК port,
		|	Параметры.user КАК user,
		|	Параметры.base_name КАК base,
		|	Параметры.password КАК password
		|ИЗ
		|	РегистрСведений.ПараметрыПодключенияWEB КАК Параметры
		|ГДЕ
		|	Параметры.key = &key";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если  Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураURI, Выборка);
	Иначе
		Возврат Неопределено
	КонецЕсли;
	
	HTTPСоединение = Новый HTTPСоединение(СтруктураURI.http,СтруктураURI.port, СтруктураURI.user, СтруктураURI.password); 
	
	Возврат Новый Структура("HTTP, СтруктураURI", HTTPСоединение, СтруктураURI); 
	 
КонецФункции

