
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//	Струткура, каждая строка которой соответствует одному из вариантов печати
//
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	СтруктураМакетов = Новый Структура;
	
//	СтруктураМакетов.Вставить("",	"");
	
	Возврат СтруктураМакетов;
	
КонецФункции // ПолучитьСтруктуруПечатныхФорм()
#Если Клиент Тогда

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт

	// Получить экземпляр документа на печать
	Если ИмяМакета = "" Тогда
		ТабДокумент = "";//Печать......(НаПринтер);
	КонецЕсли;

	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект), Ссылка);

КонецПроцедуры // Печать

#КонецЕсли


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.umk_ГрафикиРаботыСкладскихРаботников.Записывать = Истина;
	Движения.umk_ГрафикиРаботыСкладскихРаботников.Очистить();
	Для Каждого ТекСтрокаГрафики Из Графики Цикл
		Движение = Движения.umk_ГрафикиРаботыСкладскихРаботников.Добавить();
		Движение.Период = ТекСтрокаГрафики.Дата;
		Движение.Сотрудник = ТекСтрокаГрафики.Сотрудник;
		Движение.МестоХранения = Склад;
	КонецЦикла;

КонецПроцедуры

