
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьОтборПроцессов();
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПроцессов()
	
	Процессы.Параметры.УстановитьЗначениеПараметра("Владелец", Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаРедактировать(Команда)
	
	Если Элементы.Процессы.ТекущиеДанные = Неопределено
		Тогда
		Возврат
	КонецЕсли;
	Оповещение = Новый ОписаниеОповещения("КомандаРедактироватьОкончание",ЭтаФорма);
	ОткрытьФорму("Справочник.ПроцессПодПрограммыТермообработки.Форма.ФормаЭлемента",Новый Структура("Ключ", Элементы.Процессы.ТекущиеДанные.Ссылка),
	ЭтаФорма,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаРедактироватьОкончание(Результат, ДопПараметры) Экспорт
	
	Элементы.Процессы.Обновить();
	
КонецПроцедуры


