
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	Если ПараметрКоманды.Количество() = 0 Тогда
		Сообщить("Не выбрано ни одного документа, печать невозможна!");
		Возврат;
	КонецЕсли; // ничего не выбрано // + claude

	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПЕЧАТЬ_ЖурналОИГП";

	СформироватьОбщую(ТабДокумент, ПараметрКоманды);

	ТабДокумент.ОтображатьСетку = Ложь;
	ТабДокумент.Защита = Истина;
	ТабДокумент.ТолькоПросмотр = Ложь;
	ТабДокумент.ОтображатьЗаголовки = Ложь;
	ТабДокумент.Показать();

КонецПроцедуры

&НаСервере
Процедура СформироватьОбщую(ТабДокумент, МассивСсылок)
	Документы.ЗаписьЖРОИГП.СформироватьОбщую(ТабДокумент, МассивСсылок);
КонецПроцедуры
