
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	Если НЕ ЗначениеЗаполнено(ПараметрКоманды) Тогда
		Сообщить("Документ не записан, печать невозможна!");
		Возврат;
	КонецЕсли; // документ еще не записан // + claude

	ТабДокумент = ВызватьПечатьОбщая(ПараметрКоманды);

	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, 1, Ложь, "Журнал регистрации ОИГП", ПараметрКоманды);

КонецПроцедуры

&НаСервере
Функция ВызватьПечатьОбщая(СсылкаДокумента)
	Возврат Документы.ЗаписьЖРОИГП.СформироватьОбщую(СсылкаДокумента);
КонецФункции
