
#Область Заказы_покупателя

//Возвращает уведомление об отгрузке в xml
Функция desadv_ФайлСтрокой(Документ) Экспорт
	
	Если Не ЗначениеЗаполнено(Документ.ORDERNUMBER)
		#Если клиент  Тогда
			Тогда Предупреждение("Не заполнено значение номера заказа клиента, выгрузка в EDIN не выполнена.");
		#КонецЕсли
		Возврат ""
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Документ.Контрагент.GLN)
		#Если клиент  Тогда
			Тогда Предупреждение("Не заполнено значение GLN клиента, выгрузка в EDIN не выполнена."); 
		#КонецЕсли
		Возврат ""
	КонецЕсли;
	
	Контрагент_GLN = ?(ЗначениеЗаполнено(Документ.EDIN_Контрагент), Документ.EDIN_Контрагент.GLN,
	Документ.Контрагент.GLN);
	
	ЦеныИзРасходнойНакладной = Документ.Контрагент.EDIN_УведомлениеОтгрузкаЦеныИзРН;
	
	ДанныеЗаказа = ПолучитьДанныеЗаказаПокупателя(Документ.ORDERNUMBER, Контрагент_GLN,
	Документ.Контрагент.НезначСправа);
	
	Если Не ЗначениеЗаполнено(ДанныеЗаказа) Тогда
		#Если клиент  Тогда
			Сообщить("Не найдены данные заказа в базе EDIN, выгрузка не выполнена.");
		#КонецЕсли
		Возврат ""
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.DATE_ КАК DATE,
	|	РеализацияТоваровУслуг.NUMBER_ КАК NUMBER,
	|	РеализацияТоваровУслуг.DELIVERYDATE,
	|	РеализацияТоваровУслуг.DELIVERYTIME,
	|	РеализацияТоваровУслуг.ORDERNUMBER,
	|	РеализацияТоваровУслуг.ORDERDATE,
	|	РеализацияТоваровУслуг.DELIVERYNOTENUMBER,
	|	РеализацияТоваровУслуг.DELIVERYNOTEDATE,
	|	РеализацияТоваровУслуг.SHIPMENTS,
	|	РеализацияТоваровУслуг.INFO,
	|	РеализацияТоваровУслуг.CAMPAIGNNUMBER,
	|	РеализацияТоваровУслуг.TRANSPORTTYPE,
	|	РеализацияТоваровУслуг.TRANSPORTERTYPE,
	|	РеализацияТоваровУслуг.Организация.GLN КАК SUPPLIER,
	|	РеализацияТоваровУслуг.Организация.GLN КАК SENDER,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.EDIN_Контрагент <> ЗНАЧЕНИЕ(Справочник.EDIN_Контрагент.ПустаяСсылка)
	|			ТОГДА РеализацияТоваровУслуг.EDIN_Контрагент.GLN
	|		ИНАЧЕ РеализацияТоваровУслуг.Контрагент.GLN
	|	КОНЕЦ КАК BUYER,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.EDIN_Контрагент <> ЗНАЧЕНИЕ(Справочник.EDIN_Контрагент.ПустаяСсылка)
	|			ТОГДА РеализацияТоваровУслуг.EDIN_Контрагент.GLN
	|		ИНАЧЕ РеализацияТоваровУслуг.Контрагент.GLN
	|	КОНЕЦ КАК RECIPIENT,
	|	"""" КАК DELIVERYPLACE,
	|	"""" КАК EDIINTERCHANGEID
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	""1"" КАК HIERARCHICALID,
	|	РеализацияТоваровУслугТовары.НомерСтроки КАК POSITIONNUMBER,
	|	РеализацияТоваровУслугТовары.umk_КодКлиента КАК PRODUCT,
	|	РеализацияТоваровУслугТовары.EDIN_штрихкод,
	|	РеализацияТоваровУслугТовары.EDIN_артикулПокупателя КАК EDIN_артикулПокупателя,
	|	РеализацияТоваровУслугТовары.EDIN_артикулПродавца,
	|	РеализацияТоваровУслугТовары.Количество КАК DELIVEREDQUANTITY,
	|	"""" КАК ORDEREDQUANTITY,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслугТовары.Ссылка.СуммаВключаетНДС
	|			ТОГДА РеализацияТоваровУслугТовары.Сумма - РеализацияТоваровУслугТовары.СуммаНДС
	|		ИНАЧЕ РеализацияТоваровУслугТовары.Сумма
	|	КОНЕЦ КАК AMOUNT,
	|	РеализацияТоваровУслугТовары.Цена КАК PRICE,
	|	РеализацияТоваровУслугТовары.Номенклатура.НаименованиеПолное КАК Номенклатура,
	|	РеализацияТоваровУслугТовары.ХарактеристикаНоменклатуры КАК Характеристика,
	|	РеализацияТоваровУслугТовары.Ссылка.Дата,
	|	"""" КАК PRICEWITHVAT,
	|	РеализацияТоваровУслугТовары.СтавкаНДС КАК TAXRATE,
	|	КлассификаторЕдиницИзмерения.UNIT КАК DELIVEREDUNIT,
	|	"""" КАК ORDERUNIT
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
	|		ПО РеализацияТоваровУслугТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору = КлассификаторЕдиницИзмерения.Ссылка
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	POSITIONNUMBER";
	
	Запрос.УстановитьПараметр("Ссылка", Документ);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Шапка = РезультатЗапроса[0].Выбрать();
	Товары = РезультатЗапроса[1].Выбрать(); 
	
	//Запишем результат в xml	
	file_XML  = Новый ЗаписьXML();
	file_XML.УстановитьСтроку("UTF-8");
	
	file_XML.ЗаписатьОбъявлениеXML();
	
	Шапка.Следующий();
	
	DESADV_XDTO = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://umk.com.ua","DESADV"));
	
	DESADV_XDTO.NUMBER             = XMLСтрока(Шапка.NUMBER);//"4489279826";
	DESADV_XDTO.DATE               = XMLСтрока(Формат(Шапка.DATE,"ДФ=гггг-ММ-дд"));//2020-09-26";
	DESADV_XDTO.DELIVERYDATE       = XMLСтрока(Формат(Шапка.DELIVERYDATE,"ДФ=гггг-ММ-дд"));//"2020-09-26";
	DESADV_XDTO.DELIVERYTIME       = ДанныеЗаказа.DELIVERYTIME; //берем из заказа.;//XMLСтрока(Формат(Шапка.DELIVERYTIME,"ДФ=ЧЧ:мм"));//"00:00";
	DESADV_XDTO.ORDERNUMBER        = XMLСтрока(Шапка.ORDERNUMBER);//"4489279826";
	DESADV_XDTO.ORDERDATE          = XMLСтрока(Формат(Шапка.ORDERDATE,"ДФ=гггг-ММ-дд"));//"2020-09-25";
	DESADV_XDTO.DELIVERYNOTENUMBER = XMLСтрока(Формат(Шапка.DELIVERYNOTENUMBER,"ДФ=гггг-ММ-дд"));//"11-26-09-20";
	DESADV_XDTO.DELIVERYNOTEDATE   = XMLСтрока(Формат(Шапка.DELIVERYNOTEDATE,"ДФ=гггг-ММ-дд"));//"2020-09-26";
	DESADV_XDTO.SHIPMENTS          = XMLСтрока(Шапка.SHIPMENTS);//"1";
	DESADV_XDTO.INFO               = XMLСтрока(Шапка.INFO);//"Заказ № 4489279826";
	DESADV_XDTO.CAMPAIGNNUMBER     = XMLСтрока(Шапка.CAMPAIGNNUMBER);//"NF4600046889";
	DESADV_XDTO.TRANSPORTTYPE      = XMLСтрока(Шапка.TRANSPORTTYPE);//"30";
	DESADV_XDTO.TRANSPORTERTYPE    = XMLСтрока(Шапка.TRANSPORTERTYPE);//"31";
	
	HEAD_XDTO = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://umk.com.ua","HEAD"));
	
	HEAD_XDTO.SUPPLIER         = XMLСтрока(Шапка.SUPPLIER);//"9864232343295";
	HEAD_XDTO.BUYER            = XMLСтрока(Шапка.BUYER);//"9864066987535";
	HEAD_XDTO.DELIVERYPLACE    = ДанныеЗаказа.DELIVERYPLACE; //берем из заказа.
	HEAD_XDTO.SENDER           = XMLСтрока(Шапка.SENDER);//"9864232343295";
	HEAD_XDTO.RECIPIENT        = XMLСтрока(Шапка.RECIPIENT);//"9864066987535";
	HEAD_XDTO.EDIINTERCHANGEID = XMLСтрока(Шапка.EDIINTERCHANGEID);//"4489279826";
	
	PACKINGSEQUENCE_XDTO = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://umk.com.ua","PACKINGSEQUENCE"));
	PACKINGSEQUENCE_XDTO.HIERARCHICALID = "1";
	
	DOC_SUM = 0;
	
	Пока Товары.Следующий() Цикл 
		
		POSITION_XDTO = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://umk.com.ua","POSITION"));
		
		POSITION_XDTO.POSITIONNUMBER = XMLСтрока(Товары.POSITIONNUMBER);//"1";
		POSITION_XDTO.PRODUCT = XMLСтрока(Товары.PRODUCT);//"2086668100007"; ///Из строки документа.
		POSITION_XDTO.PRICE = 0;
		
		//Строки из заказа клиента
		ORDER_STRING = НайтиСтрокуЗаказа(POSITION_XDTO.PRODUCT,Товары,ДанныеЗаказа.POSITIONS,
		Документ.Контрагент.Префикс, Документ.Контрагент.ЗначСимволы);
		POSITION_XDTO.PRODUCTIDBUYER = XMLСтрока(ORDER_STRING.PRODUCTIDBUYER);//берем из заказа."866681";
		POSITION_XDTO.ORDERUNIT = XMLСтрока(ORDER_STRING.ORDERUNIT);//берем из заказа. 
		POSITION_XDTO.ORDEREDQUANTITY = XMLСтрока(ORDER_STRING.ORDEREDQUANTITY);//берем из заказа."6";
		POSITION_XDTO.PRODUCT = XMLСтрока(ORDER_STRING.PRODUCT); //берем из заказа.
		
		//Цена из заказа EDIN
		ORDER_PRICE = ?(ORDER_STRING.ORDERPRICE = Неопределено, 0, ORDER_STRING.ORDERPRICE); 
		
		//В зависимости от условий контрагента берем цену из заказа edin или из нашей накладной 
		PRICE =?(ЦеныИзРасходнойНакладной, XMLСтрока(Товары.PRICE), ORDER_PRICE);
		
		POSITION_XDTO.PRICE = PRICE;
		
		POSITION_XDTO.DELIVEREDQUANTITY = XMLСтрока(Товары.DELIVEREDQUANTITY);//"5.7";
		POSITION_XDTO.AMOUNT = XMLСтрока(Товары.AMOUNT);//"271.49";
		
		//Цена с НДС Из Заказа
		ORDER_PRICEWITHVAT = ORDER_STRING.PRICEWITHVAT;			
		Если НЕ ЗначениеЗаполнено(ORDER_PRICEWITHVAT) И (Документ.УчитыватьНДС И НЕ Документ.СуммаВключаетНДС)Тогда
			ORDER_PRICEWITHVAT =  Формат(POSITION_XDTO.PRICE *(1+УчетНДС.ПолучитьСтавкуНДС(Товары.TAXRATE)/100),"ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧГ=");
			Попытка
				ORDER_PRICEWITHVAT = Число(ORDER_PRICEWITHVAT);	
			Исключение
				ORDER_PRICEWITHVAT = 0;
			КонецПопытки;
		КонецЕсли;
		
		//Цена с НДС Из Накладной
		DOC_PRICEWITHVAT = XMLСтрока(Товары.PRICE);
		Если Документ.УчитыватьНДС И НЕ Документ.СуммаВключаетНДС Тогда
			DOC_PRICEWITHVAT =  Формат(Товары.PRICE *(1+УчетНДС.ПолучитьСтавкуНДС(Товары.TAXRATE)/100),"ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧГ=");
			Попытка
				DOC_PRICEWITHVAT = Число(DOC_PRICEWITHVAT);	
			Исключение
				DOC_PRICEWITHVAT = 0;
			КонецПопытки;
		КонецЕсли;
		
		//В зависимости от условий контрагента берем цену с НДС из заказа edin или из нашей накладной 
		PRICEWITHVAT = ?(ЦеныИзРасходнойНакладной, DOC_PRICEWITHVAT, ORDER_PRICEWITHVAT);
		
		Попытка 
			POSITION_XDTO.PRICEWITHVAT = Число(PRICEWITHVAT);
		Исключение
			POSITION_XDTO.PRICEWITHVAT = 0;
		КонецПопытки;
		
		POSITION_XDTO.TAXRATE = XMLСтрока(УчетНДС.ПолучитьСтавкуНДС(Товары.TAXRATE)); 
		POSITION_XDTO.DELIVEREDUNIT = XMLСтрока(Товары.DELIVEREDUNIT);
		POSITION_XDTO.DESCRIPTION = XMLСтрока(ПредставлениеНоменклатуры(Товары.Номенклатура, Товары.Характеристика, Товары.Дата));//"Ковбаса Баликова_варена 1г целофан_в/у вагова Український МК";
		
		PACKINGSEQUENCE_XDTO.POSITION.Добавить(POSITION_XDTO);
		
		//Цена с НДС из заказа на количество из накладной.Контрольна сумма для расчета отклонения
		DOC_SUM = DOC_SUM + ORDER_PRICEWITHVAT*POSITION_XDTO.DELIVEREDQUANTITY; 		
		
	КонецЦикла;
	
	Отклонение = DOC_SUM - Документ.СуммаДокумента;
	
	Если Отклонение < -1 Или Отклонение > 1 Тогда
		#Если Клиент Тогда
			Предупреждение("Не совпадают суммы накладной и уведомления об отгрузке.");
		#КонецЕсли	
	КонецЕсли;
	
	HEAD_XDTO.PACKINGSEQUENCE.Добавить(PACKINGSEQUENCE_XDTO);
	DESADV_XDTO.HEAD.Добавить(HEAD_XDTO);
	                             	
	ФабрикаXDTO.ЗаписатьXML(file_XML, DESADV_XDTO);
	
	Возврат file_XML.Закрыть();
	
КонецФункции

//Возвращает уведомление об отгрузке в xml
Функция desadv_ФайлСтрокой_Silpo(Документ) Экспорт
	
	Если Не ЗначениеЗаполнено(Документ.ORDERNUMBER)
		#Если клиент  Тогда
			Тогда Сообщить("Не заполнено значение номера заказа клиента, выгрузка в EDIN не выполнена.");
		#КонецЕсли
		Возврат ""
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Документ.Контрагент.GLN)
		#Если клиент  Тогда
			Тогда Сообщить("Не заполнено значение GLN клиента, выгрузка в EDIN не выполнена."); 
		#КонецЕсли
		Возврат ""
	КонецЕсли;
	
	Контрагент_GLN = ?(ЗначениеЗаполнено(Документ.EDIN_Контрагент), Документ.EDIN_Контрагент.GLN,
	Документ.Контрагент.GLN);
	
	ДанныеЗаказа = ПолучитьДанныеЗаказаПокупателя(Документ.ORDERNUMBER, Контрагент_GLN,
	Документ.Контрагент.НезначСправа);
	
	Если Не ЗначениеЗаполнено(ДанныеЗаказа) Тогда
		#Если клиент  Тогда
			Сообщить("Не найдены данные заказа в базе EDIN, выгрузка не выполнена.");
		#КонецЕсли
		Возврат ""
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.DATE_ КАК DATE,
	|	РеализацияТоваровУслуг.NUMBER_ КАК NUMBER,
	|	РеализацияТоваровУслуг.DELIVERYDATE,
	|	РеализацияТоваровУслуг.DELIVERYTIME,
	|	РеализацияТоваровУслуг.ORDERNUMBER,
	|	РеализацияТоваровУслуг.ORDERDATE,
	|	РеализацияТоваровУслуг.DELIVERYNOTENUMBER,
	|	РеализацияТоваровУслуг.DELIVERYNOTEDATE,
	|	РеализацияТоваровУслуг.SHIPMENTS,
	|	РеализацияТоваровУслуг.INFO,
	|	РеализацияТоваровУслуг.CAMPAIGNNUMBER,
	|	РеализацияТоваровУслуг.TRANSPORTTYPE,
	|	РеализацияТоваровУслуг.TRANSPORTERTYPE,
	|	РеализацияТоваровУслуг.Организация.GLN КАК SUPPLIER,
	|	РеализацияТоваровУслуг.Организация.GLN КАК SENDER,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.EDIN_Контрагент <> ЗНАЧЕНИЕ(Справочник.EDIN_Контрагент.ПустаяСсылка)
	|			ТОГДА РеализацияТоваровУслуг.EDIN_Контрагент.GLN
	|		ИНАЧЕ РеализацияТоваровУслуг.Контрагент.GLN
	|	КОНЕЦ КАК BUYER,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.EDIN_Контрагент <> ЗНАЧЕНИЕ(Справочник.EDIN_Контрагент.ПустаяСсылка)
	|			ТОГДА РеализацияТоваровУслуг.EDIN_Контрагент.GLN
	|		ИНАЧЕ РеализацияТоваровУслуг.Контрагент.GLN
	|	КОНЕЦ КАК RECIPIENT,
	|	"""" КАК DELIVERYPLACE,
	|	"""" КАК EDIINTERCHANGEID
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	""1"" КАК HIERARCHICALID,
	|	РеализацияТоваровУслугТовары.НомерСтроки КАК POSITIONNUMBER,
	|	РеализацияТоваровУслугТовары.umk_КодКлиента КАК PRODUCT,
	|	РеализацияТоваровУслугТовары.EDIN_штрихкод,
	|	РеализацияТоваровУслугТовары.EDIN_артикулПокупателя КАК EDIN_артикулПокупателя,
	|	РеализацияТоваровУслугТовары.EDIN_артикулПродавца,
	|	РеализацияТоваровУслугТовары.Количество КАК DELIVEREDQUANTITY,
	|	"""" КАК ORDEREDQUANTITY,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслугТовары.Ссылка.СуммаВключаетНДС
	|			ТОГДА РеализацияТоваровУслугТовары.Сумма - РеализацияТоваровУслугТовары.СуммаНДС
	|		ИНАЧЕ РеализацияТоваровУслугТовары.Сумма
	|	КОНЕЦ КАК AMOUNT,
	|	РеализацияТоваровУслугТовары.Цена КАК PRICE,
	|	РеализацияТоваровУслугТовары.Номенклатура.НаименованиеПолное КАК Номенклатура,
	|	РеализацияТоваровУслугТовары.ХарактеристикаНоменклатуры КАК Характеристика,
	|	РеализацияТоваровУслугТовары.Ссылка.Дата,
	|	"""" КАК PRICEWITHVAT,
	|	РеализацияТоваровУслугТовары.СтавкаНДС КАК TAXRATE,
	|	КлассификаторЕдиницИзмерения.UNIT КАК DELIVEREDUNIT,
	|	"""" КАК ORDERUNIT,
	|	РеализацияТоваровУслугТовары.Ссылка.СуммаВключаетНДС
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
	|		ПО РеализацияТоваровУслугТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору = КлассификаторЕдиницИзмерения.Ссылка
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	POSITIONNUMBER";
	
	Запрос.УстановитьПараметр("Ссылка", Документ);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Шапка = РезультатЗапроса[0].Выбрать();
	Товары = РезультатЗапроса[1].Выбрать(); 
	
	//Запишем результат в xml
	file_XML  = Новый ЗаписьXML();
	file_XML.УстановитьСтроку("UTF-8");
	file_XML.ЗаписатьОбъявлениеXML();
		
	Шапка.Следующий();
	
	DESADV_XDTO = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://silpo.com.ua","DESADV")); //Початок документа
	
	DESADV_XDTO.NUMBER             = XMLСтрока(Шапка.NUMBER);//Номер повідомлення про відвантаження
	DESADV_XDTO.DATE               = XMLСтрока(Формат(Шапка.DATE,"ДФ=гггг-ММ-дд"));//Дата документа
	DESADV_XDTO.DELIVERYDATE       = XMLСтрока(Формат(Шапка.DELIVERYDATE,"ДФ=гггг-ММ-дд"));//Дата поставки
	DESADV_XDTO.DELIVERYTIME       = ДанныеЗаказа.DELIVERYTIME; //берем из заказа.;Час поставки
	DESADV_XDTO.ORDERNUMBER        = XMLСтрока(СокрЛП(Шапка.ORDERNUMBER));// Номер замовлення
	DESADV_XDTO.ORDERDATE          = XMLСтрока(Формат(Шапка.ORDERDATE,"ДФ=гггг-ММ-дд"));//Дата замовлення
	DESADV_XDTO.ORDRSPNUMBER = "";//? Номер підтвердження замовлення
	DESADV_XDTO.ORDRSPDATE   = '00010101';//? Дата підтвердження замовлення
	DESADV_XDTO.DELIVERYNOTENUMBER = XMLСтрока(Формат(СокрЛП(Шапка.DELIVERYNOTENUMBER),"ДФ=гггг-ММ-дд"));//Номер накладної
	DESADV_XDTO.DELIVERYNOTEDATE   = XMLСтрока(Формат(Шапка.DELIVERYNOTEDATE,"ДФ=гггг-ММ-дд"));//Дата накладної
	DESADV_XDTO.CAMPAIGNNUMBER     = XMLСтрока(Шапка.CAMPAIGNNUMBER);//Номер договору на поставку
	DESADV_XDTO.TRANSPORTQUANTITY              = 1;//?  Загальна кількість машин; кількість повідомлень про відвантаження в межах одного замовлення покупця(число >1 або =1)
	DESADV_XDTO.TRANSPORTID                    = 1;//? Порядковий номер транспортного засобу/повідомленя про відвантаження (число < або = TRANSPORTQUANTITY й не може бути більше)
	DESADV_XDTO.PACKAGEWEIGHT                  = 0;//? Вага по накладній
	
	
	HEAD_XDTO = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://silpo.com.ua","HEAD")); //Початок основного блоку
	
	HEAD_XDTO.SUPPLIER         = XMLСтрока(Шапка.SUPPLIER);// GLN постачальника
	HEAD_XDTO.BUYER            = XMLСтрока(Шапка.BUYER);//  GLN покупця
	HEAD_XDTO.DELIVERYPLACE    = ДанныеЗаказа.DELIVERYPLACE; //GLN місця доставки
	HEAD_XDTO.SENDER           = XMLСтрока(Шапка.SENDER);// GLN відправника повідомлення
	HEAD_XDTO.RECIPIENT        = XMLСтрока(Шапка.RECIPIENT);// GLN одержувача повідомлення
	HEAD_XDTO.FINALRECIPIENT   = ДанныеЗаказа.DELIVERYPLACE;// GLN кінцевий одержувача повідомлення
	HEAD_XDTO.EDIINTERCHANGEID = XMLСтрока(Шапка.EDIINTERCHANGEID);// Номер транзакції
	
	PACKINGSEQUENCE_XDTO = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://silpo.com.ua","PACKINGSEQUENCE")); //Робота з товарними позиціями (початок блоку)
	PACKINGSEQUENCE_XDTO.HIERARCHICALID = "1";
	
	DOC_SUM = 0;
	
	Пока Товары.Следующий() Цикл 
		
		POSITION_XDTO = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://silpo.com.ua","POSITION"));  //Робота з товарними позиціями (початок блоку)
		ORDER_STRING = НайтиСтрокуЗаказа(POSITION_XDTO.PRODUCT,Товары,ДанныеЗаказа.POSITIONS,
		Документ.Контрагент.Префикс, Документ.Контрагент.ЗначСимволы);
		
		POSITION_XDTO.POSITIONNUMBER = XMLСтрока(Товары.POSITIONNUMBER);// Номер товарної позиції
		POSITION_XDTO.PRODUCT = XMLСтрока(ORDER_STRING.PRODUCT); //берем из заказа. Штрихкод продукту
		POSITION_XDTO.PRODUCTIDBUYER = XMLСтрока(ORDER_STRING.PRODUCTIDBUYER);//берем из заказа;  Артикул в БД покупця
		POSITION_XDTO.BUYERNUMBER = 0;//?  Внутрішній системний номер артикулу в БД покупця
		POSITION_XDTO.DELIVEREDQUANTITY = XMLСтрока(Товары.DELIVEREDQUANTITY);//;кількість, відвантаженого товару що поставляється
		POSITION_XDTO.DELIVEREDUNIT = XMLСтрока(Товары.DELIVEREDUNIT); //Од. виміру з документа відвантаження.
		POSITION_XDTO.ORDEREDQUANTITY = XMLСтрока(ORDER_STRING.ORDEREDQUANTITY);//берем из заказа.  Замовлена кількість
		POSITION_XDTO.ADVICEPRICE  = 0;//? Рекомендована ціна (державою
		
		//Необходима цена без НДС
		Если  Товары.СуммаВключаетНДС Тогда
			
			PRICE = Ценообразование.ПересчитатьЦенуПриИзмененииФлаговНалогов(Товары.PRICE,
			Неопределено,
			Истина,
			Истина,
			Ложь,
			УчетНДС.ПолучитьСтавкуНДС(Товары.TAXRATE));
			
		Иначе
			PRICE = Товары.PRICE;
		КонецЕсли;
		
		POSITION_XDTO.PRICE = PRICE; //берем из накладной.   Ціна продукту без ПДВ
		POSITION_XDTO.TAXRATE = XMLСтрока(УчетНДС.ПолучитьСтавкуНДС(Товары.TAXRATE)); //Ставка ПДВ (20%, 19%, 16%, 14%, 7%, 2%, 0%)
		POSITION_XDTO.AMOUNT = XMLСтрока(Товары.AMOUNT);//Сума товару без ПДВ
		POSITION_XDTO.GOODDATE  = '00010101';//?  Термін придатності
		POSITION_XDTO.BRUTTOWEIGHT = 0;//Вага брутто
		
		PACKINGSEQUENCE_XDTO.POSITION.Добавить(POSITION_XDTO);
				
	КонецЦикла;
	
	HEAD_XDTO.PACKINGSEQUENCE.Добавить(PACKINGSEQUENCE_XDTO);
	DESADV_XDTO.HEAD.Добавить(HEAD_XDTO);
	
	ФабрикаXDTO.ЗаписатьXML(file_XML, DESADV_XDTO);
	
	Возврат file_XML.Закрыть();
	
КонецФункции

//Возвращает уведомление об отгрузке в xml
Функция desadv_ФайлСтрокой_Chudo_market(Документ) Экспорт
	
	Если Не ЗначениеЗаполнено(Документ.ORDERNUMBER)
		#Если клиент  Тогда
			Тогда Сообщить("Не заполнено значение номера заказа клиента, выгрузка в EDIN не выполнена.");
		#КонецЕсли
		Возврат ""
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Документ.Контрагент.GLN)
		#Если клиент  Тогда
			Тогда Сообщить("Не заполнено значение GLN клиента, выгрузка в EDIN не выполнена."); 
		#КонецЕсли
		Возврат ""
	КонецЕсли;
	
	Контрагент_GLN = ?(ЗначениеЗаполнено(Документ.EDIN_Контрагент), Документ.EDIN_Контрагент.GLN,
	Документ.Контрагент.GLN);
	
	ДанныеЗаказа = ПолучитьДанныеЗаказаПокупателя(Документ.ORDERNUMBER, Контрагент_GLN,
	Документ.Контрагент.НезначСправа);
	
	Если Не ЗначениеЗаполнено(ДанныеЗаказа) Тогда
		#Если клиент  Тогда
			Сообщить("Не найдены данные заказа в базе EDIN, выгрузка не выполнена.");
		#КонецЕсли
		Возврат ""
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Дата КАК DATE,
	|	РеализацияТоваровУслуг.Номер КАК NUMBER,
	|	РеализацияТоваровУслуг.DELIVERYDATE,
	|	РеализацияТоваровУслуг.DELIVERYTIME,
	|	РеализацияТоваровУслуг.ORDERNUMBER,
	|	РеализацияТоваровУслуг.ORDERDATE,
	|	РеализацияТоваровУслуг.DELIVERYNOTENUMBER,
	|	РеализацияТоваровУслуг.DELIVERYNOTEDATE,
	|	РеализацияТоваровУслуг.SHIPMENTS,
	|	РеализацияТоваровУслуг.INFO,
	|	РеализацияТоваровУслуг.CAMPAIGNNUMBER,
	|	РеализацияТоваровУслуг.TRANSPORTTYPE,
	|	РеализацияТоваровУслуг.TRANSPORTERTYPE,
	|	РеализацияТоваровУслуг.Организация.GLN КАК SUPPLIER,
	|	РеализацияТоваровУслуг.Организация.GLN КАК SENDER,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.EDIN_Контрагент <> ЗНАЧЕНИЕ(Справочник.EDIN_Контрагент.ПустаяСсылка)
	|			ТОГДА РеализацияТоваровУслуг.EDIN_Контрагент.GLN
	|		ИНАЧЕ РеализацияТоваровУслуг.Контрагент.GLN
	|	КОНЕЦ КАК BUYER,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.EDIN_Контрагент <> ЗНАЧЕНИЕ(Справочник.EDIN_Контрагент.ПустаяСсылка)
	|			ТОГДА РеализацияТоваровУслуг.EDIN_Контрагент.GLN
	|		ИНАЧЕ РеализацияТоваровУслуг.Контрагент.GLN
	|	КОНЕЦ КАК RECIPIENT,
	|	"""" КАК DELIVERYPLACE,
	|	"""" КАК EDIINTERCHANGEID
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	""1"" КАК HIERARCHICALID,
	|	РеализацияТоваровУслугТовары.НомерСтроки КАК POSITIONNUMBER,
	|	РеализацияТоваровУслугТовары.umk_КодКлиента КАК PRODUCT,
	|	РеализацияТоваровУслугТовары.EDIN_штрихкод,
	|	РеализацияТоваровУслугТовары.EDIN_артикулПокупателя КАК EDIN_артикулПокупателя,
	|	РеализацияТоваровУслугТовары.EDIN_артикулПродавца,
	|	РеализацияТоваровУслугТовары.Количество КАК DELIVEREDQUANTITY,
	|	"""" КАК ORDEREDQUANTITY,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслугТовары.Ссылка.СуммаВключаетНДС
	|			ТОГДА РеализацияТоваровУслугТовары.Сумма - РеализацияТоваровУслугТовары.СуммаНДС
	|		ИНАЧЕ РеализацияТоваровУслугТовары.Сумма
	|	КОНЕЦ КАК AMOUNT,
	|	РеализацияТоваровУслугТовары.Цена КАК PRICE,
	|	РеализацияТоваровУслугТовары.Номенклатура.НаименованиеПолное КАК Номенклатура,
	|	РеализацияТоваровУслугТовары.ХарактеристикаНоменклатуры КАК Характеристика,
	|	РеализацияТоваровУслугТовары.Ссылка.Дата,
	|	"""" КАК PRICEWITHVAT,
	|	РеализацияТоваровУслугТовары.СтавкаНДС КАК TAXRATE,
	|	КлассификаторЕдиницИзмерения.UNIT КАК DELIVEREDUNIT,
	|	"""" КАК ORDERUNIT,
	|	РеализацияТоваровУслугТовары.Ссылка.СуммаВключаетНДС
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
	|		ПО РеализацияТоваровУслугТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору = КлассификаторЕдиницИзмерения.Ссылка
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	POSITIONNUMBER";
	
	Запрос.УстановитьПараметр("Ссылка", Документ);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Шапка = РезультатЗапроса[0].Выбрать();
	Товары = РезультатЗапроса[1].Выбрать(); 
	
	//Запишем результат в xml
	file_XML  = Новый ЗаписьXML();
	file_XML.УстановитьСтроку("UTF-8");
		
	file_XML.ЗаписатьОбъявлениеXML();
		
	Шапка.Следующий();
	
	DESADV_XDTO = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://silpo.com.ua","DESADV")); //Початок документа
	
	НомерНакладной                 = ОбщегоНазначения.ПолучитьНомерНаПечать(Документ);
	
	DESADV_XDTO.NUMBER             = XMLСтрока(НомерНакладной);//Номер повідомлення про відвантаження
	DESADV_XDTO.DATE               = XMLСтрока(Формат(Шапка.DATE,"ДФ=гггг-ММ-дд"));//Дата документа
	DESADV_XDTO.DELIVERYDATE       = XMLСтрока(Формат(Шапка.DELIVERYDATE,"ДФ=гггг-ММ-дд"));//Дата поставки
	DESADV_XDTO.DELIVERYTIME       = ДанныеЗаказа.DELIVERYTIME; //берем из заказа.;Час поставки
	DESADV_XDTO.ORDERNUMBER        = XMLСтрока(СокрЛП(Шапка.ORDERNUMBER));// Номер замовлення
	DESADV_XDTO.ORDERDATE          = XMLСтрока(Формат(Шапка.ORDERDATE,"ДФ=гггг-ММ-дд"));//Дата замовлення
	
	DESADV_XDTO.ORDRSPNUMBER = "";//? Номер підтвердження замовлення
	DESADV_XDTO.ORDRSPDATE   = '00010101';//? Дата підтвердження замовлення
	
	DESADV_XDTO.DELIVERYNOTENUMBER = XMLСтрока(НомерНакладной);//Номер накладної
	DESADV_XDTO.DELIVERYNOTEDATE   = XMLСтрока(Формат(Шапка.DELIVERYNOTEDATE,"ДФ=гггг-ММ-дд"));//Дата накладної
	DESADV_XDTO.CAMPAIGNNUMBER     = XMLСтрока(Шапка.CAMPAIGNNUMBER);//Номер договору на поставку
	DESADV_XDTO.TRANSPORTQUANTITY              = 1;//?  Загальна кількість машин; кількість повідомлень про відвантаження в межах одного замовлення покупця(число >1 або =1)
	DESADV_XDTO.TRANSPORTID                    = 1;//? Порядковий номер транспортного засобу/повідомленя про відвантаження (число < або = TRANSPORTQUANTITY й не може бути більше)
	DESADV_XDTO.PACKAGEWEIGHT                  = 0;//? Вага по накладній
	
	HEAD_XDTO = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://silpo.com.ua","HEAD")); //Початок основного блоку
	
	HEAD_XDTO.SUPPLIER         = XMLСтрока(Шапка.SUPPLIER);// GLN постачальника
	HEAD_XDTO.BUYER            = XMLСтрока(Шапка.BUYER);//  GLN покупця
	HEAD_XDTO.DELIVERYPLACE    = ДанныеЗаказа.DELIVERYPLACE; //GLN місця доставки
	HEAD_XDTO.SENDER           = XMLСтрока(Шапка.SENDER);// GLN відправника повідомлення
	HEAD_XDTO.RECIPIENT        = XMLСтрока(Шапка.RECIPIENT);// GLN одержувача повідомлення
	HEAD_XDTO.FINALRECIPIENT   = ДанныеЗаказа.DELIVERYPLACE;// GLN кінцевий одержувача повідомлення
	HEAD_XDTO.EDIINTERCHANGEID = XMLСтрока(Шапка.EDIINTERCHANGEID);// Номер транзакції
	
	PACKINGSEQUENCE_XDTO = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://silpo.com.ua","PACKINGSEQUENCE")); //Робота з товарними позиціями (початок блоку)
	PACKINGSEQUENCE_XDTO.HIERARCHICALID = "1";
	
	DOC_SUM = 0;
	
	Пока Товары.Следующий() Цикл 
		
		POSITION_XDTO = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://silpo.com.ua","POSITION"));  //Робота з товарними позиціями (початок блоку)
		ORDER_STRING = НайтиСтрокуЗаказа(POSITION_XDTO.PRODUCT,Товары,ДанныеЗаказа.POSITIONS,
		Документ.Контрагент.Префикс, Документ.Контрагент.ЗначСимволы);
		
		POSITION_XDTO.POSITIONNUMBER = XMLСтрока(Товары.POSITIONNUMBER);// Номер товарної позиції
		POSITION_XDTO.PRODUCT = XMLСтрока(ORDER_STRING.PRODUCT); //берем из заказа. Штрихкод продукту
		POSITION_XDTO.PRODUCTIDBUYER = XMLСтрока(ORDER_STRING.PRODUCTIDBUYER);//берем из заказа;  Артикул в БД покупця
		POSITION_XDTO.BUYERNUMBER = 0;//?  Внутрішній системний номер артикулу в БД покупця
		POSITION_XDTO.DELIVEREDQUANTITY = XMLСтрока(Товары.DELIVEREDQUANTITY);//;кількість, відвантаженого товару що поставляється
		POSITION_XDTO.DELIVEREDUNIT = XMLСтрока(Товары.DELIVEREDUNIT); //Од. виміру з документа відвантаження.
		
		POSITION_XDTO.ORDEREDQUANTITY = XMLСтрока(ORDER_STRING.ORDEREDQUANTITY);//берем из заказа.  Замовлена кількість
		POSITION_XDTO.ADVICEPRICE  = 0;//? Рекомендована ціна (державою
		
		//Необходима цена без НДС
		Если  Товары.СуммаВключаетНДС Тогда
			
			PRICE = Ценообразование.ПересчитатьЦенуПриИзмененииФлаговНалогов(Товары.PRICE,
			Неопределено,
			Истина,
			Истина,
			Ложь,
			УчетНДС.ПолучитьСтавкуНДС(Товары.TAXRATE));
			
		Иначе
			PRICE = Товары.PRICE;
		КонецЕсли;
		
		POSITION_XDTO.PRICE = PRICE; //берем из накладной.   Ціна продукту без ПДВ
		POSITION_XDTO.TAXRATE = XMLСтрока(УчетНДС.ПолучитьСтавкуНДС(Товары.TAXRATE)); //Ставка ПДВ (20%, 19%, 16%, 14%, 7%, 2%, 0%)
		POSITION_XDTO.AMOUNT = XMLСтрока(Товары.AMOUNT);//Сума товару без ПДВ
		
		POSITION_XDTO.GOODDATE  = '00010101';//?  Термін придатності
		POSITION_XDTO.BRUTTOWEIGHT = 0;//Вага брутто
		
		PACKINGSEQUENCE_XDTO.POSITION.Добавить(POSITION_XDTO);
				
	КонецЦикла;
	
	HEAD_XDTO.PACKINGSEQUENCE.Добавить(PACKINGSEQUENCE_XDTO);
	DESADV_XDTO.HEAD.Добавить(HEAD_XDTO);
	
	ФабрикаXDTO.ЗаписатьXML(file_XML, DESADV_XDTO);
	
	Возврат file_XML.Закрыть();
	
КонецФункции

#КонецОбласти

#Область Счета

//Возвращает уведомление об отгрузке в xml
Функция invoice_ФайлСтрокой(Документ) Экспорт
	
	Если Не ЗначениеЗаполнено(Документ.ORDERNUMBER)
		#Если клиент  Тогда
			Тогда Сообщить("Не заполнено значение номера заказа клиента, выгрузка в EDIN не выполнена.");
		#КонецЕсли
		Возврат ""
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Документ.Контрагент.GLN)
		#Если клиент  Тогда
			Тогда Сообщить("Не заполнено значение GLN клиента, выгрузка в EDIN не выполнена."); 
		#КонецЕсли
		Возврат ""
	КонецЕсли;
	
	Контрагент_GLN = ?(ЗначениеЗаполнено(Документ.EDIN_Контрагент), Документ.EDIN_Контрагент.GLN,
	Документ.Контрагент.GLN);
	
	ДанныеЗаказа = ПолучитьДанныеЗаказаПокупателя(Документ.ORDERNUMBER, Контрагент_GLN,
	Документ.Контрагент.НезначСправа);
	
	Если Не ЗначениеЗаполнено(ДанныеЗаказа) Тогда
		#Если клиент  Тогда
			Сообщить("Не найдены данные заказа в базе EDIN, выгрузка не выполнена.");
		#КонецЕсли
		Возврат ""
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.DATE_ КАК DATE,
	|	РеализацияТоваровУслуг.NUMBER_ КАК NUMBER,
	|	РеализацияТоваровУслуг.DELIVERYDATE,
	|	РеализацияТоваровУслуг.DELIVERYTIME,
	|	РеализацияТоваровУслуг.ORDERNUMBER,
	|	РеализацияТоваровУслуг.ORDERDATE,
	|	РеализацияТоваровУслуг.DELIVERYNOTENUMBER,
	|	РеализацияТоваровУслуг.DELIVERYNOTEDATE,
	|	РеализацияТоваровУслуг.SHIPMENTS,
	|	РеализацияТоваровУслуг.INFO,
	|	РеализацияТоваровУслуг.CAMPAIGNNUMBER,
	|	РеализацияТоваровУслуг.TRANSPORTTYPE,
	|	РеализацияТоваровУслуг.TRANSPORTERTYPE,
	|	РеализацияТоваровУслуг.Организация.GLN КАК SUPPLIER,
	|	РеализацияТоваровУслуг.Организация.GLN КАК SENDER,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.EDIN_Контрагент <> ЗНАЧЕНИЕ(Справочник.EDIN_Контрагент.ПустаяСсылка)
	|			ТОГДА РеализацияТоваровУслуг.EDIN_Контрагент.GLN
	|		ИНАЧЕ РеализацияТоваровУслуг.Контрагент.GLN
	|	КОНЕЦ КАК BUYER,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.EDIN_Контрагент <> ЗНАЧЕНИЕ(Справочник.EDIN_Контрагент.ПустаяСсылка)
	|			ТОГДА РеализацияТоваровУслуг.EDIN_Контрагент.GLN
	|		ИНАЧЕ РеализацияТоваровУслуг.Контрагент.GLN
	|	КОНЕЦ КАК RECIPIENT,
	|	РеализацияТоваровУслуг.Контрагент КАК Покупатель,
	|	РеализацияТоваровУслуг.Организация КАК Поставщик,
	|	"""" КАК DELIVERYPLACE,
	|	"""" КАК EDIINTERCHANGEID,
	|	РеализацияТоваровУслуг.Организация.НаименованиеПолное КАК SUPPLIERNAME,
	|	""ВУЛИЦЯ ПУШКІНСЬКА, будинок 104"" КАК SUPPLIERADRESS,
	|	""Харківська обл., місто Харків"" КАК SUPPLIERCITY,
	|	""61023"" КАК SUPPLIERZIP
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	""1"" КАК HIERARCHICALID,
	|	РеализацияТоваровУслугТовары.НомерСтроки КАК POSITIONNUMBER,
	|	РеализацияТоваровУслугТовары.umk_КодКлиента КАК PRODUCT,
	|	"""" КАК PRODUCTIDBUYER,
	|	РеализацияТоваровУслугТовары.Количество КАК DELIVEREDQUANTITY,
	|	"""" КАК ORDEREDQUANTITY,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслугТовары.Ссылка.СуммаВключаетНДС
	|			ТОГДА РеализацияТоваровУслугТовары.Сумма - РеализацияТоваровУслугТовары.СуммаНДС
	|		ИНАЧЕ РеализацияТоваровУслугТовары.Сумма
	|	КОНЕЦ КАК AMOUNT,
	|	РеализацияТоваровУслугТовары.Цена КАК PRICE,
	|	РеализацияТоваровУслугТовары.Номенклатура.НаименованиеПолное КАК Номенклатура,
	|	РеализацияТоваровУслугТовары.ХарактеристикаНоменклатуры КАК Характеристика,
	|	РеализацияТоваровУслугТовары.Ссылка.Дата,
	|	"""" КАК PRICEWITHVAT,
	|	РеализацияТоваровУслугТовары.СтавкаНДС КАК TAXRATE,
	|	КлассификаторЕдиницИзмерения.UNIT КАК DELIVEREDUNIT,
	|	"""" КАК ORDERUNIT,
	|	РеализацияТоваровУслугТовары.EDIN_штрихкод,
	|	РеализацияТоваровУслугТовары.EDIN_артикулПокупателя,
	|	РеализацияТоваровУслугТовары.EDIN_артикулПродавца
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
	|		ПО РеализацияТоваровУслугТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору = КлассификаторЕдиницИзмерения.Ссылка
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	POSITIONNUMBER";
	
	Запрос.УстановитьПараметр("Ссылка", Документ);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Шапка = РезультатЗапроса[0].Выбрать();
	Товары = РезультатЗапроса[1].Выбрать(); 
	
	//Запишем результат в xml
	
	file_XML  = Новый ЗаписьXML();
	file_XML.УстановитьСтроку("UTF-8");
	
	file_XML.ЗаписатьОбъявлениеXML();
	
	Шапка.Следующий();
	
	КодЯзыкаПечать = Локализация.ПолучитьЯзыкФормированияПечатныхФорм(УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "РежимФормированияПечатныхФорм"));
	
	СведенияОПоставщике = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Поставщик, Шапка.DATE,,,КодЯзыкаПечать);
	СведенияОПокупателе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Покупатель, Шапка.DATE,,,КодЯзыкаПечать);
	
	
	INVOICE_XDTO = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://umk2.com.ua","INVOICE"));
	INVOICE_XDTO.DOCUMENTNAME = "380";
	
	
	INVOICE_XDTO.NUMBER             = XMLСтрока(Шапка.NUMBER);//"4489279826";
	INVOICE_XDTO.DATE               = XMLСтрока(Формат(Шапка.DATE,"ДФ=гггг-ММ-дд"));//2020-09-26";
	INVOICE_XDTO.INVOICETYPE        = 0;
	INVOICE_XDTO.DELIVERYDATE       = XMLСтрока(Формат(Шапка.DELIVERYDATE,"ДФ=гггг-ММ-дд"));//"2020-09-26";
	INVOICE_XDTO.DELIVERYTIME       = ДанныеЗаказа.DELIVERYTIME; //берем из заказа.;//XMLСтрока(Формат(Шапка.DELIVERYTIME,"ДФ=ЧЧ:мм"));//"00:00";
	INVOICE_XDTO.CURRENCY           =  "UAH";
	
	INVOICE_XDTO.ORDERNUMBER        = XMLСтрока(Шапка.ORDERNUMBER);//"4489279826";
	INVOICE_XDTO.ORDERDATE          = XMLСтрока(Формат(Шапка.ORDERDATE,"ДФ=гггг-ММ-дд"));//"2020-09-25";
	INVOICE_XDTO.DELIVERYNOTENUMBER = XMLСтрока(Формат(Шапка.DELIVERYNOTENUMBER,"ДФ=гггг-ММ-дд"));//"11-26-09-20";
	INVOICE_XDTO.DELIVERYNOTEDATE   = XMLСтрока(Формат(Шапка.DELIVERYNOTEDATE,"ДФ=гггг-ММ-дд"));//"2020-09-26";
	INVOICE_XDTO.VAT                = 20;//
	
	
	HEAD_XDTO = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://umk2.com.ua","HEAD"));
	
	HEAD_XDTO.SUPPLIER         = XMLСтрока(Шапка.SUPPLIER);//"9864232343295";
	HEAD_XDTO.SUPPLIERNAME     = XMLСтрока(Шапка.SUPPLIERNAME);
	HEAD_XDTO.SUPPLIERADRESS   = XMLСтрока(Шапка.SUPPLIERADRESS);
	HEAD_XDTO.SUPPLIERCITY     = XMLСтрока(Шапка.SUPPLIERCITY);
	HEAD_XDTO.SUPPLIERZIP      = XMLСтрока(Шапка.SUPPLIERZIP);
	HEAD_XDTO.BUYER            = XMLСтрока(Шапка.BUYER);//"9864066987535";
	HEAD_XDTO.BUYERNAME        = СведенияОПокупателе.Представление; //Ім’я покупця
	HEAD_XDTO.BUYERADRESS      = СведенияОПокупателе.ЮридическийАдрес; //Адреса покупця
	HEAD_XDTO.BUYERCITY        = ""; //Місто покупця
	HEAD_XDTO.BUYERZIP         = "-";//Індекс покупця
	HEAD_XDTO.BUYERKPP         = "-";
	HEAD_XDTO.BUYERINN         = СведенияОПокупателе.ИНН;//ІПН покупця;
	HEAD_XDTO.DELIVERYPLACE    = ДанныеЗаказа.DELIVERYPLACE; //берем из заказа.
	HEAD_XDTO.INVOICEPARTNER   = ""; //GLN платника;
	HEAD_XDTO.SENDER           = XMLСтрока(Шапка.SENDER);//"9864232343295";  GLN відправника повідомлення
	HEAD_XDTO.RECIPIENT        = XMLСтрока(Шапка.RECIPIENT);//"9864066987535"; GLN одержувача повідомлення
	
	//Если Не ЗначениеЗаполнено(Документ.Контрагент.Префикс) Или 
	Если Не ЗначениеЗаполнено(Документ.Контрагент.ЗначСимволы)
		Тогда 
		//Парам_ШК_заполнены = Ложь;
		#Если Клиент Тогда
			Сообщить("В справочнике контрагента не заполнены значения параметров штрихкода, строки заказа клиента не будут найдены.");
		#КонецЕсли
	КонецЕсли;
	
	DOC_SUM = 0;
	
	Пока Товары.Следующий() Цикл 
		
		POSITION_XDTO = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://umk2.com.ua","POSITION"));
		
		POSITION_XDTO.POSITIONNUMBER = XMLСтрока(Товары.POSITIONNUMBER);//"1";
		POSITION_XDTO.PRODUCT = XMLСтрока(Товары.PRODUCT);//"2086668100007"; ///Из строки документа.
		POSITION_XDTO.UNITPRICE = 0;
		POSITION_XDTO.INVOICEDQUANTITY = XMLСтрока(Товары.DELIVEREDQUANTITY);//берем из накладной;
		
		//Строки из заказа клиента
		ORDER_STRING = НайтиСтрокуЗаказа(POSITION_XDTO.PRODUCT, Товары, ДанныеЗаказа.POSITIONS,
		Документ.Контрагент.Префикс, Документ.Контрагент.ЗначСимволы);
		POSITION_XDTO.PRODUCTIDBUYER = XMLСтрока(ORDER_STRING.PRODUCTIDBUYER);//берем из заказа."866681";
		POSITION_XDTO.INVOICEUNIT = XMLСтрока(ORDER_STRING.ORDERUNIT);//берем из заказа. 
		POSITION_XDTO.UNITPRICE = ORDER_STRING.ORDERPRICE; //берем из заказа. 
		POSITION_XDTO.PRODUCT = XMLСтрока(ORDER_STRING.PRODUCT); //берем из заказа.
		
		POSITION_XDTO.AMOUNT = XMLСтрока(Товары.AMOUNT);//
		
		Если Документ.УчитыватьНДС И НЕ Документ.СуммаВключаетНДС Тогда
			GROSSPRICE =  Формат(POSITION_XDTO.UNITPRICE *(1+УчетНДС.ПолучитьСтавкуНДС(Товары.TAXRATE)/100),"ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧГ=");
			Попытка
				GROSSPRICE = Число(GROSSPRICE);	
			Исключение
				GROSSPRICE = 0;
			КонецПопытки;
			POSITION_XDTO.GROSSPRICE =  GROSSPRICE;//С НДС
		КонецЕсли;
		POSITION_XDTO.DESCRIPTION = XMLСтрока(ПредставлениеНоменклатуры(Товары.Номенклатура, Товары.Характеристика, Товары.Дата));//"Ковбаса Баликова_варена 1г целофан_в/у вагова Український МК";
		POSITION_XDTO.AMOUNTWITHVAT = GROSSPRICE * POSITION_XDTO.INVOICEDQUANTITY;
		
		TAX_XDTO =  ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://umk2.com.ua","TAX")); 
		TAX_XDTO.TAXTYPECODE = "VAT";
		TAX_XDTO.TAXRATE     = XMLСтрока(УчетНДС.ПолучитьСтавкуНДС(Товары.TAXRATE));
		TAX_XDTO.TAXAMOUNT   = POSITION_XDTO.INVOICEDQUANTITY*(POSITION_XDTO.GROSSPRICE-POSITION_XDTO.UNITPRICE);
		TAX_XDTO.CATEGORY    = "S";
		
		POSITION_XDTO.TAX.Добавить(TAX_XDTO);
		HEAD_XDTO.POSITION.Добавить(POSITION_XDTO);		
		
		DOC_SUM = DOC_SUM + (POSITION_XDTO.GROSSPRICE)*POSITION_XDTO.INVOICEDQUANTITY; //цена с НДС из заказа на количество из накладной.
		
	КонецЦикла;
	
	Отклонение = DOC_SUM - Документ.СуммаДокумента;
	
	Если Отклонение < -1 Или Отклонение > 1 Тогда
		#Если Клиент Тогда
			Сообщить("Не совпадают суммы накладной и счета.", СтатусСообщения.Важное);
		#КонецЕсли	
	КонецЕсли;
	
	INVOICE_XDTO.HEAD.Добавить(HEAD_XDTO);
	
	ФабрикаXDTO.ЗаписатьXML(file_XML, INVOICE_XDTO);
	
	Возврат file_XML.Закрыть();
	
КонецФункции

#КонецОбласти

#Область РасходныеНакладные

//Возвращает «Цінова накладна» (DOCUMENTINVOICE_PRN) в xml
//
Функция DOCUMENTINVOICE_PRN_fileString_Silpo(Документ) Экспорт
	
	Если Не ЗначениеЗаполнено(Документ.ORDERNUMBER)
		#Если клиент  Тогда
			Тогда Сообщить("Не заполнено значение номера заказа клиента, выгрузка в EDIN не выполнена.");
		#КонецЕсли
		Возврат ""
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Документ.Контрагент.GLN)
		#Если клиент  Тогда
			Тогда Сообщить("Не заполнено значение GLN клиента, выгрузка в EDIN не выполнена."); 
		#КонецЕсли
		Возврат ""
	КонецЕсли;
	
	Контрагент_GLN = ?(ЗначениеЗаполнено(Документ.EDIN_Контрагент), Документ.EDIN_Контрагент.GLN,
	Документ.Контрагент.GLN);
	
	ДанныеЗаказа = ПолучитьДанныеЗаказаПокупателя(Документ.ORDERNUMBER, Контрагент_GLN,
	Документ.Контрагент.НезначСправа);
	
	Если Не ЗначениеЗаполнено(ДанныеЗаказа) Тогда
		#Если клиент  Тогда
			Сообщить("Не найдены данные заказа в базе EDIN, выгрузка не выполнена.");
		#КонецЕсли
		Возврат ""
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Номер КАК InvoiceNumber,
	|	РеализацияТоваровУслуг.Дата КАК InvoiceDate,
	|	""PRN"" КАК DocumentFunctionCode,
	|	РеализацияТоваровУслуг.ДоговорКонтрагента.Номер КАК ContractNumber,
	|	РеализацияТоваровУслуг.ДоговорКонтрагента.Дата КАК ContractDate,
	|	1 КАК InvoiceQuantity,
	|	1 КАК InvoiceSequences,
	|	РеализацияТоваровУслуг.ORDERNUMBER КАК BuyerOrderNumber,
	|	РеализацияТоваровУслуг.ORDERDATE КАК BuyerOrderDate,
	|	РеализацияТоваровУслуг.Номер КАК OriginalInvoiceNumber,
	|	РеализацияТоваровУслуг.Дата КАК OriginalInvoiceDate,
	|	РеализацияТоваровУслуг.Дата,
	|	РеализацияТоваровУслуг.Контрагент КАК Покупатель,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.EDIN_Контрагент <> ЗНАЧЕНИЕ(Справочник.EDIN_Контрагент.ПустаяСсылка)
	|			ТОГДА РеализацияТоваровУслуг.EDIN_Контрагент.GLN
	|		ИНАЧЕ РеализацияТоваровУслуг.Контрагент.GLN
	|	КОНЕЦ КАК ILN_Buyer,
	|	РеализацияТоваровУслуг.Организация КАК Поставщик,
	|	РеализацияТоваровУслуг.БанковскийСчетОрганизации,
	|	РеализацияТоваровУслуг.Организация.GLN КАК ILN_Seller,
	|	РеализацияТоваровУслуг.NUMBER_ КАК NUMBER,
	|	РеализацияТоваровУслуг.DELIVERYDATE,
	|	РеализацияТоваровУслуг.DELIVERYTIME,
	|	РеализацияТоваровУслуг.DELIVERYNOTENUMBER,
	|	РеализацияТоваровУслуг.DELIVERYNOTEDATE,
	|	РеализацияТоваровУслуг.SHIPMENTS,
	|	РеализацияТоваровУслуг.INFO,
	|	РеализацияТоваровУслуг.CAMPAIGNNUMBER,
	|	РеализацияТоваровУслуг.TRANSPORTTYPE,
	|	РеализацияТоваровУслуг.TRANSPORTERTYPE,
	|	РеализацияТоваровУслуг.Организация.GLN КАК SUPPLIER,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.EDIN_Контрагент <> ЗНАЧЕНИЕ(Справочник.EDIN_Контрагент.ПустаяСсылка)
	|			ТОГДА РеализацияТоваровУслуг.EDIN_Контрагент.GLN
	|		ИНАЧЕ РеализацияТоваровУслуг.Контрагент.GLN
	|	КОНЕЦ КАК RECIPIENT,
	|	"""" КАК DELIVERYPLACE,
	|	"""" КАК EDIINTERCHANGEID
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	""1"" КАК HIERARCHICALID,
	|	Goods.НомерСтроки КАК LineNumber,
	|	КлассификаторУКТВЭД.Код КАК ExternalItemCode,
	|	Goods.Количество КАК InvoiceQuantity,
	|	Goods.Номенклатура.НаименованиеПолное КАК ItemDescription,
	|	КлассификаторЕдиницИзмерения.UNIT КАК BuyerUnitOfMeasure,
	|	Goods.СтавкаНДС КАК TaxRate,
	|	Goods.Цена КАК Price,
	|	Goods.umk_КодКлиента КАК PRODUCT,
	|	Goods.EDIN_штрихкод,
	|	Goods.EDIN_артикулПокупателя КАК EDIN_артикулПокупателя,
	|	Goods.EDIN_артикулПродавца,
	|	"""" КАК ORDEREDQUANTITY,
	|	ВЫБОР
	|		КОГДА Goods.Ссылка.СуммаВключаетНДС
	|			ТОГДА Goods.Сумма - Goods.СуммаНДС
	|		ИНАЧЕ Goods.Сумма
	|	КОНЕЦ КАК AMOUNT,
	|	Goods.ХарактеристикаНоменклатуры КАК Характеристика,
	|	Goods.Ссылка.Дата,
	|	"""" КАК PRICEWITHVAT,
	|	"""" КАК ORDERUNIT,
	|	Goods.Ссылка.СуммаВключаетНДС
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК Goods
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
	|		ПО Goods.ЕдиницаИзмерения.ЕдиницаПоКлассификатору = КлассификаторЕдиницИзмерения.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлассификаторУКТВЭД КАК КлассификаторУКТВЭД
	|		ПО Goods.Номенклатура.НоменклатураГТД = КлассификаторУКТВЭД.Ссылка
	|ГДЕ
	|	Goods.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	LineNumber";
	
	Запрос.УстановитьПараметр("Ссылка", Документ);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Header = РезультатЗапроса[0].Выбрать();
	Goods = РезультатЗапроса[1].Выбрать(); 
	
	//Запишем результат в xml
	file_XML  = Новый ЗаписьXML();
    file_XML.УстановитьСтроку("UTF-8");
	file_XML.ЗаписатьОбъявлениеXML();
		
	Header.Следующий();
	
	Document_Invoice = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://silpo-documentinvoice_prn.com.ua","Document-Invoice")); //Початок документа
	
	Invoice_Header= ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://silpo-documentinvoice_prn.com.ua","Invoice-Header"));  // Заголовок (початок блоку)
	ЗаполнитьЗначенияСвойств(Invoice_Header,Header);
	Document_Invoice.Invoice_Header.Добавить(Invoice_Header);
	
	Invoice_Reference= ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://silpo-documentinvoice_prn.com.ua","Invoice-Reference"));  //Документ-підстава (початок блоку)
	
	Order = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://silpo-documentinvoice_prn.com.ua","Order"));  // Замовлення (початок блоку
	ЗаполнитьЗначенияСвойств(Order,Header);
	
	Invoice = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://silpo-documentinvoice_prn.com.ua","Invoice")); // Накладна за кількістю (початок блоку)
	ЗаполнитьЗначенияСвойств(Invoice,Header);
	
	Invoice_Reference.Order.Добавить(Order);
	Invoice_Reference.Invoice.Добавить(Invoice);
	
	Document_Invoice.Invoice_Reference.Добавить(Invoice_Reference);
	
	Invoice_Parties= ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://silpo-documentinvoice_prn.com.ua","Invoice-Parties")); // Сторони (контрагенти), між якими укладено документ (початок блоку)
	
	
	СведенияОПокупателе 	= УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Header.Покупатель, Header.Дата);
	
	Buyer= ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://silpo-documentinvoice_prn.com.ua","Buyer")); //Блок покупця (початок)
	Buyer.ILN = Header.ILN_Buyer; //  Глобальний номер розташування (GLN) контрагента
	Buyer.TaxID = СведенияОПокупателе.ИНН; // Податковий ідентифікаційний номер
	Buyer.UtilizationRegisterNumber = СведенияОПокупателе.КодПоЕДРПОУ; // Код ЄДРПОУ
	Buyer.Name = СведенияОПокупателе.ПолноеНаименование; // Назва контрагента
	
	СведенияОПоставщике 	= УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Header.Поставщик, Header.Дата,, Header.БанковскийСчетОрганизации);
	
	Seller = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://silpo-documentinvoice_prn.com.ua","Seller"));  // Блок продавця (початок)
	Seller.ILN = Header.ILN_Seller;  // Глобальний номер розташування (GLN) контрагента
	Seller.TaxID = СведенияОПоставщике.ИНН;// Податковий ідентифікаційний номер
	Seller.CodeByBuyer = Header.ContractNumber;  //Номер договіру?
	Seller.UtilizationRegisterNumber = СведенияОПоставщике.КодПоЕДРПОУ; //Код ЄДРПОУ
	Seller.Name = СведенияОПоставщике.ПолноеНаименование; // Назва контрагента
	
	/////////////////////////////
	DeliveryPoint = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://silpo-documentinvoice_prn.com.ua","DeliveryPoint"));  // Точка доставки (початок блоку)
	DeliveryPoint.ILN =  ДанныеЗаказа.DELIVERYPLACE; //Глобальний номер розташування (GLN) точки доставки
	DeliveryPoint.Name = "";  //?  Юридична особа об’єкту доставки
	DeliveryPoint.CityName = ""; //? Місто 
	DeliveryPoint.StreetAndNumber = ""; //? Вулиця і номер будинку
	DeliveryPoint.PostalCode = ""; //?   Поштовий код

	Payer = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://silpo-documentinvoice_prn.com.ua","Payer")); // Глобальний номер розташування (GLN) платника
	Payer.ILN = Header.ILN_Buyer;//Глобальний номер розташування (GLN) платника
	Payer.Name =  СведенияОПокупателе.ПолноеНаименование; // Юридична особа платника
	Payer.CityName = ""; //?  Місто
	Payer.StreetAndNumber = ""; //? Вулиця і номер будинку
	Payer.PostalCode = "";//?  Поштовий код
	
	Invoice_Parties.Buyer.Добавить(Buyer);
	Invoice_Parties.Seller.Добавить(Seller);
	Invoice_Parties.DeliveryPoint.Добавить(DeliveryPoint);
	Invoice_Parties.Payer.Добавить(Payer);
	
	Document_Invoice.Invoice_Parties.Добавить(Invoice_Parties);
	
	Invoice_Lines= ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://silpo-documentinvoice_prn.com.ua","Invoice-Lines")); //  Таблиця (початок блоку)
	
	TotalLines = 0;   // Кількість рядків в документі
	TotalNetAmount = 0.0; // Загальна сума без ПДВ
	TotalTaxAmount = 0.0;  // Сума ПДВ
	TotalGrossAmount = 0.0;  // Загальна сума з ПДВ

	Пока Goods.Следующий() Цикл 
		
		ORDER_STRING = НайтиСтрокуЗаказа(Неопределено,Goods,ДанныеЗаказа.POSITIONS,
		Документ.Контрагент.Префикс, Документ.Контрагент.ЗначСимволы);
		
		Line = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://silpo-documentinvoice_prn.com.ua","Line"));  //  Рядок (початок блоку). У кожного наступного блоку ідентифікатор (ІД) збільшується на одиницю
		Line_Item = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://silpo-documentinvoice_prn.com.ua","Line-Item"));  // Позиція (початок блоку)
		Line_Item.LineNumber = Goods.LineNumber;   //  Номер позиції в табличній частині
		Line_Item.EAN = ORDER_STRING.PRODUCT; //Штрих-код одиниці товару (продукту)
		Line_Item.BuyerItemCode = ORDER_STRING.PRODUCTIDBUYER; //Артикул в БД покупця
		Line_Item.ExternalItemCode = СтрЗаменить(Goods.ExternalItemCode," ","");// код УКТЗЕД
		Line_Item.ItemDescription =  ORDER_STRING.DESCRIPTION;//СокрЛП(Goods.ItemDescription); //?  Найменування товарної позиції
		Line_Item.InvoiceQuantity = Goods.InvoiceQuantity; // Кількість поставлених одиниць товару
		Line_Item.BuyerUnitOfMeasure = Goods.BuyerUnitOfMeasure; //Одиниці виміру згідно Класифікатора системи позначень одиниць вимірювання та обліку (КСПОВО) (шт. – штука; уп. – упаковка; л. – літр; послуга; кг. – кілограм; г. – грам…)
		
		//Ціна
		//Необходима цена без НДС
		Если  Goods.СуммаВключаетНДС Тогда
			
			InvoiceUnitGrossPrice = Goods.Price; // Ціна однієї одиниці з ПДВ
			
			InvoiceUnitNetPrice = Ценообразование.ПересчитатьЦенуПриИзмененииФлаговНалогов(Goods.Price,   // Ціна однієї одиниці без ПДВ
			Неопределено,
			Истина,  //ЦенаВключаетНДС
			Истина,
			Ложь,
			УчетНДС.ПолучитьСтавкуНДС(Goods.TaxRate));
			
		Иначе
			
			InvoiceUnitGrossPrice  = Ценообразование.ПересчитатьЦенуПриИзмененииФлаговНалогов(Goods.Price,  // Ціна однієї одиниці з ПДВ
			Неопределено,
			Ложь, //ЦенаВключаетНДС
			Истина,
			Истина,
			УчетНДС.ПолучитьСтавкуНДС(Goods.TaxRate));
			
			InvoiceUnitNetPrice = Goods.Price;   // Ціна однієї одиниці без ПДВ

		КонецЕсли;
	
		Line_Item.InvoiceUnitGrossPrice = InvoiceUnitGrossPrice; // Ціна однієї одиниці з ПДВ
		Line_Item.InvoiceUnitNetPrice = InvoiceUnitNetPrice; // Ціна однієї одиниці без ПДВ
		Line_Item.TaxRate = УчетНДС.ПолучитьСтавкуНДС(Goods.TaxRate);  // ? Ставка ПДВ (20%, 19%, 16%, 14%, 7%, 2%, 0%) 20/19/16/14/7/2/0
		
		//Код категорії податку:
		//S - стандартний податок; можливі значення TaxRate: 20/19/16/14/7/2 (інакше помилка)
		//E - звільнений від сплати податку; можливі значення TaxRate=0 (інакше помилка)
		//Z - нульова ставка (0%); можливі значення TaxRate=0 (інакше помилка)
		Line_Item.TaxCategoryCode= "S"; //S / E / Z
		
		GrossAmount = InvoiceUnitGrossPrice * Goods.InvoiceQuantity; // Сума з ПДВ
		NetAmount = InvoiceUnitNetPrice  * Goods.InvoiceQuantity; //  Сума без ПДВ
		TaxAmount = GrossAmount - NetAmount; //Сума податку
		
		Line_Item.GrossAmount = GrossAmount; // ?   - Сума з ПДВ
		Line_Item.TaxAmount = TaxAmount; // Сума податку для кожної категорії податку - Сума ПДВ
		Line_Item.NetAmount = NetAmount;  // Оподаткована сума за обраною категорією податку TaxableAmount?  - Сума без ПДВ
		
		//Підсумки
		TotalLines = TotalLines + 1 ;   // Кількість рядків в документі
		TotalNetAmount = TotalNetAmount + Line_Item.NetAmount; // Загальна сума без ПДВ
		TotalTaxAmount = TotalTaxAmount + Line_Item.TaxAmount;  // Сума ПДВ
		TotalGrossAmount = TotalGrossAmount + Line_Item.GrossAmount;//Загальна сума з ПДВ
		
		Line.Line_Item.Добавить(Line_Item);
		
		Invoice_Lines.Line.Добавить(Line);
		
	КонецЦикла;
	
	Document_Invoice.Invoice_Lines.Добавить(Invoice_Lines);
	
	Invoice_Summary = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://silpo-documentinvoice_prn.com.ua","Invoice-Summary"));  //
	Invoice_Summary.TotalLines = TotalLines;   // Кількість рядків в документі
	Invoice_Summary.TotalNetAmount = TotalNetAmount; // Загальна сума без ПДВ
	Invoice_Summary.TotalTaxAmount = TotalTaxAmount;  // Сума ПДВ
	Invoice_Summary.TotalGrossAmount = TotalGrossAmount;  // Загальна сума з ПДВ
	
	Document_Invoice.Invoice_Summary.Добавить(Invoice_Summary);
	
	ФабрикаXDTO.ЗаписатьXML(file_XML, Document_Invoice);
	
	Возврат file_XML.Закрыть();
	
КонецФункции

//Возвращает документ «Видаткова накладна»  в xml
//
Функция vidatkova_nakladna_COMDOC_006_fileString_(Документ, АдресДоставки) Экспорт
	
	Если Не ЗначениеЗаполнено(Документ.Контрагент.GLN)
		#Если клиент  Тогда
			Тогда Сообщить("Не заполнено значение GLN клиента, выгрузка в EDIN не выполнена."); 
		#КонецЕсли
		Возврат ""
	КонецЕсли;
	
	Контрагент_GLN = ?(ЗначениеЗаполнено(Документ.EDIN_Контрагент), Документ.EDIN_Контрагент.GLN,
	Документ.Контрагент.GLN);
	
	ДанныеЗаказа = ПолучитьДанныеЗаказаПокупателя(Документ.ORDERNUMBER, Контрагент_GLN,
	Документ.Контрагент.НезначСправа);
	
	Если Не ЗначениеЗаполнено(ДанныеЗаказа) Тогда
		#Если клиент  Тогда
			Сообщить("Не найдены данные заказа в базе EDIN, выгрузка не выполнена.");
		#КонецЕсли
		Возврат ""
	КонецЕсли;
	
	ТочкаДоставки = ДанныеЗаказа.DELIVERYPLACE; //GLN
	
	//Определение базовых типов документа
	ЕлектроннийДокумент = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.comdoc_006-package.org","ЕлектроннийДокумент"));	
	Заголовок = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.comdoc_006-package.org","Заголовок"));
	ДокПідстава = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.comdoc_006-package.org","ДокПідстава"));
	Сторони = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.comdoc_006-package.org","Сторони"));
	Параметри = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.comdoc_006-package.org","Параметри"));
	Таблиця = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.comdoc_006-package.org","Таблиця"));
	ВсьогоПоДокументу = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.comdoc_006-package.org","ВсьогоПоДокументу"));
	
	СведенияОПоставщике = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Документ.Организация, Документ.Дата,,,"uk");
	СведенияОПокупателе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Документ.Контрагент, Документ.Дата,,,"uk");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Номер КАК НомерДокументу,
	|	""Видаткова накладна"" КАК ТипДокументу,
	|	""006"" КАК КодТипуДокументу,
	|	РеализацияТоваровУслуг.Дата КАК ДатаДокументу,
	|	РеализацияТоваровУслуг.ORDERNUMBER КАК НомерЗамовлення,
	|	РеализацияТоваровУслуг.ORDERDATE КАК ДатаЗамовлення,
	|	&МісцеСкладання
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Номер КАК НомерДокументу,
	|	""Договір"" КАК ТипДокументу,
	|	""001"" КАК КодТипуДокументу,
	|	ДоговорыКонтрагентов.Дата КАК ДатаДокументу
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО РеализацияТоваровУслуг.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	""Продавець"" КАК СтатусКонтрагента,
	|	""Юридична"" КАК ВидОсоби,
	|	&НазваКонтрагента_продавець КАК НазваКонтрагента,
	|	&КодКонтрагента_продавець КАК КодКонтрагента,
	|	&ІПН_продавець КАК ІПН,
	|	РеализацияТоваровУслуг.Организация.GLN КАК GLN
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Покупець"",
	|	""Юридична"",
	|	&НазваКонтрагента_покупець,
	|	&КодКонтрагента_покупець,
	|	&ІПН_покупець,
	|	РеализацияТоваровУслуг.Контрагент.GLN
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	""1"" КАК ІД,
	|	""Точка доставки"" КАК назва,
	|	&Параметр1 КАК Параметр
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""2"",
	|	""Адреса доставки"",
	|	&Параметр2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.НомерСтроки КАК ІД,
	|	Товары.НомерСтроки КАК НомПоз,
	|	Товары.ШтрихкодКлиентаСпец КАК Штрихкод,
	|	Товары.umk_КодКлиента КАК АртикулПокупця,
	|	Товары.Номенклатура.НаименованиеПолное КАК Найменування,
	|	Товары.Количество КАК ПрийнятаКількість,
	|	Товары.ЕдиницаИзмерения.Наименование КАК ОдиницяВиміру,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА Товары.Ссылка.СуммаВключаетНДС
	|				ТОГДА Товары.Цена / (1 + СтавкиНДС.СтавкаНДС)
	|			ИНАЧЕ Товары.Цена
	|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК БазоваЦіна,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА Товары.Ссылка.СуммаВключаетНДС
	|				ТОГДА Товары.Цена - Товары.Цена / (1 + СтавкиНДС.СтавкаНДС)
	|			ИНАЧЕ Товары.Цена * СтавкиНДС.СтавкаНДС
	|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК ПДВ,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА Товары.Ссылка.СуммаВключаетНДС
	|				ТОГДА Товары.Цена
	|			ИНАЧЕ Товары.Цена * (1 + СтавкиНДС.СтавкаНДС)
	|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК Ціна,
	|	ВЫРАЗИТЬ(Товары.Количество * (ВЫРАЗИТЬ(ВЫБОР
	|				КОГДА Товары.Ссылка.СуммаВключаетНДС
	|					ТОГДА Товары.Цена / (1 + СтавкиНДС.СтавкаНДС)
	|				ИНАЧЕ Товары.Цена
	|			КОНЕЦ КАК ЧИСЛО(15, 2))) КАК ЧИСЛО(15, 2)) КАК СумаБезПДВ,
	|	ВЫРАЗИТЬ(Товары.Количество * (ВЫРАЗИТЬ(ВЫБОР
	|				КОГДА Товары.Ссылка.СуммаВключаетНДС
	|					ТОГДА Товары.Цена - Товары.Цена / (1 + СтавкиНДС.СтавкаНДС)
	|				ИНАЧЕ Товары.Цена * СтавкиНДС.СтавкаНДС
	|			КОНЕЦ КАК ЧИСЛО(15, 2))) КАК ЧИСЛО(15, 2)) КАК СумаПДВ,
	|	ВЫРАЗИТЬ(Товары.Количество * (ВЫРАЗИТЬ(ВЫБОР
	|				КОГДА Товары.Ссылка.СуммаВключаетНДС
	|					ТОГДА Товары.Цена
	|				ИНАЧЕ Товары.Цена * (1 + СтавкиНДС.СтавкаНДС)
	|			КОНЕЦ КАК ЧИСЛО(15, 2))) КАК ЧИСЛО(15, 2)) КАК Сума,
	|	СтавкиНДС.СтавкаНДС * 100 КАК СтавкаПДВ,
	|	Товары.umk_УпаковкаНаПечать КАК УпаковкаНаПечать
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			Товары.НомерСтроки КАК НомерСтроки,
	|			ВЫБОР
	|				КОГДА Товары.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
	|					ТОГДА 0.2
	|				КОГДА Товары.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС14)
	|					ТОГДА 0.14
	|				КОГДА Товары.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7)
	|					ТОГДА 0.07
	|				ИНАЧЕ 0
	|			КОНЕЦ КАК СтавкаНДС
	|		ИЗ
	|			Документ.РеализацияТоваровУслуг.Товары КАК Товары
	|		ГДЕ
	|			Товары.Ссылка = &Ссылка) КАК СтавкиНДС
	|		ПО Товары.НомерСтроки = СтавкиНДС.НомерСтроки
	|ГДЕ
	|	Товары.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("КодКонтрагента_покупець", СведенияОПокупателе.КодПоЕДРПОУ);
	Запрос.УстановитьПараметр("КодКонтрагента_продавець", СведенияОПоставщике.КодПоЕДРПОУ);
	Запрос.УстановитьПараметр("МісцеСкладання", СведенияОПоставщике.ЮридическийАдрес);
	Запрос.УстановитьПараметр("НазваКонтрагента_покупець", СведенияОПокупателе.ПолноеНаименование);
	Запрос.УстановитьПараметр("НазваКонтрагента_продавець", СведенияОПоставщике.ПолноеНаименование);
	Запрос.УстановитьПараметр("Параметр1", ТочкаДоставки); //з замовлення
	Запрос.УстановитьПараметр("Параметр2", АдресДоставки); 
	Запрос.УстановитьПараметр("Ссылка", Документ);
	Запрос.УстановитьПараметр("ІПН_покупець", СведенияОПокупателе.ИНН);
	Запрос.УстановитьПараметр("ІПН_продавець", СведенияОПоставщике.ИНН);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ЗаголовокВыборка =РезультатЗапроса[0].Выбрать(); 
	ДокПідставаВыборка = РезультатЗапроса[1].Выбрать();
	КонтрагентВыборка = РезультатЗапроса[2].Выбрать();
	ПараметриВыборка = РезультатЗапроса[3].Выбрать();
	ТаблицяВыборка = РезультатЗапроса[4].Выбрать();
	Таблица = РезультатЗапроса[4].Выгрузить();
	
	//Заполняем xml
	ЗаголовокВыборка.Следующий();
	ЗаполнитьЗначенияСвойств(Заголовок, ЗаголовокВыборка);
	Заголовок.НомерДокументу =  ОбщегоНазначения.ПолучитьНомерНаПечать(Документ);
	
	ДокПідставаВыборка.Следующий();
	ЗаполнитьЗначенияСвойств(ДокПідстава, ДокПідставаВыборка);
	
	Заголовок.ДокПідстава = ДокПідстава;
	ЕлектроннийДокумент.Заголовок = Заголовок;
	
	Пока КонтрагентВыборка.Следующий() Цикл
		Контрагент= ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.comdoc_006-package.org","Контрагент"));
		ЗаполнитьЗначенияСвойств(Контрагент, КонтрагентВыборка);
		Сторони.Контрагент.Добавить(Контрагент);
	КонецЦикла;
	
	ЕлектроннийДокумент.Сторони = Сторони;
	
	Пока ПараметриВыборка.Следующий() Цикл
		Параметр = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.comdoc_006-package.org","Параметр"));
		ЗаполнитьЗначенияСвойств(Параметр, ПараметриВыборка,"ІД, назва");
		Параметр.Значение = Строка(ПараметриВыборка.Параметр); // текст між тегами
		Параметри.Параметр.Добавить(Параметр);
	КонецЦикла;
	
	ЕлектроннийДокумент.Параметри = Параметри;
	
	Пока ТаблицяВыборка.Следующий() Цикл
		
		Рядок = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.comdoc_006-package.org","Рядок"));
		Штрихкод = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.comdoc_006-package.org","Штрихкод"));
        ВсьогоПоРядку = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.comdoc_006-package.org","ВсьогоПоРядку"));

		ЗаполнитьЗначенияСвойств(Рядок, ТаблицяВыборка,,"Штрихкод");
		Рядок.Найменування = СокрЛП(Рядок.Найменування) + ?(ЗначениеЗаполнено(ТаблицяВыборка.УпаковкаНаПечать),
		" " + СокрЛП(ТаблицяВыборка.УпаковкаНаПечать),""); //Найменування з упак.
		
		ЗаполнитьЗначенияСвойств(ВсьогоПоРядку, ТаблицяВыборка,"СумаБезПДВ,СумаПДВ,Сума");
		
		Штрихкод.ІД = "1";
		Штрихкод.Значение = ТаблицяВыборка.Штрихкод;
		Рядок.Штрихкод = Штрихкод;
		
		Рядок.ВсьогоПоРядку = ВсьогоПоРядку;
		Таблиця.Рядок.Добавить(Рядок);
		
	КонецЦикла;
	
	ЕлектроннийДокумент.Таблиця = Таблиця;
	
	ВсьогоПоДокументу.СумаБезПДВ = Таблица.Итог("СумаБезПДВ");
	ВсьогоПоДокументу.ПДВ = Таблица.Итог("СумаПДВ");
	ВсьогоПоДокументу.Сума = Таблица.Итог("Сума");
	
	ЕлектроннийДокумент.ВсьогоПоДокументу = ВсьогоПоДокументу;
	
	//Запишем результат в xml
	file_XML  = Новый ЗаписьXML();
    file_XML.УстановитьСтроку("UTF-8");
	file_XML.ЗаписатьОбъявлениеXML();
		
	ФабрикаXDTO.ЗаписатьXML(file_XML, ЕлектроннийДокумент);
	
	ТекстXML = file_XML.Закрыть();
	
	// убираем namespace
	ТекстXML = СтрЗаменить(ТекстXML, 
	" xmlns=""http://www.comdoc_006-package.org""", "");
	ТекстXML = СтрЗаменить(ТекстXML, 
	" xmlns:xs=""http://www.w3.org/2001/XMLSchema""", "");
	ТекстXML = СтрЗаменить(ТекстXML, 
	" xmlns:xsi=""http://www.w3.org/2001/XMLSchema-instance""", "");
	
	Возврат ТекстXML;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//Возвращает структуру данных документа заказ покупателя.
Функция ПолучитьДанныеЗаказаПокупателя(ORDERNUMBER, GLN_client, insign_char) Экспорт
	
	// Находим doc_uuid документа по номеру заказа
	doc_uuid = GUID_ДокументаПоНомеру(ORDERNUMBER, GLN_client ,2); //2-orders
	
	Если Не ЗначениеЗаполнено(doc_uuid)
		Тогда
		#Если клиент  Тогда
			Сообщить("Не найден заказ по номеру в базе EDIN.");
		#КонецЕсли
		Возврат Неопределено
	КонецЕсли;
	
	//получаем данне xml_документа
	ДанныеДокумента = ДанныеДокументаПо_doc_uuid(doc_uuid);
	
	Если Не ЗначениеЗаполнено(ДанныеДокумента)
		Тогда
		#Если клиент  Тогда
			Сообщить("Не найден заказ по номеру uuid в базе EDIN.");
		#КонецЕсли
		Возврат Неопределено
	КонецЕсли;
	
	//Прочитаем данные документа.
	СтрокаXML = ДанныеДокумента; 
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(СтрокаXML);
	
	РезультатРазборки = Новый Массив();
	
	ЧтениеXMLСхемы = Новый ЧтениеXML;
	СтрокаXSD = "<xs:schema attributeFormDefault=""unqualified"" elementFormDefault=""qualified"" xmlns:xs=""http://www.w3.org/2001/XMLSchema"">
	|  <xs:element name=""ORDER"">
	|    <xs:complexType>
	|      <xs:sequence>
	|        <xs:element type=""xs:short"" name=""DOCUMENTNAME""/>
	|        <xs:element type=""xs:string"" name=""NUMBER""/>
	|        <xs:element type=""xs:date"" name=""DATE""/>
	|        <xs:element type=""xs:date"" name=""DELIVERYDATE""/>
	|        <xs:element type=""xs:string"" name=""DELIVERYTIME""/>
	|        <xs:element type=""xs:string"" name=""CURRENCY""/>
	|        <xs:element type=""xs:byte"" name=""VAT""/>
	|        <xs:element name=""HEAD"">
	|          <xs:complexType>
	|            <xs:sequence>
	|              <xs:element type=""xs:long"" name=""SUPPLIER""/>
	|              <xs:element type=""xs:long"" name=""BUYER""/>
	|              <xs:element type=""xs:long"" name=""DELIVERYPLACE""/>
	|              <xs:element type=""xs:long"" name=""FINALRECIPIENT""/>
	|              <xs:element type=""xs:long"" name=""INVOICEPARTNER""/>
	|              <xs:element type=""xs:long"" name=""SENDER""/>
	|              <xs:element type=""xs:long"" name=""RECIPIENT""/>
	|              <xs:element type=""xs:string"" name=""EDIINTERCHANGEID""/>
	|              <xs:element name=""POSITION"" maxOccurs=""unbounded"" minOccurs=""0"">
	|                <xs:complexType>
	|                  <xs:sequence>
	|                    <xs:element type=""xs:byte"" name=""POSITIONNUMBER""/>
	|                    <xs:element type=""xs:long"" name=""PRODUCT""/>
	|                    <xs:element type=""xs:int"" name=""PRODUCTIDBUYER""/>
	|                    <xs:element type=""xs:float"" name=""ORDEREDQUANTITY""/>
	|                    <xs:element type=""xs:string"" name=""ORDERUNIT""/>
	|                    <xs:element type=""xs:float"" name=""ORDERPRICE""/>
	|                    <xs:element type=""xs:float"" name=""PRICEWITHVAT""/>
	|                    <xs:element type=""xs:string"" name=""ORDERPRICEUNIT""/>
	|                    <xs:element type=""xs:float"" name=""VAT""/>
	|                    <xs:element name=""CHARACTERISTIC"">
	|                      <xs:complexType>
	|                        <xs:sequence>
	|                          <xs:element type=""xs:string"" name=""DESCRIPTION""/>
	|                        </xs:sequence>
	|                      </xs:complexType>
	|                    </xs:element>
	|                  </xs:sequence>
	|                </xs:complexType>
	|              </xs:element>
	|            </xs:sequence>
	|          </xs:complexType>
	|        </xs:element>
	|        <xs:element type=""xs:byte"" name=""EXCHANGE_SCHEMA_TYPE""/>
	|      </xs:sequence>
	|    </xs:complexType>
	|  </xs:element>
	|</xs:schema>";
	
	ЧтениеXMLСхемы.УстановитьСтроку(СтрокаXSD);
	ПостроительDOM = New ПостроительDOM;
	ДокументDOM = ПостроительDOM.Прочитать(ЧтениеXMLСхемы);
	ПостроительСхемXML = New ПостроительСхемXML;
	СхемаXML = ПостроительСхемXML.СоздатьСхемуXML(ДокументDOM);
	НаборСхемXML = Новый НаборСхемXML;
	НаборСхемXML.Добавить(СхемаXML);
	
	СвояФабрикаXDTO = New ФабрикаXDTO(НаборСхемXML);
	
	ПакетXDTO = СвояФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	
	//Подготовим таблицу заказанных товаров
	ТаблицаТоваров = Новый ТаблицаЗначений;
	ТаблицаТоваров.Колонки.Добавить("PRODUCT");
	ТаблицаТоваров.Колонки.Добавить("PRODUCT_ORDER");
	ТаблицаТоваров.Колонки.Добавить("ORDEREDQUANTITY");
	ТаблицаТоваров.Колонки.Добавить("PRODUCTIDBUYER");
	ТаблицаТоваров.Колонки.Добавить("ORDERUNIT");
	ТаблицаТоваров.Колонки.Добавить("ORDERPRICE");
	ТаблицаТоваров.Колонки.Добавить("PRICEWITHVAT");
	ТаблицаТоваров.Колонки.Добавить("DESCRIPTION");
		
	Если ТипЗнч(ПакетXDTO.HEAD.POSITION) = Тип("ОбъектXDTO") Тогда
		
		XDTO_String = ПакетXDTO.HEAD.POSITION;
		
		ДобавитьСтрокуВТЗТовары(XDTO_String, ТаблицаТоваров, insign_char);
		
	Иначе
		
		Для Каждого XDTO_String Из ПакетXDTO.HEAD.POSITION Цикл
			
			ДобавитьСтрокуВТЗТовары(XDTO_String, ТаблицаТоваров, insign_char);
			
		КонецЦикла;
		
	КонецЕсли;
	
	СтруктураДанных = Новый Структура("DELIVERYPLACE, POSITIONS, DELIVERYTIME"); 
	СтруктураДанных.DELIVERYPLACE = ПакетXDTO.HEAD.DELIVERYPLACE;
	
	Если Не ПакетXDTO.Свойства().Получить("DELIVERYTIME") = Неопределено Тогда
		СтруктураДанных.DELIVERYTIME  = ПакетXDTO.DELIVERYTIME;
	Иначе
		СтруктураДанных.DELIVERYTIME  = "";
	КонецЕсли;
	
	СтруктураДанных.POSITIONS = ТаблицаТоваров;
	
	Возврат СтруктураДанных
	
КонецФункции

//Добавляет строку в XDTO_заказ покупателя 
Процедура ДобавитьСтрокуВТЗТовары(XDTO_String, ТаблицаТоваров, insign_char)
	
	НоваяСтрока = ТаблицаТоваров.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, XDTO_String);
	//Уберем лишние символы шк. заказа покупателя.
	PRODUCT = Формат(XDTO_String.PRODUCT,"ЧЦ=14; ЧГ=");
	PRODUCT = Лев(PRODUCT,СтрДлина(PRODUCT) - insign_char);
	
	НоваяСтрока.PRODUCT = PRODUCT;
	НоваяСтрока.PRODUCT_ORDER = XDTO_String.PRODUCT;
	НоваяСтрока.DESCRIPTION = XDTO_String.CHARACTERISTIC.DESCRIPTION;
	
КонецПроцедуры

//Возвращает guid по номеру документа
Функция GUID_ДокументаПоНомеру(ORDERNUMBER, GLN_client, XDocType)
	
	doc_uuid = "";
	
	file_string = 
	"{
	|""direction"": {
	|    ""sender"": [" + GLN_client + "],
	|    ""receiver"": [],
	|    ""type"": ""EQ""
	|},
	|""exchangeStatus"": [],
	|""family"": ""1"",
	|""statuses"": [""2"",""3"",""4"",""5"",""6"",""7""],
	|""number"":" + ORDERNUMBER + ",
	|""type"": [
	|    {
	|        ""type"": """ + XDocType + """
	|    }
	|]
	|}";
	
	Заголовки = Новый Соответствие();
	Заголовки.Вставить("Content-Type", "application/json");
	result = EDIN_connect.api_request("/api/eds/docs/search?gln=" + Константы.umk_ГоловнаяОрганизация.Получить().GLN, Заголовки, file_string);
	
	string_response = result.ПолучитьТелоКакСтроку();
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(result.ПолучитьТелоКакСтроку());
	
	Попытка
		data = ПрочитатьJSON(ЧтениеJSON, Ложь);
		items = data.items;
		doc_uuid = data.items[0].doc_uuid;
	Исключение
		doc_uuid = ""
	КонецПопытки;
	
	Возврат doc_uuid;
	
КонецФункции

//Возвращает структуру xml документа по doc_uuid 
//ДанныеДокумента по doc_uuid
Функция ДанныеДокументаПо_doc_uuid(doc_uuid)
	
	Заголовки = Новый Соответствие();
	Заголовки.Вставить("Content-Type", "application/json");
	resul = EDIN_connect.api_request("api/eds/doc/xml?gln="+
	Константы.umk_ГоловнаяОрганизация.Получить().GLN+"&doc_uuid="+doc_uuid);
	doc_string = resul.ПолучитьТелоКакСтроку();
	
	Возврат doc_string
	
КонецФункции

//Представление номенклатуры
Функция ПредставлениеНоменклатуры(Номенклатура, Характеристика = Неопределено, Дата)
	
	Возврат СокрП("" + Номенклатура)	+ ?(НЕ ЗначениеЗаполнено(Характеристика), "", // Если не заполнено 
	?(ЗначениеЗаполнено(umk_Доработки.ПолучитьХарактеристикуДляПечати(Характеристика,Дата)),
	umk_Доработки.ПолучитьХарактеристикуДляПечати(Характеристика,Дата), // Есть запись в РС Характеристика на печать
	"(" + Характеристика +")")); // Нет записи в РС То берем характеристику
		
КонецФункции

//Возвращает структуру строки заказа покупателя по штрихкоду.
//Данные необходимые для заполнения уведомления об отгрузке  
Функция НайтиСтрокуЗаказа(PRODUCT, ВыборкаТовары, POSITIONS, prefix, sign_char)  Экспорт
	
	СтрокаЗаказа = Новый Структура("PRODUCT,ORDEREDQUANTITY,PRODUCTIDBUYER,ORDERUNIT,ORDERPRICE, PRICEWITHVAT, DESCRIPTION");
	//Полагаем, что строка уникальна.
	
	PRODUCT_string = "";
	
	Если ЗначениеЗаполнено(PRODUCT) Тогда //Приведем код к формату клиента без незнач. символов справа
		ДлинаПрефикса = СтрДлина(prefix);
		
		//штрихкод без префикса
		PRODUCT_string = Прав(PRODUCT, СтрДлина(PRODUCT)-ДлинаПрефикса);
		
		Попытка
			PRODUCT_string = prefix +Формат(Число(PRODUCT_string),"ЧЦ="+Строка(sign_char)+"; ЧВН=; ЧГ=");;
		Исключение
			PRODUCT_string = "";
		КонецПопытки;
		
	КонецЕсли;
	
	ПарамПоиска = Новый Структура("PRODUCT",PRODUCT_string);
	
	//Найдем по значению "PRODUCT" 
	СтрокиПоиска = НайтиСтрокуПоПарамтруПоиска("PRODUCT", PRODUCT_string, POSITIONS);
	
	Если СтрокиПоиска.Количество() = 0 Тогда
		//Найдем по значению "PRODUCT_ORDER" 
		СтрокиПоиска = НайтиСтрокуПоПарамтруПоиска("PRODUCT_ORDER", ВыборкаТовары.EDIN_штрихкод, POSITIONS);
	КонецЕсли;
	
	Если СтрокиПоиска.Количество() = 0 Тогда
		//Найдем по значению "PRODUCTIDBUYER" 
		СтрокиПоиска = НайтиСтрокуПоПарамтруПоиска("PRODUCTIDBUYER", ВыборкаТовары.EDIN_артикулПокупателя, POSITIONS);
	КонецЕсли;
	
	Если СтрокиПоиска.Количество() = 0 Тогда
		СтрокаЗаказа.PRODUCT = "";
		СтрокаЗаказа.ORDEREDQUANTITY = 0.0;
		СтрокаЗаказа.PRODUCTIDBUYER = "";
		СтрокаЗаказа.ORDERPRICE = 0.0;
		СтрокаЗаказа.ORDERUNIT = "";
		#Если Клиент Тогда
			Сообщить("В заказе покупателя не найдена позиция со штрихкодом " + PRODUCT);
		#КонецЕсли
	Иначе
		СтрокаЗаказа.ORDERPRICE = 0;
		ЗаполнитьЗначенияСвойств(СтрокаЗаказа, СтрокиПоиска[0]);
		СтрокаЗаказа.PRODUCT =  СтрокиПоиска[0].PRODUCT_ORDER;  
	КонецЕсли;
	
	Возврат СтрокаЗаказа
	
КонецФункции

//Вылолняет поск по табл. заказа EDI в зависимости от параметров
//поиска
Функция НайтиСтрокуПоПарамтруПоиска(ПараметрПоиска, ЗначениеПоиска, POSITIONS)
	
	ПарамПоиска = Новый Структура(ПараметрПоиска, ЗначениеПоиска);
	
	Возврат POSITIONS.НайтиСтроки(ПарамПоиска);
	
КонецФункции

//Выполняет отправку потокового файла на сервер EDIN
//
Функция ВыполнитьОтправкуДокумета(ТипДокумента, файл_xml_Строкой) Экспорт
	
	ОтправкаВыполнена = Ложь;
	
	Заголовки = Новый Соответствие();
	Заголовки.Вставить("Content-Type", "application/xml");
	Результат = EDIN_connect.api_request("/api/v2/eds/doc?gln=" 
	+ Константы.umk_ГоловнаяОрганизация.Получить().GLN+"&doc_type="+ТипДокумента, Заголовки, файл_xml_Строкой);

	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Результат.ПолучитьТелоКакСтроку());
	
	Попытка
		Ответ = ПрочитатьJSON(ЧтениеJSON, Ложь);
		Если ЗначениеЗаполнено(Ответ.doc_uuid) Тогда
			ОтправкаВыполнена = Истина;
			Сообщить("Документ вивантажено в чернетки EDIN.");
		КонецЕсли;
	Исключение
		Сообщить("Вивантаження не вдалося!",СтатусСообщения.Важное);
	КонецПопытки;
	
	Возврат ОтправкаВыполнена
	
КонецФункции

#КонецОбласти



