#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

	
#Область СлужебныйПрограммныйИнтерфейс

//Создает комплектации на основании входящих данных
//ДанныеНоменклатуры - Структура:
//ДокументСписания, Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, Коэффициент, СчетУчетаБУ, Количество, Склад, Дата
Функция РазукомплектоватьТоварныеПозиции(ДанныеНоменклатуры) Экспорт
	
	МассивКомплектов = Новый Массив; //Хранит данные о разукомплектации номенклатуры. 
	
	ТаблицаНоменклатуры = Новый ТаблицаЗначений();
	ТаблицаНоменклатуры.Колонки.Добавить("ДокументСписания",  Новый ОписаниеТипов("ДокументСсылка.СписаниеТоваров"));
	ТаблицаНоменклатуры.Колонки.Добавить("ВозвратТовара",  Новый ОписаниеТипов("ДокументСсылка.ВозвратТоваровОтПокупателя"));
	ТаблицаНоменклатуры.Колонки.Добавить("Склад",  Новый ОписаниеТипов("СправочникСсылка.Склады"));
	ТаблицаНоменклатуры.Колонки.Добавить("Дата",  Новый ОписаниеТипов("Дата"));
	ТаблицаНоменклатуры.Колонки.Добавить("Номенклатура",  Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаНоменклатуры.Колонки.Добавить("Количество",  Новый ОписаниеТипов("Число"));
	ТаблицаНоменклатуры.Колонки.Добавить("ЕдиницаИзмерения", Новый ОписаниеТипов("СправочникСсылка.ЕдиницыИзмерения"));
	ТаблицаНоменклатуры.Колонки.Добавить("Коэффициент",  Новый ОписаниеТипов("Число"));
	ТаблицаНоменклатуры.Колонки.Добавить("ХарактеристикаНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаНоменклатуры.Колонки.Добавить("СчетУчетаБУ", Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
	
	Для Каждого СтруктураДанных Из ДанныеНоменклатуры Цикл
		НоваяСтрока = ТаблицаНоменклатуры.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураДанных);
	КонецЦикла;
	
	ТаблицаДокументов = ТаблицаНоменклатуры.Скопировать();
	ТаблицаДокументов.Свернуть("ДокументСписания");
	
	НачатьТранзакцию();
	
	Для Каждого СтрокаТаблицы Из ТаблицаДокументов Цикл
		
		Попытка
			ДокументСписания = СтрокаТаблицы.ДокументСписания.ПолучитьОбъект();
			ДокументСписания.Заблокировать();
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение (Нстр(СтрЗаменить("ru = 'Операция создания документов не удалась. Не удалась блокировка документа %1 '; 
			|uk = 'Операция создания документов не удалась. Не вдалося блокувати документ %1'","%1", Строка(СтрокаТаблицы.ДокументСписания))));
		КонецПопытки;
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ТаблицаНоменклатуры.ДокументСписания,
		|	ТаблицаНоменклатуры.ВозвратТовара,
		|	ТаблицаНоменклатуры.Номенклатура,
		|	ТаблицаНоменклатуры.Количество,
		|	ТаблицаНоменклатуры.ЕдиницаИзмерения,
		|	ТаблицаНоменклатуры.Коэффициент,
		|	ТаблицаНоменклатуры.ХарактеристикаНоменклатуры,
		|	ТаблицаНоменклатуры.СчетУчетаБУ,
		|	ТаблицаНоменклатуры.Склад,
		|	ТаблицаНоменклатуры.Дата
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	&ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.ДокументСписания,
		|	ВТ.ВозвратТовара,
		|	ВТ.Номенклатура,
		|	ВТ.Количество,
		|	ВТ.ЕдиницаИзмерения,
		|	ВТ.Коэффициент,
		|	ВТ.ХарактеристикаНоменклатуры,
		|	ВТ.СчетУчетаБУ,
		|	ВТ.Склад,
		|	ВТ.Дата,
		|	Подразделения.Ссылка КАК Подразделение
		|ИЗ
		|	ВТ КАК ВТ,
		|	Справочник.Подразделения КАК Подразделения
		|ГДЕ
		|	ВТ.ДокументСписания = &ДокументСписания
		|	И Подразделения.Код = ""000000001""
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ.ДокументСписания,
		|	ВТ.ВозвратТовара,
		|	ВТ.Номенклатура,
		|	ВТ.Количество,
		|	ВТ.ЕдиницаИзмерения,
		|	ВТ.Коэффициент,
		|	ВТ.ХарактеристикаНоменклатуры,
		|	ВТ.СчетУчетаБУ,
		|	ВТ.Склад,
		|	ВТ.Дата,
		|	Подразделения.Ссылка");
		
		Запрос.УстановитьПараметр("ДокументСписания", СтрокаТаблицы.ДокументСписания);
		Запрос.УстановитьПараметр("ТаблицаНоменклатуры", ТаблицаНоменклатуры);
	
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			//Создаем документ разукомплектация 
			Комплектация = Документы.КомплектацияНоменклатуры.СоздатьДокумент();
			// Заполнить реквизиты значениями по умолчанию.
			ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(Комплектация, глЗначениеПеременной("глТекущийПользователь"),,,,);
			ОбщегоНазначения.ЗаполнитьОбязательныеРеквизитыШапкиНовогоДокумента(Комплектация, глЗначениеПеременной("глТекущийПользователь"));
			
			Комплектация.ВидОперации = Перечисления.ВидыОперацийКомплектацияНоменклатуры.Разукомплектация;
			ЗаполнитьЗначенияСвойств(Комплектация,Выборка);
			 
			//Строки ТЧ 
			НоваяСтрока = Комплектация.Комплектующие.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка,,"ХарактеристикаНоменклатуры");
			НоваяСтрока.ДоляСтоимости = 1;
			Комплектация.ЗаполнитьСчетаУчетаВСтрокеТабЧасти(НоваяСтрока, "КомплектацияНоменклатуры" , Истина, Истина);
			Комплектация.НалоговоеНазначение = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Облагаемая;
			Комплектация.Комментарий = "##СозданИз_ОбработкаСписанныхТоваров##";

			//Запись
			Попытка
				Комплектация.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				ОтменитьТранзакцию();
				ВызватьИсключение (Нстр("ru = 'Операция создания документов не удалась'; uk = 'Операция создания документов не удалась'"));
			КонецПопытки;
			
			//Удаляем строки из списания
			Товары = ДокументСписания.Товары;
			ПарамПоиска = Новый Структура("Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, Коэффициент, Количество");
			ЗаполнитьЗначенияСвойств(ПарамПоиска, Выборка);
			
			Строки = Товары.НайтиСтроки(ПарамПоиска);
			
			Если Не Строки.Количество() = 0 Тогда
				Товары.Удалить(Строки[0]);
			КонецЕсли;
			
			
			ДанныеРазукомплектации = Новый Структура("Комплектация, ДокументСписания, Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, Коэффициент, Количество");
			ЗаполнитьЗначенияСвойств(ДанныеРазукомплектации, Выборка);
			ДанныеРазукомплектации.Комплектация = Комплектация.Ссылка;
			МассивКомплектов.Добавить(ДанныеРазукомплектации);
			
			//Записшем в регистр зависимых документов
			Запись = РегистрыСведений.ДокументыВозвратТоваров.СоздатьМенеджерЗаписи();
			Запись.ВозвратТовара = Выборка.ВозвратТовара;
			Запись.ЗависимыйДокумент = Комплектация.Ссылка;
			Запись.Записать(Истина);

		КонецЦикла;
		
		//Запись
		Попытка
			ДокументСписания.Комментарий = ДокументСписания.Комментарий + "##Изменен_Из_ОбработкаСписанныхТоваров## - " + Строка(ТекущаяДата());
			Если ДокументСписания.Товары.Количество() = 0 Тогда
				ДокументСписания.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				ДокументСписания.УстановитьПометкуУдаления(Истина);
			Иначе
				ДокументСписания.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение (Нстр("ru = 'Операция создания документов не удалась'; uk = 'Операция создания документов не удалась'"));
		КонецПопытки;
				
	КонецЦикла;  // По документам 
	
	//Документ Реализация товаров.
	Если Не МассивКомплектов.Количество() = 0 Тогда
		РеализацияТоваров = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		РеализацияТоваров.Дата = ТекущаяДата();
		// Заполнить реквизиты значениями по умолчанию.
		ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(РеализацияТоваров, глЗначениеПеременной("глТекущийПользователь"),,,,);
		ОбщегоНазначения.ЗаполнитьОбязательныеРеквизитыШапкиНовогоДокумента(РеализацияТоваров, глЗначениеПеременной("глТекущийПользователь"));
		
		Товары = РеализацияТоваров.Товары;
		Для Каждого СтруктураДанных Из МассивКомплектов Цикл
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураДанных,,"ХарактеристикаНоменклатуры");
			НоваяСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС20;
		КонецЦикла;
		РеализацияТоваров.Комментарий = "##СозданИз_ОбработкаСписанныхТоваров##"; 
		Попытка
			РеализацияТоваров.Записать(РежимЗаписиДокумента.Запись);
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение (Нстр("ru = 'Операция создания документов не удалась. Не удалось создать Реализацию товаров'; uk = 'Операция создания документов не удалась. Не вдалося створити Реалізацію товарів'"));
		КонецПопытки;		
	КонецЕсли;
	
	ЗафиксироватьТранзакцию();
	
	
	Возврат Новый Структура ("РеализацияТоваров, МассивКомплектов", РеализацияТоваров, МассивКомплектов);
	
КонецФункции

#КонецОбласти

#КонецЕсли
