
Процедура ПечатьНакладной(ТабДокумент, МассивСсылокНаОбъект) Экспорт
	
	ПервыйДокумент = Ложь;
	ДопКолонка = Константы.ДополнительнаяКолонкаПечатныхФормДокументов.Получить();
		
	Для Каждого СсылкаНаОбъект Из МассивСсылокНаОбъект Цикл 
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		//доп колонка для кода клиента
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	РеализацияТоваровУслугТовары.umk_КодКлиента
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|ГДЕ
		|	РеализацияТоваровУслугТовары.umk_КодКлиента <> """"
		|	И РеализацияТоваровУслугТовары.Ссылка = &ДокументСсылка");
		
		Запрос.УстановитьПараметр("ДокументСсылка", СсылкаНаОбъект);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Если  Выборка.Следующий() Тогда
			ВыводитьКоды    = Истина;
			Колонка         = "Артикул";
			ТекстКодАртикул = "umk_КодКлиента";	
			ТекстКодАртикулВозвратТара = "Код";
			ТекстКодАртикулУслуги = "Код";
		Иначе
			ВыводитьКоды    = Ложь;
			Колонка         = "";
			ТекстКодАртикул = "Номенклатура.Код";
			ТекстКодАртикулВозвратТара = "Код";
			ТекстКодАртикулУслуги = "Код";
		КонецЕсли;
		
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТекущийДокумент", СсылкаНаОбъект);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Номер,
		|	РеализацияТоваровУслуг.Дата,
		|	РеализацияТоваровУслуг.ДоговорКонтрагента,
		|	РеализацияТоваровУслуг.ДоговорКонтрагента.ВидДоговора КАК ВидДоговораКонтрагента,
		|	РеализацияТоваровУслуг.ДоговорКонтрагента.ВедениеВзаиморасчетов КАК ДоговорВедениеВзаиморасчетов,
		|	РеализацияТоваровУслуг.ДоговорКонтрагента.НаименованиеДляПечати КАК ДоговорНаименованиеДляПечати,
		|	РеализацияТоваровУслуг.ДоговорКонтрагента.ВыводитьИнформациюОСделкеПриПечатиДокументов КАК ПечататьСделку,
		|	РеализацияТоваровУслуг.Сделка,
		|	РеализацияТоваровУслуг.Контрагент КАК Покупатель,
		|	РеализацияТоваровУслуг.Организация,
		|	РеализацияТоваровУслуг.Организация КАК Поставщик,
		|	РеализацияТоваровУслуг.ПредставительОрганизации КАК ПредставительПоставщика,
		|	ВЫРАЗИТЬ(РеализацияТоваровУслуг.МестоСоставленияДокумента КАК СТРОКА(1000)) КАК МестоСоставленияДокумента,
		|	РеализацияТоваровУслуг.ДоверенностьСерия,
		|	РеализацияТоваровУслуг.ДоверенностьНомер,
		|	РеализацияТоваровУслуг.ДоверенностьДата,
		|	РеализацияТоваровУслуг.Получил,
		|	РеализацияТоваровУслуг.ПолучилПоДругомуДокументу,
		|	РеализацияТоваровУслуг.ДокументПодтверждающийПолномочия,
		|	РеализацияТоваровУслуг.СуммаДокумента,
		|	РеализацияТоваровУслуг.ВалютаДокумента,
		|	РеализацияТоваровУслуг.УчитыватьНДС,
		|	РеализацияТоваровУслуг.СуммаВключаетНДС,
		|	РеализацияТоваровУслуг.umk_Регион КАК АдресДоставки,
		|	РеализацияТоваровУслуг.umk_НомерЗаказаФ2 КАК НомерЗаказа,
		|	РеализацияТоваровУслуг.umk_ДатаЗаказаФ2 КАК ДатаЗаказа,
		|	РеализацияТоваровУслуг.umk_ДатаДоставкиФ2 КАК ДатаДоставки,
		|	РеализацияТоваровУслуг.АдресДоставки КАК АдресДоставкиУТП
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Ссылка = &ТекущийДокумент";
		Шапка = Запрос.Выполнить().Выбрать();
		Шапка.Следующий();
		
		
		СтрокаВыборкиПоляСодержания = ОбработкаТабличныхЧастей.ПолучитьЧастьЗапросаДляВыбораСодержания("РеализацияТоваровУслуг");
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТекущийДокумент", СсылкаНаОбъект);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	НомерТЧ,
		|	НомерСтрокиТЧ,
		|	Номенклатура,
		|	ВЫРАЗИТЬ(Номенклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК Товар,
		|	Номенклатура.Код     КАК Код,
		|	"+ ТекстКодАртикул + " КАК КодАртикул,
		|	Количество,
		|	КоличествоМест,
		|	ЕдиницаИзмерения.Представление КАК ЕдиницаЦены,
		|	ЕдиницаИзмеренияМест.Представление КАК ЕдиницаМест,
		|	Цена,
		|	Сумма,
		|	СуммаНДС,
		|	ПроцентСкидкиНаценки КАК Скидка,
		|	ПроцентАвтоматическихСкидок КАК АвтоматическаяСкидка,
		// + umk
		|   СтавкаНДС,
		// - umk
		|	ХарактеристикаНоменклатуры КАК Характеристика,
		|   Упак КАК Упаковка,
		|	СерияНоменклатуры КАК Серия,
		|   ЕдиницаИзмерения
		|ИЗ 
		|	(ВЫБРАТЬ
		|		1 КАК НомерТЧ,
		|		МИНИМУМ(НомерСтроки) КАК НомерСтрокиТЧ,
		|		Номенклатура         КАК Номенклатура,
		|		ЕдиницаИзмерения     КАК ЕдиницаИзмерения,
		|		ЕдиницаИзмеренияМест КАК ЕдиницаИзмеренияМест,
		|		Цена                 КАК Цена,
		|		СтавкаНДС            КАК СтавкаНДС,
		|		ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки,
		|		ПроцентАвтоматическихСкидок КАК ПроцентАвтоматическихСкидок,
		|		СерияНоменклатуры    КАК СерияНоменклатуры,
		|		ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|		СУММА(Количество)    КАК Количество,
		|		СУММА(КоличествоМест)КАК КоличествоМест,
		|		СУММА(Сумма)         КАК Сумма,
		|       umk_УпаковкаНаПечать КАК  Упак,
		|		СУММА(СуммаНДС)      КАК СуммаНДС,
		|       umk_КодКлиента       КАК umk_КодКлиента
		|	ИЗ
		|		Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслуг
		|	ГДЕ
		|		РеализацияТоваровУслуг.Ссылка = &ТекущийДокумент
		|	СГРУППИРОВАТЬ ПО
		|		Номенклатура,
		|		ЕдиницаИзмерения,
		|		ЕдиницаИзмеренияМест,
		|		Цена,
		|		СтавкаНДС,
		|		ПроцентСкидкиНаценки,
		|		ПроцентАвтоматическихСкидок,
		|		СерияНоменклатуры,
		|       umk_УпаковкаНаПечать,
		|       umk_КодКлиента,
		|		ХарактеристикаНоменклатуры
		|	) КАК ВложенныйЗапросПоТоварам
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|   2,
		|   РеализацияТоваровУслуг.НомерСтроки,
		|	РеализацияТоваровУслуг.Номенклатура,
		|	" + СтрокаВыборкиПоляСодержания + ",
		|	Номенклатура.Код     КАК Код,
		|	Номенклатура."+ ТекстКодАртикулУслуги + " КАК КодАртикул,
		|	Количество,
		|	NULL,
		|	Номенклатура.ЕдиницаХраненияОстатков.Представление КАК ЕдиницаЦены,
		|	NULL,
		|	Цена,
		|	Сумма,
		|	СуммаНДС,
		|	ПроцентСкидкиНаценки,
		|	ПроцентАвтоматическихСкидок,
		// + umk
		|   СтавкаНДС, 
		|	NULL,
		// - umk
		|	NULL,
		|	NULL,
		|  Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаИзмерения
		|	
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслуг
		|
		|ГДЕ
		|	РеализацияТоваровУслуг.Ссылка = &ТекущийДокумент
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерТЧ, НомерСтрокиТЧ
		|";
		
		ЗапросТовары = Запрос.Выполнить().Выгрузить();
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТекущийДокумент", СсылкаНаОбъект);
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	НомерСтроки						КАК НомерСтрокиТЧ,
		|	Номенклатура,
		|	ВЫРАЗИТЬ(Номенклатура.НаименованиеПолное КАК СТРОКА(1000))  КАК Товар,
		|	Номенклатура.Код                КАК Код,
		|	Номенклатура."+ ТекстКодАртикулВозвратТара + " КАК КодАртикул,
		|	Количество,
		|	Номенклатура.ЕдиницаХраненияОстатков.Представление КАК ЕдиницаЦены,	
		|	Цена,
		|	Сумма
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.ВозвратнаяТара КАК РеализацияТоваровУслуг
		|
		|ГДЕ
		|	РеализацияТоваровУслуг.Ссылка = &ТекущийДокумент
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтрокиТЧ
		|";
		
		ЗапросТара = Запрос.Выполнить().Выгрузить();
		
		Макет = ПолучитьМакет("ПечатьНакладнаяУФ");
		
		// печать производится на языке, указанном в настройках пользователя
		КодЯзыкаПечать = Локализация.ПолучитьЯзыкФормированияПечатныхФорм(УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "РежимФормированияПечатныхФорм"));
		Макет.КодЯзыкаМакета = КодЯзыкаПечать;
		
		// Выводим шапку нкладной
		СведенияОПоставщике = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Поставщик, Шапка.Дата,,,КодЯзыкаПечать);
		СведенияОПокупателе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Покупатель, Шапка.Дата,,,КодЯзыкаПечать);
		
		// + umk
		Если  ЗначениеЗаполнено(Шапка.АдресДоставки) Тогда
			
			АдресДоставкиФакт = Шапка.АдресДоставки;
			
		ИначеЕсли  ЗначениеЗаполнено(Шапка.АдресДоставкиУТП) Тогда
			
			АдресДоставкиФакт = Шапка.АдресДоставкиУТП;
			
		Иначе
			
			АдресДоставкиФакт = СведенияОПокупателе.ЮридическийАдрес;	
			
		КонецЕсли;
		// - umk
		
		
		Если ЗначениеЗаполнено(СсылкаНаОбъект.БанковскийСчетОрганизации) Тогда
			НомерСчета = СсылкаНаОбъект.БанковскийСчетОрганизации.НомерСчета;
			Банк       = СсылкаНаОбъект.БанковскийСчетОрганизации.Банк;
			МФО		   = СсылкаНаОбъект.БанковскийСчетОрганизации.Банк.Код;
			
			СведенияОПоставщике.Вставить("НомерСчета",       НомерСчета);
			СведенияОПоставщике.Вставить("Банк",             Банк);
			СведенияОПоставщике.Вставить("МФО",              МФО);
		КонецЕсли;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		Если Шапка.ВидДоговораКонтрагента = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером  Тогда
			ОбластьМакета.Параметры.ТекстЗаголовка = ОбщегоНазначения.СформироватьЗаголовокДокумента(Шапка, НСтр("ru='Расходная накладная (на комиссию)';uk='Видаткова накладна (на комісію)'",КодЯзыкаПечать),КодЯзыкаПечать);
		Иначе	
			ОбластьМакета.Параметры.ТекстЗаголовка = ОбщегоНазначения.СформироватьЗаголовокДокумента(Шапка, НСтр("ru='Расходная накладная';uk='Видаткова накладна'",КодЯзыкаПечать),КодЯзыкаПечать);
		КонецЕсли; 
		ТабДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ОбластьМакета.Параметры.ПредставлениеПоставщика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике, "ПолноеНаименование,",,КодЯзыкаПечать);
		ОбластьМакета.Параметры.РеквизитыПоставщика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике, "НомерСчета,Банк,МФО,/,ЮридическийАдрес,Телефоны,/,КодПоЕДРПОУ,КодПоДРФО,ИНН,НомерСвидетельства,/,ИнформацияОСтатусеПлательщикаНалогов,/,ПлательщикНалогаНаПрибыль",,КодЯзыкаПечать);
		
		ТабДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
		ОбластьМакета.Параметры.Заполнить(Шапка);	
		ОбластьМакета.Параметры.ПредставлениеПокупателя = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе, "ПолноеНаименование,",,КодЯзыкаПечать);
		ОбластьМакета.Параметры.РеквизитыПокупателя		= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе, "ФактическийАдрес,Телефоны,",,КодЯзыкаПечать);
		ТабДокумент.Вывести(ОбластьМакета);
		
		// Выводим дополнительно информацию о договоре и сделке
		СписокДополнительныхПараметров = "ДоговорНаименованиеДляПечати,";
		Если Шапка.ПечататьСделку = Истина Тогда
			СписокДополнительныхПараметров = СписокДополнительныхПараметров + "Сделка,";
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(АдресДоставкиФакт) Тогда
			
			СписокДополнительныхПараметров = СписокДополнительныхПараметров + "АдресДоставки,";
			
		КонецЕсли;
		
		МассивСтруктурСтрок = ФормированиеПечатныхФорм.ДополнительнаяИнформация(Шапка,СписокДополнительныхПараметров,КодЯзыкаПечать);
		
		// + umk
		Если ЗначениеЗаполнено(АдресДоставкиФакт) Тогда
			МассивСтруктурСтрок.Добавить(Новый Структура("НазваниеПараметра, ЗначениеПараметра", "Адреса доставки:", АдресДоставкиФакт)); 	
		КонецЕсли;
		// - umk
		
		ОбластьМакета = Макет.ПолучитьОбласть("ДопИнформация");
		Для каждого СтруктураСтроки Из МассивСтруктурСтрок Цикл
			ОбластьМакета.Параметры.Заполнить(СтруктураСтроки);
			ТабДокумент.Вывести(ОбластьМакета);
		КонецЦикла;	
		
		// + umk
		ОбластьЗаказа = Макет.ПолучитьОбласть("Заказ");
		
		Если ЗначениеЗаполнено(Шапка.НомерЗаказа) Тогда 
			ОбластьЗаказа.Параметры.ПредставлениеЗаказа =   НСтр("ru='Заказ покупателя №" + Шапка.НомерЗаказа + " от " + Формат(Шапка.ДатаЗаказа,"ДФ=dd.MM.yyyy") + "';uk='Замовлення покупця №" + Шапка.НомерЗаказа + " від " + Формат(Шапка.ДатаЗаказа,"ДФ=dd.MM.yyyy") + "'",КодЯзыкаПечать);
			ТабДокумент.Вывести(ОбластьЗаказа);
		КонецЕсли;
		// - umk
		
		ЕстьСкидки = ЗапросТовары.Итог("Скидка") + ЗапросТовары.Итог("АвтоматическаяСкидка") <> 0;
		
		Если ВыводитьКоды Тогда
			ОбластьШапки  = "ШапкаСКодом";
			ОбластьСтроки = "СтрокаСКодом";
		Иначе
			ОбластьШапки  = "ШапкаТаблицы";
			ОбластьСтроки = "Строка";
		Конецесли;
		
		Если СсылкаНаОбъект.Товары.Итог("КоличествоМест") > 0 Тогда
			ОбластьШапки  = ОбластьШапки  + "Мест";
			ОбластьСтроки = ОбластьСтроки + "Мест";
		Конецесли;
		
		Если ЕстьСкидки Тогда
			ОбластьШапки  = ОбластьШапки  + "Скидка";
			ОбластьСтроки = ОбластьСтроки + "Скидка";
		КонецЕсли; 
		
		// Вывести табличную часть (товары и услуги)
		ОбластьМакета = Макет.ПолучитьОбласть(ОбластьШапки);
		Если ВыводитьКоды Тогда
			ОбластьМакета.Параметры.Колонка = Колонка;
		КонецЕсли;
		
		
		Суффикс = "";
		Суффикс2 = ""; // + umk
		Если Шапка.УчитыватьНДС Тогда
			Если Шапка.СуммаВключаетНДС Тогда
				Суффикс  = Суффикс  + НСтр("ru=' с ';uk=' з '",КодЯзыкаПечать);
				Суффикс2 = Суффикс2  + НСтр("ru=' без ';uk=' без '",КодЯзыкаПечать); // + umk
			Иначе	
				Суффикс  = Суффикс  + НСтр("ru=' без ';uk=' без '",КодЯзыкаПечать);
				Суффикс2  = Суффикс2  + НСтр("ru=' с ';uk=' з '",КодЯзыкаПечать); // + umk
				
			КонецЕсли;
			Суффикс = Суффикс  + НСтр("ru='НДС';uk='ПДВ'",КодЯзыкаПечать);
			Суффикс2 = Суффикс2  + НСтр("ru='НДС';uk='ПДВ'",КодЯзыкаПечать);// + umk
		КонецЕсли;
		ОбластьМакета.Параметры.Цена  = НСтр("ru='Цена';uk='Ціна'",КодЯзыкаПечать) + Суффикс;
		
		Попытка // Если нет в шапке. Для остальных вариантов сделаем потом.  // + umk
			ОбластьМакета.Параметры.Цена2  = НСтр("ru='Цена';uk='Ціна'",КодЯзыкаПечать) + Суффикс2;
		Исключение
		КонецПопытки;
		
		ОбластьМакета.Параметры.Сумма = НСтр("ru='Сумма';uk='Сума'",КодЯзыкаПечать)+ Суффикс;
		
		ТабДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть(ОбластьСтроки);
		
		Сумма    = 0;
		СуммаНДС = 0;
		ВсегоСкидок    = 0;
		ВсегоБезСкидок = 0;
		ВсегоКоличествоТовара = 0;
		
		Для каждого ВыборкаСтрокТовары из ЗапросТовары Цикл 
			
			Если НЕ ЗначениеЗаполнено(ВыборкаСтрокТовары.Номенклатура) Тогда
				Сообщить("В одной из строк не заполнено значение номенклатуры - строка при печати пропущена.", СтатусСообщения.Важное);
				Продолжить;
			КонецЕсли;
			
			ОбластьМакета.Параметры.Заполнить(ВыборкаСтрокТовары);
			
			// + umk
			Попытка  //Для остальных вариантов сделаем потом.
				Если Шапка.УчитыватьНДС Тогда
					Если Шапка.СуммаВключаетНДС Тогда
						ОбластьМакета.Параметры.Цена2 = ВыборкаСтрокТовары.Цена 
						- ВыборкаСтрокТовары.Цена * УчетНДС.ПолучитьСтавкуНДС(ВыборкаСтрокТовары.СтавкаНДС)* 0.01;	
					Иначе	
						ОбластьМакета.Параметры.Цена2 = ВыборкаСтрокТовары.Цена 
						+ ВыборкаСтрокТовары.Цена * УчетНДС.ПолучитьСтавкуНДС(ВыборкаСтрокТовары.СтавкаНДС)* 0.01;	
					КонецЕсли;
				КонецЕсли;
			Исключение
			КонецПопытки;
			// - umk
			
			ОбластьМакета.Параметры.НомерСтроки = ЗапросТовары.Индекс(ВыборкаСтрокТовары) + 1;
			ОбластьМакета.Параметры.Товар       = СокрЛП(ВыборкаСтрокТовары.Товар) + ?(ЗначениеЗаполнено(ВыборкаСтрокТовары.Упаковка),
			ФормированиеПечатныхФорм.ПредставлениеСерий(ВыборкаСтрокТовары, Шапка.Дата),
			" " + СокрЛП(ВыборкаСтрокТовары.Упаковка));
			
			НоменклатураГТД = ВыборкаСтрокТовары.Номенклатура.НоменклатураГТД; 
			
			Если ТипЗнч(НоменклатураГТД) = Тип("СправочникСсылка.КлассификаторУКТВЭД")
				Тогда
				КодУКТВЭД = НоменклатураГТД.Код;
			ИначеЕсли ТипЗнч(НоменклатураГТД) = Тип("СправочникСсылка.НоменклатураГТД")
				Тогда
				КодУКТВЭД = НоменклатураГТД.КодУКТВЭД.Код;
			КонецЕсли;
			
			ОбластьМакета.Параметры.КодУКТВЭД = КодУКТВЭД;
			
			Если ВыводитьКоды Тогда
				ОбластьМакета.Параметры.КодАртикул = ВыборкаСтрокТовары.КодАртикул;
			КонецЕсли;
			
			// Скидка может быть NULL
			ПроцентСкидки = ?(НЕ ЗначениеЗаполнено(ВыборкаСтрокТовары.Скидка),0,ВыборкаСтрокТовары.Скидка) 
			+ ?(НЕ ЗначениеЗаполнено(ВыборкаСтрокТовары.АвтоматическаяСкидка),0,ВыборкаСтрокТовары.АвтоматическаяСкидка);
			
			Скидка = Ценообразование.ПолучитьСуммуСкидки(ВыборкаСтрокТовары.Сумма, ПроцентСкидки);
			
			Если ЕстьСкидки Тогда
				ОбластьМакета.Параметры.Скидка         = Скидка;
				ОбластьМакета.Параметры.СуммаБезСкидки = ВыборкаСтрокТовары.Сумма + Скидка;
			КонецЕсли;
			
			ТабДокумент.Вывести(ОбластьМакета);
			
			Сумма    = Сумма    + ВыборкаСтрокТовары.Сумма;
			СуммаНДС = СуммаНДС + ВыборкаСтрокТовары.СуммаНДС;
			ВсегоСкидок    = ВсегоСкидок 	+ Скидка;
			ВсегоБезСкидок = Сумма + ВсегоСкидок;
			ВсегоКоличествоТовара = ВсегоКоличествоТовара +  ВыборкаСтрокТовары.Количество*ВыборкаСтрокТовары.ЕдиницаИзмерения.Коэффициент;
			
		КонецЦикла;
		
		ОбластьИтого = "Итого";
		Если ЕстьСкидки Тогда
			ОбластьИтого  = ОбластьИтого + "Скидка";
		КонецЕсли; 
		
		// Вывести Итого
		ОбластьМакета                 = Макет.ПолучитьОбласть(ОбластьИтого);
		ОбластьМакета.Параметры.Всего = ОбщегоНазначения.ФорматСумм(Сумма);
		Если ЕстьСкидки Тогда
			ОбластьМакета.Параметры.ВсегоБезСкидок	= ОбщегоНазначения.ФорматСумм(ВсегоБезСкидок);
			ОбластьМакета.Параметры.ВсегоСкидок		= ОбщегоНазначения.ФорматСумм(ВсегоСкидок);
		КонецЕсли; 
		
		ТабДокумент.Вывести(ОбластьМакета);
		
		// Вывести ИтогоНДС
		Если Шапка.УчитыватьНДС Тогда
			// НДС
			ОбластьМакета = Макет.ПолучитьОбласть("ИтогоНДС");
			ОбластьМакета.Параметры.ВсегоНДС = ОбщегоНазначения.ФорматСумм(СуммаНДС,,"''");
			ОбластьМакета.Параметры.НДС      = ?(Шапка.СуммаВключаетНДС, НСтр("ru='В том числе НДС:';uk='У тому числі ПДВ:'",КодЯзыкаПечать), НСтр("ru='Сумма НДС:';uk='Сума ПДВ:'",КодЯзыкаПечать));
			ТабДокумент.Вывести(ОбластьМакета);
			
			// всего с НДС (если сумма не включает НДС)
			Если НЕ Шапка.СуммаВключаетНДС Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("ИтогоНДС");
				ОбластьМакета.Параметры.ВсегоНДС = ОбщегоНазначения.ФорматСумм(Сумма + СуммаНДС);
				ОбластьМакета.Параметры.НДС      = НСтр("ru='Всего с НДС:';uk='Усього з ПДВ:'",КодЯзыкаПечать);
				ТабДокумент.Вывести(ОбластьМакета);
			КонецЕсли;
		КонецЕсли;
		
		// Вывести таблицу с возвратной тарой
		ОбластьШапки  = СтрЗаменить(ОбластьШапки,"Мест","");
		ОбластьСтроки = СтрЗаменить(ОбластьСтроки,"Мест","");
		ОбластьШапки  = СтрЗаменить(ОбластьШапки,"Скидка","")+"Тара";
		ОбластьСтроки = СтрЗаменить(ОбластьСтроки,"Скидка","")+"Тара";
		
		Если ЗапросТара.Количество() > 0 Тогда
			
			// сделаем отступ от основной таблицы
			ОбластьПробел = Макет.ПолучитьОбласть("Пробел");
			ТабДокумент.Вывести(ОбластьПробел);
			
			ОбластьМакета = Макет.ПолучитьОбласть(ОбластьШапки);
			Если ВыводитьКоды Тогда
				ОбластьМакета.Параметры.Колонка = Колонка;
			КонецЕсли;
			
			ТабДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть(ОбластьСтроки);
			
			СуммаТара    = 0;
			
			Для каждого ВыборкаСтрокТара Из ЗапросТара Цикл 
				
				ОбластьМакета.Параметры.Заполнить(ВыборкаСтрокТара);
				ОбластьМакета.Параметры.НомерСтроки = ЗапросТара.Индекс(ВыборкаСтрокТара) + 1;
				ОбластьМакета.Параметры.Товар       = СокрЛП(ВыборкаСтрокТара.Номенклатура);
				
				Если ВыводитьКоды Тогда
					ОбластьМакета.Параметры.КодАртикул = ВыборкаСтрокТара.КодАртикул;
				КонецЕсли;
				
				ТабДокумент.Вывести(ОбластьМакета);
				
				СуммаТара = СуммаТара + ВыборкаСтрокТара.Сумма;
				
			КонецЦикла; 
			
			// Вывести Итого
			ОбластьИтого = "ИтогоТара";
			ОбластьМакета                 = Макет.ПолучитьОбласть(ОбластьИтого);
			ОбластьМакета.Параметры.Всего = ОбщегоНазначения.ФорматСумм(СуммаТара);
			ТабДокумент.Вывести(ОбластьМакета);		
			
			// сделаем отступ
			ТабДокумент.Вывести(ОбластьПробел);
		КонецЕсли;
		
		// Вывести Сумму прописью
		ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописью");
		СуммаКПрописи = Сумма + ?(Шапка.СуммаВключаетНДС, 0, СуммаНДС);
		ОбластьМакета.Параметры.ИтоговаяСтрока = НСтр("ru='Всего наименований ';uk='Всього найменувань '",КодЯзыкаПечать) + ЗапросТовары.Количество() + "," +
		НСтр("ru=' на сумму ';uk=' на суму '",КодЯзыкаПечать)  + ОбщегоНазначения.ФорматСумм(СуммаКПрописи, Шапка.ВалютаДокумента)
		+ ?(ЗапросТара.Количество() = 0, "",  НСтр("ru='; возвратная тара ';uk='; зворотна тара '",КодЯзыкаПечать) + ЗапросТара.Количество() + НСтр("ru=', на сумму ';uk=', на суму '",КодЯзыкаПечать) + ОбщегоНазначения.ФорматСумм(СуммаТара, Шапка.ВалютаДокумента)) + ".";
		
		ОбластьМакета.Параметры.СуммаПрописью  = ОбщегоНазначения.СформироватьСуммуПрописью(СуммаКПрописи, Шапка.ВалютаДокумента,КодЯзыкаПечать)
		+ ?(НЕ Шапка.УчитыватьНДС, "", Символы.ПС + НСтр("ru='В т.ч. НДС: ';uk='У т.ч. ПДВ: '",КодЯзыкаПечать) + ОбщегоНазначения.СформироватьСуммуПрописью(СуммаНДС, Шапка.ВалютаДокумента, КодЯзыкаПечать));
		
		ОбластьМакета.Параметры.ИтоговаяСтрокаКоличество = НСтр("ru='Общий вес товаров составляет ';uk='Загальна вага товарів становить '",КодЯзыкаПечать)
		+ ОбщегоНазначения.ФорматСумм(ВсегоКоличествоТовара); 										 
		
		ТабДокумент.Вывести(ОбластьМакета);
		
		Если ЗначениеЗаполнено(Шапка.МестоСоставленияДокумента) Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("МестоСоставления");
			ОбластьМакета.Параметры.МестоСоставления = СокрЛП(Шапка.МестоСоставленияДокумента);
			ТабДокумент.Вывести(ОбластьМакета);
		КонецЕсли;
		
		// Вывести подписи
		ДанныеПредставителя = ОбщегоНазначения.ДанныеФизЛица(Шапка.Организация,Шапка.ПредставительПоставщика, Шапка.Дата);
		ДолжностьПредставителя = СокрЛП(ДанныеПредставителя.Должность);
		
		ДолжностьФИОПредставителя = ?(ЗначениеЗаполнено(ДолжностьПредставителя),ДолжностьПредставителя + " ","") + 
		?(ДанныеПредставителя.Фамилия = Неопределено,"",ДанныеПредставителя.Фамилия + " ") + 
		?(ДанныеПредставителя.Имя = Неопределено,"",ДанныеПредставителя.Имя + " ") +
		?(ДанныеПредставителя.Отчество = Неопределено,"",ДанныеПредставителя.Отчество);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ОбластьМакета.Параметры.Ответственный = ДолжностьФИОПредставителя;
		ТабДокумент.Вывести(ОбластьМакета);
		
		Если СсылкаНаОбъект.ПолучилПоДругомуДокументу Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("ПодписиПоДругомуДокументу");
		Иначе			
			ОбластьМакета = Макет.ПолучитьОбласть("ПодписиПоДоверенности");
		КонецЕсли; 
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ТабДокумент.Вывести(ОбластьМакета);
		
		ПервыйДокумент = Ложь;
		
	КонецЦикла;
	
	
КонецПроцедуры
