// Устанавливает параметр сеанса по организиции
Процедура УстановитьПараметрСеансаПоОрганизации(ЭтоНачалоРаботы, ЗаголовокСистемы = "")Экспорт
	
	ТекПользователь = глЗначениеПеременной("глТекущийПользователь");
	ЗапросОрганизации = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ЗапрашиватьПриСтартеОрганизацию");
	ОрганизацияОтбора = Справочники.Организации.ПустаяСсылка();
	ОсновнаяОрганизация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ОсновнаяОрганизация");
	
	Если Не ЭтоНачалоРаботы Тогда // Если вызов из меню
		
		ВвестиЗначение(ОрганизацияОтбора,"Значение организации для отбора в документах");
		// При старте системы	
	ИначеЕсли ЗапросОрганизации И Не ЗначениеЗаполнено(ОсновнаяОрганизация) Тогда 
		ВвестиЗначение(ОрганизацияОтбора,"Значение организации для отбора в документах");
	ИначеЕсли ЗапросОрганизации И ЗначениеЗаполнено(ОсновнаяОрганизация) Тогда
		ОрганизацияОтбора = ОсновнаяОрганизация; 
	КонецЕсли;
	   
	 УстановитьЗаголовокСистемы(?(ЗначениеЗаполнено(ОрганизацияОтбора) = Истина, ЗаголовокСистемы 
	 + ОрганизацияОтбора.Наименование, ЗаголовокСистемы + "Организация не выбрана" ));	
		
	
	ПараметрыСеанса.umk_Организация = ОрганизацияОтбора;
	
КонецПроцедуры

//Вызывается из меню umk_Полный для смены параметра сеанса Организация. 
Процедура Umk_ПолныйДействие2() Экспорт
	УстановитьПараметрСеансаПоОрганизации(Ложь);
КонецПроцедуры




