

Перем мВалютаРегламентированногоУчета Экспорт;

Перем мПараметрыСвязиСтрокТЧ Экспорт;

Перем мЕстьКолонкаСерии Экспорт;

Перем мСтруктураПараметровВзаиморасчетов Экспорт;

Перем мМинимальныеЦены Экспорт;

Перем мСписокФильтров Экспорт;

Перем мРассчитыватьАвтоматическиеСкидки;

Перем мСтруктураПараметровДляПолученияДоговора Экспорт;

//Перем мУказаниеСкладовВТЧ Экспорт;

Перем мУчетнаяПолитика;


////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

#Если Клиент Тогда
	
Функция ПолучитьЧастьЗапросаДляВыбораСодержанияУслуг(Знач ТабличнаяЧасть) 
	
	ТабличнаяЧасть = ТабличнаяЧасть + ?(ПустаяСтрока(ТабличнаяЧасть), "", ".");
	
	ЧастьЗапроса = 
	"	ВЫБОР 
	|		КОГДА НЕ (" + ТабличнаяЧасть + "Содержание ПОДОБНО """") ТОГДА
	|			ВЫРАЗИТЬ(" + ТабличнаяЧасть + "Содержание КАК Строка (1000))
	|		КОГДА НЕ (" + ТабличнаяЧасть + "Номенклатура.НаименованиеПолное ПОДОБНО """") ТОГДА
	|			ВЫРАЗИТЬ(" + ТабличнаяЧасть + "Номенклатура.НаименованиеПолное КАК Строка (1000))
	|		ИНАЧЕ
	|			" + ТабличнаяЧасть + "Номенклатура.Наименование
	|	КОНЕЦ";
	
	Возврат ЧастьЗапроса; 
	
КонецФункции // ПолучитьЧастьЗапросаДляВыбораСодержанияУслуг()
	
// Функция формирует табличный документ с печатной формой накладной,
// разработанной методистами
//
// Возвращаемое значение:
//  Табличный документ - печатная форма накладной
//
Функция ПечатьДокумента()
	
	// Запрос по шапке
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СпецификацияКДоговору.Номер,
	|	СпецификацияКДоговору.Дата,
	|	СпецификацияКДоговору.ДоговорКонтрагента,
	|	СпецификацияКДоговору.ДоговорКонтрагента.ВидДоговора КАК ВидДоговораКонтрагента,
	|	СпецификацияКДоговору.ДоговорКонтрагента.ВедениеВзаиморасчетов КАК ДоговорВедениеВзаиморасчетов,
	|	СпецификацияКДоговору.ДоговорКонтрагента.НаименованиеДляПечати КАК ДоговорНаименованиеДляПечати,
	|	СпецификацияКДоговору.ДоговорКонтрагента.ВыводитьИнформациюОСделкеПриПечатиДокументов КАК ПечататьСделку,
	|	СпецификацияКДоговору.Контрагент КАК Покупатель,
	|	СпецификацияКДоговору.Организация,
	|	СпецификацияКДоговору.Организация КАК Поставщик,
	|	СпецификацияКДоговору.Ответственный.ФизЛицо.Наименование КАК Отпустил,
	|	СпецификацияКДоговору.СуммаДокумента,
	|	СпецификацияКДоговору.ВалютаДокумента,
	|	СпецификацияКДоговору.УчитыватьНДС,
	|	СпецификацияКДоговору.СуммаВключаетНДС
	|ИЗ
	|	Документ.СпецификацияКДоговору КАК СпецификацияКДоговору
	|ГДЕ
	|	СпецификацияКДоговору.Ссылка = &ТекущийДокумент";
	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
	
	// Запрос по товарам
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_umk_СпецификацияКДоговору";

	СписокКолонок = НаборКолонокПечати.Получить(); //Получим из хранилища значений
	
	Если Не СписокКолонок = Неопределено Тогда
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);
	
	Текст = "ВЫБРАТЬ" + Символы.ПС;
	ТекстВыборки = "";
		
	Для Каждого ЭлементСписка Из СписокКолонок Цикл
		
		Если ЭлементСписка.Пометка Тогда
			
			ТекстВыборки = ТекстВыборки + "	Спецификация." + ЭлементСписка.Значение + "," + Символы.ПС; 
			
		КонецЕсли;
		
	КонецЦикла;
	
	ТекстВыборки = Лев(ТекстВыборки,СтрДлина(ТекстВыборки)-2); //Уберем запятую в конце
	Текст = Текст + ТекстВыборки;

		Текст = Текст + Символы.ПС + 
	    "ИЗ
		|	Документ.СпецификацияКДоговору.Товары КАК Спецификация
		|ГДЕ
		|	Спецификация.Ссылка = &ТекущийДокумент";
		
	Запрос.Текст = Текст;	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаТоваров = РезультатЗапроса.Выгрузить();

	// печать производится на языке, указанном в настройках пользователя
	Макет = ПолучитьМакет("Спецификация");
	//КодЯзыкаПечать = Локализация.ПолучитьЯзыкФормированияПечатныхФорм(УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "РежимФормированияПечатныхФорм"));
	Макет.КодЯзыкаМакета = "uk";	
	//Выводим шапку
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка|Столбец");
	Для n = 0 По ТаблицаТоваров.Колонки.Количество()-1 цикл
		Кол = ТаблицаТоваров.Колонки[n].Имя;
		ИмяКолонки = ?(Кол = "НомерСтроки","Номер п/п", Метаданные.Документы.СпецификацияКДоговору.ТабличныеЧасти.Товары.Реквизиты[Кол]);
		ОбластьШапка.Параметры.Имя = ИмяКолонки;
		Если n = 0 Тогда
			ТабДокумент.Вывести(ОбластьШапка);
		Иначе
			ТабДокумент.Присоединить(ОбластьШапка);
		КонецЕсли;    
	Конеццикла;    
	
	//выводим данные 
	ОбластьДанные = Макет.ПолучитьОбласть("Строка|Столбец");
	
	НомерСтроки = 1; 
	Для каждого СтрокаТоваров Из ТаблицаТоваров Цикл
		Для n = 0 По ТаблицаТоваров.Колонки.Количество()-1 цикл
			Если ТипЗнч(СтрокаТоваров[n]) = Тип("СправочникСсылка.Номенклатура") Тогда
				ОбластьДанные.Параметры.Значение = СокрЛП( СтрокаТоваров[n].НаименованиеПолное) + ФормированиеПечатныхФорм.ПредставлениеСерий(ВыборкаСтрокТовары(НомерСтроки), Дата); 
			Иначе // по общему правилу
				ОбластьДанные.Параметры.Значение = СтрокаТоваров[n];
			КонецЕсли;
			Если n = 0 Тогда
				ТабДокумент.Вывести(ОбластьДанные);
			Иначе
				ТабДокумент.Присоединить(ОбластьДанные);
			КонецЕсли;    
		КонецЦикла;    
	НомерСтроки = НомерСтроки +1;	
	Конеццикла;
	
	Иначе
	   Сообщить("Не выбран список колонок печати!", СтатусСообщения.Важное);
	КонецЕсли; // По списку колонок

	ТабДокумент.ОтображатьСетку = Истина;
	
	Возврат ТабДокумент;

		
КонецФункции // ПечатьДокумента()

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт

	// Получить экземпляр документа на печать
	Если ИмяМакета = "Спецификация" Тогда 
		ТабДокумент = ПечатьДокумента();
		ТабДокумент.Показать();
		Возврат
	КонецЕсли;

	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект), Ссылка);

КонецПроцедуры // Печать

Функция ВыборкаСтрокТовары(НомерСтроки)
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Товары.Ссылка,
		|	Товары.Номенклатура,
		|	Товары.СерияНоменклатуры КАК Серия,
		|	Товары.ХарактеристикаНоменклатуры КАК Характеристика
		|ИЗ
		|	Документ.СпецификацияКДоговору.Товары КАК Товары
		|ГДЕ
		|	Товары.НомерСтроки = &НомерСтроки
		|	И Товары.Ссылка = &ДокументСсылка";
	
	Запрос.УстановитьПараметр("НомерСтроки", НомерСтроки);
	Запрос.УстановитьПараметр("ДокументСсылка", ЭтотОбъект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Возврат  Выборка
	
КонецФункции


#КонецЕсли

// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	СтруктураМакетов = Новый Структура();
	
	СтруктураМакетов.Вставить("Спецификация", "Спецификация");
	
	Возврат СтруктураМакетов;
	
КонецФункции // ПолучитьСтруктуруПечатныхФорм()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события "ОбработкаЗаполнения".
//
Процедура ОбработкаЗаполнения(Основание)

	Если ТипЗнч(Основание) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
		
		Контрагент = Основание.Владелец;
		Организация = Основание.Организация;
		ДоговорКонтрагента = Основание.Ссылка;
		
	КонецЕсли
	
КонецПроцедуры // ОбработкаЗаполнения()

// Процедура вызывается перед записью документа 
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	мУдалятьДвижения = НЕ ЭтоНовый();
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	
КонецПроцедуры // ОбработкаПроведения()

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)

	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	ОбщегоНазначения.УдалитьРегистрациюДокументаВПоследовательностях(ЭтотОбъект);
	
КонецПроцедуры

// Функция проверяет возможность расчета автоматических скидок в документе.
//
// Возвращаемое значение:
//  Булево.
//
Функция МожноРассчитыватьАвтоматическиеСкидки() Экспорт

	Если мРассчитыватьАвтоматическиеСкидки = Неопределено Тогда
		Если ПолучитьЗначениеУчетнойПолитики().ИспользоватьСкидкиПоКоличествуТовара
		 Или ПолучитьЗначениеУчетнойПолитики().ИспользоватьСкидкиПоСуммеДокумента
		 Или ПолучитьЗначениеУчетнойПолитики().ИспользоватьСкидкиПоВидуОплаты
		 Или ПолучитьЗначениеУчетнойПолитики().ИспользоватьСкидкиПоДисконтнойКарте Тогда
			мРассчитыватьАвтоматическиеСкидки = Истина;
		Иначе
			мРассчитыватьАвтоматическиеСкидки = Ложь;
		КонецЕсли;
	КонецЕсли;

	Возврат мРассчитыватьАвтоматическиеСкидки;

КонецФункции // МожноРассчитыватьАвтоматическиеСкидки()
//
Функция РассчитыватьАвтоматическиеСкидки() Экспорт
	Возврат Истина;
КонецФункции
// Функция выполняет пересчет автоматических скидок в документе.
//
// Возвращаемое значение:
//  Булево - Истина, если автоматические скидки были рассчитаны.
//
Функция ПересчитатьАвтоматическиеСкидки() Экспорт

	Если РассчитыватьАвтоматическиеСкидки() Тогда
		СуммаДокументаБезСкидок = Ценообразование.ПолучитьСуммуДокументаБезСкидки(Товары);

		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ВидРеализации"                      , Перечисления.ВидыСкидок.Оптовая);
		СтруктураПараметров.Вставить("СуммаДокумента"                     , СуммаДокументаБезСкидок);
		СтруктураПараметров.Вставить("Карта"                              , ДисконтнаяКарта);
		СтруктураПараметров.Вставить("УчитыватьНДС"                       , УчитыватьНДС);
		СтруктураПараметров.Вставить("СуммаВключаетНДС"                   , СуммаВключаетНДС);
		СтруктураПараметров.Вставить("ВалютаРегламентированногоУчета"     , мВалютаРегламентированногоУчета);
		СтруктураПараметров.Вставить("УчетнаяПолитика"                    , ПолучитьЗначениеУчетнойПолитики());

		ОбработкаТабличныхЧастей.РассчитатьСкидкиПриПродаже(ЭтотОбъект, Товары, СтруктураПараметров, мМинимальныеЦены, мСписокФильтров);
		
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;

КонецФункции // ПересчитатьАвтоматическиеСкидки()

// Функция возвращает структуру со значениями учетной политики.
//
// Возвращаемое значение:
//  Структура.
//
Функция ПолучитьЗначениеУчетнойПолитики() Экспорт

	Если мУчетнаяПолитика = Неопределено Тогда
		мУчетнаяПолитика = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(?(ЭтоНовый(), ТекущаяДата(), Дата), Ложь);
	КонецЕсли;

	Возврат мУчетнаяПолитика;

КонецФункции // ПолучитьЗначениеУчетнойПолитики()

Процедура ПриИзмененииОрганизации(ПодменюДействияФормы = Неопределено, ЭлементыФормыНомер = Неопределено) Экспорт
	
	Если Не ПустаяСтрока(Номер) Тогда
		МеханизмНумерацииОбъектов.СброситьУстановленныйКодНомерОбъекта(ЭтотОбъект, "Номер", ПодменюДействияФормы, ЭлементыФормыНомер);
	КонецЕсли;
	
КонецПроцедуры

мПараметрыСвязиСтрокТЧ = Новый Соответствие;
мПараметрыСвязиСтрокТЧ.Вставить("Товары", Новый Структура("СвободныйКлюч, ФлагМодификации", Неопределено, Ложь));
мПараметрыСвязиСтрокТЧ.Вставить("СоставНабора", Новый Структура("СвободныйКлюч, ФлагМодификации", Неопределено, Ложь));

мВалютаРегламентированногоУчета   = глЗначениеПеременной("ВалютаРегламентированногоУчета");

мЕстьКолонкаСерии = глЗначениеПеременной("ИспользоватьСерииНоменклатуры");
мСтруктураПараметровВзаиморасчетов = Новый Структура;
мСтруктураПараметровВзаиморасчетов.Вставить("СтруктураТабличныхЧастей", Новый Структура("Товары, Услуги"));

мСтруктураПараметровДляПолученияДоговора = ЗаполнениеДокументов.ПолучитьСтруктуруПараметровДляПолученияДоговораПродажи();

мСписокФильтров = УправлениеПользователями.ПолучитьЗначениеПраваДляТекущегоПользователя(
   ПланыВидовХарактеристик.ПраваПользователей.НеОтпускатьТоварСЦенойНижеОпределенногоТипа,
   Неопределено);


мСтруктураПараметровДляПолученияДоговора = ЗаполнениеДокументов.ПолучитьСтруктуруПараметровДляПолученияДоговораПродажи();
