

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	мВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	мТекущаяДатаДокумента         = Объект.Дата;
	мПоДаннымУправленческогоУчета = Объект.ПоДаннымУправленческогоУчета;
	
	мСтараяОрганизация = Объект.Организация;
	мСтарыйКонтрагент  = Объект.Контрагент;
	мСтарыйДоговор     = Объект.ДоговорКонтрагента;
	мСтараяСделка      = Объект.Сделка;
		
	ПериодСверки.ДатаНачала = Объект.ДатаНачала;
	ПериодСверки.ДатаОкончания = объект.ДатаОкончания;
	ПоДаннымУчета = ?(Объект.ПоДаннымУправленческогоУчета = Истина,1,0);
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ДокументОбъект = РеквизитФормыВЗначение("Объект");
		
		ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ДокументОбъект, глЗначениеПеременной("глТекущийПользователь"), мВалютаРегламентированногоУчета);
		ОбщегоНазначения.ЗаполнитьОбязательныеРеквизитыШапкиНовогоДокумента(ДокументОбъект, глЗначениеПеременной("глТекущийПользователь"));
		
		ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
		
		Объект.СверкаСогласована = Ложь;
		
	КонецЕсли;
	
	// Пересчитать конечные остатки и расхождение
	ПересчитатьОстатки();
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		//Заполнить таблицу счетов значениями по умолчанию
		ЗаполнитьСписокСчетовЗначениямиПоУмолчанию();
	КонецЕсли;
	
	УстановитьВидимость();
	УстановитьДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПоДаннымУчетаПриИзменении(Элемент)
	Объект.ПоДаннымУправленческогоУчета = ?(ПоДаннымУчета = 1,Истина,Ложь);
	ЭтаФорма.Модифицированность = Истина;
	ПриИзмененииВидаУчета();
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииВидаУчета()
	
	Если Объект.ПоДаннымОрганизации.Количество() > 0 Тогда
		
		ТекстВопроса = НСтр("ru='При изменении вида заполнения табличные части с данными будут очищены. Продолжить?';uk='При зміні виду заповнення табличні частини з даними будуть очищені. Продовжити?'");
		ПоказатьВопрос(новый ОписаниеОповещения("ПриИзмененииВидаУчетаЗавершение",ЭтаФорма),ТекстВопроса,РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
		
	УстановитьВалютуДокумента();
	
	УстановитьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииВидаУчетаЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Объект.ПоДаннымУправленческогоУчета = мПоДаннымУправленческогоУчета;
		Возврат;
	КонецЕсли; 
	
	Объект.ПоДаннымОрганизации.Очистить();
	Объект.ПоДаннымКонтрагента.Очистить();
	
	мПоДаннымУправленческогоУчета = Объект.ПоДаннымУправленческогоУчета;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодСверкиПриИзменении(Элемент)
	
	Объект.ДатаНачала = ПериодСверки.ДатаНачала;
	Объект.ДатаОкончания = ПериодСверки.ДатаОкончания;
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура  ПриИзмененииЗначенияОрганизации()
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	// Выполняем общие действия для всех документов при изменении Организация.
	ЗаполнениеДокументов.ПриИзмененииЗначенияОрганизации(ДокументОбъект);
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
КонецПроцедуры

//Организация
&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОчиститьТЧ = Истина;
	
	Если Объект.Организация = мСтараяОрганизация Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьТабличныеЧасти("Организация", ОчиститьТЧ);
	
	Если Не ОчиститьТЧ Тогда
		ОрганизацияПриИзмененииЗавершение(КодВозвратаДиалога.Да, Новый Структура())
	КонецЕсли;

	УстановитьВидимость();
	УстановитьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзмененииЗавершение (Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.ПоДаннымОрганизации.Очистить();
		Объект.ПоДаннымКонтрагента.Очистить();
	Иначе
		Объект.Организация = мСтараяОрганизация;
		Возврат;
	КонецЕсли;

	Если Не ПустаяСтрока(Объект.Номер) Тогда
		СброситьУстановленныйКодНомер()
	КонецЕсли;
	
	ПриИзмененииЗначенияОрганизации();
	
	//ПриИзмененииДоговора();
	
	мСтараяОрганизация = Объект.Организация;
    
КонецПроцедуры
//Конец Организация

//Контрагент
&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	ОчиститьТЧ = Истина;
	
	Если Объект.Контрагент = мСтарыйКонтрагент Тогда
		Возврат;
	КонецЕсли;

	ОчиститьТабличныеЧасти("Контрагент", ОчиститьТЧ);
	
	Если Не ОчиститьТЧ Тогда
		КонтрагентПриИзмененииЗавершение(КодВозвратаДиалога.Да, Новый Структура())
	КонецЕсли;
	
	УстановитьВидимость();
	УстановитьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзмененииЗавершение (Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.ПоДаннымОрганизации.Очистить();
		Объект.ПоДаннымКонтрагента.Очистить();
	Иначе
		Объект.Контрагент = мСтарыйКонтрагент;
		Возврат;
	КонецЕсли;
	
	Объект.ПредставительКонтрагента = ЗначениеРеквизитаСервер(Объект.Контрагент,"ОсновноеКонтактноеЛицо");
	
	Если НЕ ЗначениеРеквизитаСервер(Объект.ДоговорКонтрагента,"Владелец") = Объект.Контрагент Тогда
		
		Объект.ДоговорКонтрагента = ПредопределенноеЗначение("Справочник.ДоговорыКонтрагентов.ПустаяСсылка");
		
	КонецЕсли;
	
	ПриИзменииКонтрагентаСервер();
	
	ПриИзмененииДоговора();
	//УстановитьПодписиВалют();
	
	мСтарыйКонтрагент = Объект.Контрагент;

КонецПроцедуры

Процедура ПриИзменииКонтрагентаСервер()Экспорт
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	// Выполняем общие действия для всех документов при изменении Контрагента
	ЗаполнениеДокументов.ПриИзмененииЗначенияКонтрагента(ДокументОбъект);
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");

КонецПроцедуры

//КОнец контрагент

//Сделка
&НаКлиенте
Процедура СделкаПриИзменении(Элемент)
	ПриИзмененииСделки();
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииСделки()
	
	ОчиститьТЧ = Истина;

	Если Объект.Сделка = мСтараяСделка Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьТабличныеЧасти("Сделка",ОчиститьТЧ);
	
	Если Не ОчиститьТЧ Тогда
		СделкаПриИзмененииЗавершение(КодВозвратаДиалога.Да, Новый Структура())
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура СделкаПриИзмененииЗавершение (Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.ПоДаннымОрганизации.Очистить();
		Объект.ПоДаннымКонтрагента.Очистить();
	Иначе
		Объект.Сделка = мСтараяСделка;
		Возврат;
	КонецЕсли;
	
	мСтараяСделка = Объект.Сделка;
	
КонецПроцедуры
//Конец сделка

//Договор
&НаКлиенте
Процедура ДоговорКонтрагентаПриИзменении(Элемент)
	
	ПриИзмененииДоговора();
	РазбитьПоДоговорамПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииДоговора()
	
	ОчиститьТЧ = Истина;
	
	Если Объект.ДоговорКонтрагента = мСтарыйДоговор Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьТабличныеЧасти("Договор", ОчиститьТЧ);
	
	Если Не ОчиститьТЧ Тогда
		  ДоговорПриИзмененииЗавершение(КодВозвратаДиалога.Да, Новый Структура())
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзмененииЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.ПоДаннымОрганизации.Очистить();
		Объект.ПоДаннымКонтрагента.Очистить();
	Иначе
		Объект.ДоговорКонтрагента = мСтарыйДоговор;
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ДоговорКонтрагента) Тогда
	
		Объект.Контрагент = ЗначениеРеквизитаСервер(Объект.ДоговорКонтрагента,"Владелец");	
		
		УстановитьВалютуДокумента();
		
	КонецЕсли;
	
	УстановитьДоступность();
	
	Объект.Сделка = неопределено;		
	ПриИзмененииСделки();
	
	мСтарыйДоговор = Объект.ДоговорКонтрагента;
	
КонецПроцедуры
//Конец Договор

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	мТекущаяДатаДокумента = Объект.Дата; // запомним текущую дату документа для контроля номера документа
	
	УстановитьДоступность();
	УстановитьВидимость();

КонецПроцедуры

&НаКлиенте
Процедура РазбитьПоДоговорамПриИзменении(Элемент)
	
	Если (Объект.ПоДаннымОрганизации.Количество() > 0) ИЛИ (Объект.ПоДаннымКонтрагента.Количество() > 0) Тогда
		ТекстВопроса = НСтр("ru='При изменении флажка, табличные части будут перезаполнены. Изменить?';uk='При зміні прапорця, табличні частини будуть перезаповнені. Змінити?'");
		ПоказатьВопрос(новый ОписаниеОповещения("РазбитьПоДоговорамПриИзмененииЗавершение",ЭтаФорма),ТекстВопроса,РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура РазбитьПоДоговорамПриИзмененииЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Объект.РазбитьПоДоговорам = НЕ Объект.РазбитьПоДоговорам;
		Возврат;
	КонецЕсли; 
	
	Если Объект.ПоДаннымОрганизации.Количество() > 0  Тогда
		Объект.ПоДаннымОрганизации.Очистить();
		ЗаполнитьПоДаннымБухгалтерскогоУчетаСервер();
	КонецЕсли;
	
	Если Объект.ПоДаннымКонтрагента.Количество() > 0 Тогда
		Объект.ПоДаннымКонтрагента.Очистить();
		ПоДаннымОрганизацииВопросЗавершение(КодВозвратаДиалога.Да, Новый Структура());
	КонецЕсли;
	
	УстановитьВидимость();
	ПересчитатьОстатки();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыводитьПолныеНазванияДокументовПриИзменении(Элемент)
	
	ОчиститьТЧ = Истина;
	ОчиститьТабличныеЧасти("ВыводитьПолныеНазвания",ОчиститьТЧ);
	Если Не ОчиститьТЧ Тогда
		УстановитьВидимость();	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыводитьПолныеНазванияПриИзмененииЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.ПоДаннымОрганизации.Очистить();
		Объект.ПоДаннымКонтрагента.Очистить();
		УстановитьВидимость();
	Иначе
		Объект.ВыводитьПолныеНазванияДокументов = Не Объект.ВыводитьПолныеНазванияДокументов;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СверкаСогласованаПриИзменении(Элемент)
	УстановитьДоступность();
КонецПроцедуры

#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура КомандаПоДаннымКонтрагентаОрганизацииЗаполнить(Команда)
	
	Если Объект.ПоДаннымКонтрагента.Количество() > 0 Тогда
		
		ТекстВопроса = НСтр("ru='Перед заполнением табличная часть будет очищена. Заполнить?';uk='Перед заповненням таблична частина буде очищена. Заповнити?'");
		ПоказатьВопрос(Новый ОписаниеОповещения("ПоДаннымКонтрагентаОрганизацииЗавершение",ЭтаФорма),ТекстВопроса,РежимДиалогаВопрос.ДаНет);
	Иначе
		ПоДаннымКонтрагентаОрганизацииЗавершение(КодВозвратаДиалога.Да,Новый Структура()) 
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПоДаннымКонтрагентаОрганизацииЗавершение(Результат,ДопПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли; 
	
	Объект.ПоДаннымКонтрагента.Очистить();
	ПоДаннымКонтрагентаОрганизацииСервер();
	ПересчитатьОстатки();
	
КонецПроцедуры

&НаСервере
Процедура ПоДаннымКонтрагентаОрганизацииСервер() Экспорт
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	Документы.АктСверкиВзаиморасчетов.менедж_ЗаполнитьПоДаннымОрганизации(ДокументОбъект);
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");	
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры
	
&НаКлиенте
Процедура КомандаПоДаннымОрганизацииЗаполнить(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Контрагент) Тогда
		Текст = НСтр("ru='Не выбран контрагент!';uk='Не обраний контрагент!'");
		ПоказатьПредупреждение(,Текст);
		Возврат;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Объект.ВалютаДокумента) Тогда
		Текст = НСтр("ru='Не выбрана валюта документа!';uk='Не обрана валюта документа!'");
		ПоказатьПредупреждение(,Текст);
		Возврат;
	КонецЕсли;
	
	Если Объект.ДатаОкончания < Объект.ДатаНачала Или 
		Не ЗначениеЗаполнено(Объект.ДатаОкончания) Или Не ЗначениеЗаполнено(Объект.ДатаНачала) Тогда
	    Текст =НСтр("ru='Неверно задан период сверки расчетов!';uk='Невірно заданий період звірки розрахунків!'");
		ПоказатьПредупреждение(,Текст);
		Возврат;
	КонецЕсли;

	Если Объект.ПоДаннымОрганизации.Количество() > 0 Тогда
		ТекстВопроса = НСтр("ru='Перед заполнением табличная часть будет очищена. Заполнить?';uk='Перед заповненням таблична частина буде очищена. Заповнити?'");
		ПоказатьВопрос(Новый ОписаниеОповещения("ПоДаннымОрганизацииВопросЗавершение",ЭтаФорма),ТекстВопроса,РежимДиалогаВопрос.ДаНет);
	Иначе	
		Если Объект.ПоДаннымУправленческогоУчета Тогда
			ЗаполнитьПоДаннымУправленческогоУчетаСервер();
		Иначе	
			ЗаполнитьПоДаннымБухгалтерскогоУчетаСервер();
		КонецЕсли;
		
		ПересчитатьОстатки();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоДаннымУправленческогоУчетаСервер()
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	Документы.АктСверкиВзаиморасчетов.менедж_ЗаполнитьПоДаннымУправленческогоУчета(ДокументОбъект);
	//ДокументОбъект.ЗаполнитьПоДаннымУправленческогоУчета();
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоДаннымБухгалтерскогоУчетаСервер()
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	Документы.АктСверкиВзаиморасчетов.менедж_ЗаполнитьПоДаннымБухгалтерскогоУчета(ДокументОбъект);
	//ДокументОбъект.ЗаполнитьПоДаннымБухгалтерскогоУчета();
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПоДаннымОрганизацииВопросЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли; 
	
	Объект.ПоДаннымОрганизации.Очистить();
	
	Если Объект.ПоДаннымУправленческогоУчета Тогда
		ЗаполнитьПоДаннымУправленческогоУчетаСервер();
	Иначе	
		ЗаполнитьПоДаннымБухгалтерскогоУчетаСервер();
	КонецЕсли;
	
	ПересчитатьОстатки();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСписокСчетовЗаполнитьПоУмолчанию(Команда)
	ЗаполнитьСписокСчетовЗначениямиПоУмолчанию(Истина);
    ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицФормы

&НаКлиенте
Процедура ПоДаннымОрганизацииПослеУдаления(Элемент)
	ПересчитатьОстатки();
КонецПроцедуры

&НаКлиенте
Процедура ПоДаннымОрганизацииПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	ПересчитатьОстатки();
КонецПроцедуры

&НаКлиенте
Процедура ПоДаннымКонтрагентаПослеУдаления(Элемент)
	ПересчитатьОстатки();
КонецПроцедуры

&НаКлиенте
Процедура ПоДаннымКонтрагентаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ПересчитатьОстатки();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВалютуДокумента()

	Если ЗначениеЗаполнено(Объект.ДоговорКонтрагента) Тогда
			
		Если    Объект.ПоДаннымУправленческогоУчета  
			ИЛИ ЗначениеРеквизитаСервер(Объект.ДоговорКонтрагента,"Внешнеэкономический") Тогда
			
			Объект.ВалютаДокумента = ЗначениеРеквизитаСервер(Объект.ДоговорКонтрагента,"ВалютаВзаиморасчетов");
				
		Иначе
				
			Объект.ВалютаДокумента = мВалютаРегламентированногоУчета;
				
		КонецЕсли;
			
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	Если ЗначениеЗаполнено(Объект.ДоговорКонтрагента) Тогда
		Элементы.РазбитьПоДоговорам.Доступность = Ложь;
		Объект.РазбитьПоДоговорам= Ложь;
		Элементы.ПоДаннымОрганизацииДоговорКонтрагента.Видимость = Ложь; 
		Элементы.ПоДаннымКонтрагентаДоговорКонтрагента.Видимость = Ложь; 
	Иначе
		Элементы.РазбитьПоДоговорам.Доступность = Истина;
		Элементы.ПоДаннымОрганизацииДоговорКонтрагента.Видимость = Истина; 
		Элементы.ПоДаннымКонтрагентаДоговорКонтрагента.Видимость = Истина;
	КонецЕсли;
	
    Если Объект.РазбитьПоДоговорам Тогда
    	Элементы.ПоДаннымОрганизацииДоговорКонтрагента.Видимость = Истина; 
    	Элементы.ПоДаннымКонтрагентаДоговорКонтрагента.Видимость = Истина; 
		Объект.ПоДаннымОрганизации.Сортировать("ДоговорКонтрагента, Дата,Документ,Представление");		
    Иначе
		Объект.ПоДаннымОрганизации.Сортировать("Дата,Документ,Представление");	
    	Элементы.ПоДаннымОрганизацииДоговорКонтрагента.Видимость = Ложь; 
    	Элементы.ПоДаннымКонтрагентаДоговорКонтрагента.Видимость = Ложь; 
	КонецЕсли;
    Если Объект.ВыводитьПолныеНазванияДокументов Тогда
    	Элементы.ПоДаннымОрганизацииДокумент.Видимость = Ложь; 
    Иначе
    	Элементы.ПоДаннымОрганизацииДокумент.Видимость = Истина;
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступность()
	
	Если Объект.СверкаСогласована = Истина Тогда
		Элементы.Организация.Доступность		  = Ложь;
		Элементы.ПоДаннымКонтрагента.Доступность  = Ложь;
		Элементы.ПоДаннымОрганизации.Доступность  = Ложь;
		Элементы.Контрагент.Доступность           = Ложь;
		Элементы.ДоговорКонтрагента.Доступность   = Ложь;
		Элементы.ОстатокНаНачало.Доступность      = Ложь;
		Элементы.СписокСчетов.Доступность 		  = ложь;
		Элементы.ВалютаДокумента.Доступность 	  = ложь;
		Элементы.ПериодСверки.Доступность = ложь;
		
		Элементы.ПоДаннымОрганизации.КоманднаяПанель.Доступность	= Ложь;
		Элементы.ПоДаннымКонтрагента.КоманднаяПанель.Доступность	= Ложь;
		Элементы.СписокСчетов.КоманднаяПанель.Доступность        = Ложь;
		Элементы.ПоДаннымУчета.Доступность = Ложь;
		
	Иначе
		Элементы.Организация.Доступность 		  = Истина;
		
		Если ЗначениеРеквизитаСервер(Объект.ДоговорКонтрагента,"ВедениеВзаиморасчетов") 
			    = ПредопределенноеЗначение("Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом") Тогда
			Элементы.Сделка.Доступность = Ложь;
		Иначе
			Элементы.Сделка.Доступность = Истина;
		КонецЕсли;
		Элементы.ПоДаннымКонтрагента.Доступность = Истина;
		Элементы.ПоДаннымОрганизации.Доступность = Истина;
		Элементы.Контрагент.Доступность          = Истина;
		Элементы.ДоговорКонтрагента.Доступность  = Истина;
		Элементы.ОстатокНаНачало.Доступность     = Истина;
		Элементы.СписокСчетов.Доступность 		 = Истина;
		
		Если Не ЗначениеЗаполнено(Объект.ДоговорКонтрагента) Тогда
			Элементы.ВалютаДокумента.Доступность   = Истина;
		Иначе
			Элементы.ВалютаДокумента.Доступность   = Ложь;
		КонецЕсли;
		
		Элементы.ПериодСверки.Доступность = Истина;
		
		Элементы.ПоДаннымОрганизации.КоманднаяПанель.Доступность    = Истина;
		Элементы.ПоДаннымКонтрагента.КоманднаяПанель.Доступность    = Истина;
		Элементы.СписокСчетов.КоманднаяПанель.Доступность       	= Истина;
		
		Элементы.ПоДаннымУчета.Доступность = Истина;
		
		Элементы.ГруппаСчетаРасчетов.Видимость = НЕ Объект.ПоДаннымУправленческогоУчета;
		
		//КнопкаЗаполнить = ЭлементыФормы.КоманднаяПанельПоДаннымОрганизации.Кнопки.ПодменюЗаполнить.Кнопки.Заполнить;
		//КнопкаЗаполнить.Текст = НСтр("ru='Заполнить по данным ';uk='Заповнити за даними '") + ?(ПоДаннымУправленческогоУчета, "упр.", "бух.") + НСтр("ru=' учета';uk=' обліку'");
		//КнопкаЗаполнить.Подсказка = НСтр("ru='Заполнить по данным ';uk='Заповнити за даними '") + ?(ПоДаннымУправленческогоУчета, "управленческого", "бухгалтерского") + НСтр("ru=' учета';uk=' обліку'");
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТабличныеЧасти(ИмяРеквизита, ОчиститьТЧ = Истина)
	
	Если Объект.ПоДаннымКонтрагента.Количество() > 0 ИЛИ Объект.ПоДаннымОрганизации.Количество() > 0 Тогда
		ТекстВопроса = НСтр("ru='Табличные части ""По данным организации"" и ""По данным контрагента"" будут очищены. Продолжить?';uk='Табличні частини ""За даними організації"" і ""За даними контрагента"" будуть очищені. Продовжити?'");
		ПоказатьВопрос(новый ОписаниеОповещения(ИмяРеквизита + "ПриИзмененииЗавершение",ЭтаФорма),ТекстВопроса,РежимДиалогаВопрос.ДаНет);
	Иначе
		ОчиститьТЧ = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗначениеРеквизитаСервер(ОбъектСсылка,ИмяРекизита)
	Возврат ОбъектСсылка[ИмяРекизита] 	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьСписокСчетовЗначениямиПоУмолчанию(ВыдаватьСообщения = Ложь)
	
	Если Объект.СписокСчетов.Количество() > 0 тогда
		
		Если ВыдаватьСообщения Тогда
			
			ТекстВопроса = НСтр("ru='Перед заполнением табличная часть будет очищена. Заполнить?';uk='Перед заповненням таблична частина буде очищена. Заповнити?'");
			ПоказатьВопрос(новый ОписаниеОповещения("ЗаполнитьСписокСчетовЗначениямиПоУмолчаниюЗавершение",ЭтаФорма),ТекстВопроса,РежимДиалогаВопрос.ДаНет);
			Возврат;
		КонецЕсли;
		
		Объект.СписокСчетов.Очистить();
		
	КонецЕсли;
	
	ЗаполнитьСписокСчетов();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокСчетовЗначениямиПоУмолчаниюЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.СписокСчетов.Очистить();
		ЗаполнитьСписокСчетов();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокСчетов()
	
	СчетаПоУмолчанию = Новый Массив();
	СчетаПоУмолчанию.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПоставщикамиИПодрядчиками);
	СчетаПоУмолчанию.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПокупателямиИЗаказчиками);
	СчетаПоУмолчанию.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоВыданнымАвансам);
	СчетаПоУмолчанию.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСДругимиДебиторами);
	СчетаПоУмолчанию.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоАвансамПолученным);
	СчетаПоУмолчанию.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСДругимиКредиторами);
	
	Для Счетчик =1  По СчетаПоУмолчанию.Количество() Цикл
		СтрокаСчета = Объект.СписокСчетов.Добавить();
		СтрокаСчета.УчаствуетВРасчетах = Истина;
		СтрокаСчета.Счет = СчетаПоУмолчанию[Счетчик-1];
	КонецЦикла; 
		
КонецПроцедуры

&НаСервере
Процедура ПересчитатьОстатки()

	ОстатокНаКонец = Объект.ОстатокНаНачало + Объект.ПоДаннымОрганизации.Итог("Дебет") - Объект.ПоДаннымОрганизации.Итог("Кредит");
	ОстатокНаНачалоКонтрагент= - Объект.ОстатокНаНачало;
	ОстатокНаКонецКонтрагент = - Объект.ОстатокНаНачало + Объект.ПоДаннымКонтрагента.Итог("Дебет") - Объект.ПоДаннымКонтрагента.Итог("Кредит");
	
	Если Расхождение <> ОстатокНаКонец + ОстатокНаКонецКонтрагент Тогда
		Расхождение = ОстатокНаКонец + ОстатокНаКонецКонтрагент;
	КонецЕсли; 
	
	РасхождениеКонтрагент = Расхождение*(-1);
	
	Объект.Расхождение = Расхождение;

КонецПроцедуры

&НаСервере
Процедура СброситьУстановленныйКодНомер()
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	МеханизмНумерацииОбъектов.СброситьУстановленныйКодНомерОбъекта(ДокументОбъект, "Номер");
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
КонецПроцедуры	

#КонецОбласти
